-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Ноя 02 2022 г., 23:31
-- Версия сервера: 5.7.27-30
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `u1611639_default`
--

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_conversations`
--

CREATE TABLE `hv1sys_conversations` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_one` int(10) NOT NULL,
  `user_two` int(10) NOT NULL,
  `status` tinyint(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_conversations`
--

INSERT INTO `hv1sys_conversations` (`id`, `user_one`, `user_two`, `status`, `created_at`, `updated_at`) VALUES
(39, 4838, 5007, 1, '2022-10-29 13:52:42', '2022-10-29 13:52:42'),
(40, 4815, 4838, 1, '2022-10-29 13:53:08', '2022-10-29 13:58:39'),
(41, 4838, 47744, 1, '2022-10-29 13:55:01', '2022-10-29 13:59:22'),
(42, 9753, 47744, 1, '2022-10-29 13:58:47', '2022-10-29 13:58:47'),
(43, 1739, 400000, 1, '2022-10-31 14:43:37', '2022-11-01 19:16:56'),
(44, 1739, 400001, 1, '2022-11-01 01:29:03', '2022-11-02 21:54:13');

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_failed_jobs`
--

CREATE TABLE `hv1sys_failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_messages`
--

CREATE TABLE `hv1sys_messages` (
  `id` int(10) UNSIGNED NOT NULL,
  `message` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_seen` tinyint(1) NOT NULL DEFAULT '0',
  `deleted_from_sender` tinyint(1) NOT NULL DEFAULT '0',
  `deleted_from_receiver` tinyint(1) NOT NULL DEFAULT '0',
  `user_id` int(10) NOT NULL,
  `conversation_id` int(10) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_messages`
--

INSERT INTO `hv1sys_messages` (`id`, `message`, `is_seen`, `deleted_from_sender`, `deleted_from_receiver`, `user_id`, `conversation_id`, `created_at`, `updated_at`) VALUES
(545, 'Привет, Кит!', 1, 0, 0, 400000, 43, '2022-10-31 15:00:30', '2022-10-31 15:00:30'),
(546, '[HACKING_777]\nПроизведён взлом \"Подмена ID в нейроинтерфейсе на 30 минут, на ID другого существующего пользователя, выполняется автоматически после выполнения мини-игры\", комментарий \"40488\"', 1, 0, 0, 1739, 44, '2022-11-01 01:29:03', '2022-11-01 01:29:03'),
(547, '[HACKING_777]\nПроизведён взлом \"Подмена ID в нейроинтерфейсе на 30 минут, на ID другого существующего пользователя, выполняется автоматически после выполнения мини-игры\", комментарий \"40488\"', 1, 0, 0, 1739, 44, '2022-11-01 01:36:13', '2022-11-01 01:36:13'),
(548, '[HACKING_777]\nПроизведён взлом \"Подмена ID в нейроинтерфейсе на 30 минут, на ID другого существующего пользователя, выполняется автоматически после выполнения мини-игры\", комментарий \"14400\"', 1, 0, 0, 1739, 44, '2022-11-01 01:40:47', '2022-11-01 01:40:47'),
(549, '[HACKING_777]\nПроизведён взлом \"Подмена ID в нейроинтерфейсе на 30 минут, на ID другого существующего пользователя, выполняется автоматически после выполнения мини-игры\", комментарий \"3310\"', 1, 0, 0, 1739, 44, '2022-11-01 01:42:31', '2022-11-01 01:42:31'),
(550, 'https://psv4.userapi.com/c235131/u52526235/docs/d1/0d0616ab3568/1623927401_14-phonoteka_org-p-pattern-mikroskhema-krasivo-14.jpg?extra=mY3tIhbEQiNc1Ji-NgHrJL5FkvfMM-S7AjYYP_MyQt0PUZu6pVrQiqDUHrgbDEDL_yvudTpcK5gpML0zh0e8si2SRqQd8gXk36-Nrzgp90t8UwQQ-OTKbmovU_1gY-6SYcAxory06YzodUownDFm', 1, 0, 0, 400000, 43, '2022-11-01 19:16:56', '2022-11-01 19:16:56'),
(551, '[HACKING_777]\nПри отбитии метеоритов было пропущено 1 метеоритов', 1, 0, 0, 1739, 44, '2022-11-01 21:28:27', '2022-11-01 21:28:27'),
(552, 'Выбрано лечение по диагнозу \"Термическая Средняя\"', 1, 0, 0, 1739, 44, '2022-11-02 21:36:41', '2022-11-02 21:36:41'),
(553, 'Выбрано лечение по диагнозу \"Термическая Тяжелая\"', 0, 0, 0, 1739, 44, '2022-11-02 21:54:13', '2022-11-02 21:54:13');

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_migrations`
--

CREATE TABLE `hv1sys_migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_migrations`
--

INSERT INTO `hv1sys_migrations` (`id`, `migration`, `batch`) VALUES
(11, '2014_10_12_000000_create_users_table', 1),
(12, '2014_10_12_100000_create_password_resets_table', 1),
(13, '2019_08_19_000000_create_failed_jobs_table', 1),
(14, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(15, '2022_08_27_122148_create_permission_tables', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_model_has_permissions`
--

CREATE TABLE `hv1sys_model_has_permissions` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_model_has_roles`
--

CREATE TABLE `hv1sys_model_has_roles` (
  `role_id` bigint(20) UNSIGNED NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_password_resets`
--

CREATE TABLE `hv1sys_password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_permissions`
--

CREATE TABLE `hv1sys_permissions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guard_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_personal_access_tokens`
--

CREATE TABLE `hv1sys_personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_quests`
--

CREATE TABLE `hv1sys_quests` (
  `id` bigint(20) UNSIGNED NOT NULL COMMENT 'ID',
  `title` varchar(255) NOT NULL DEFAULT 'Тестовый квест' COMMENT 'Квест',
  `description` text COMMENT 'Описание',
  `reward` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'Награда (ед.)',
  `penalty` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'Пенальти в случае провала',
  `startTime` timestamp NOT NULL DEFAULT '2022-12-31 18:00:00' COMMENT 'Начало квеста',
  `endTime` timestamp NULL DEFAULT NULL COMMENT 'Конец квеста',
  `avalTime` smallint(5) UNSIGNED NOT NULL DEFAULT '60' COMMENT 'Отпущеное время, в минутах',
  `placeId` tinyint(3) UNSIGNED DEFAULT '0',
  `modelId` tinyint(3) UNSIGNED DEFAULT '0',
  `difficulty` smallint(5) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'Сложность квеста',
  `status` tinyint(3) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'Статус квеста',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `hv1sys_quests`
--

INSERT INTO `hv1sys_quests` (`id`, `title`, `description`, `reward`, `penalty`, `startTime`, `endTime`, `avalTime`, `placeId`, `modelId`, `difficulty`, `status`, `created_at`, `updated_at`) VALUES
(904699, 'Организуйте новый год', 'Время отпраздновать новый год! Найдите и украсьте елку', 100, 50, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 16:57:45', '2022-10-29 16:57:45'),
(904700, 'Примите роды у кошки', 'Мурка скоро родит котят, позаботьтесь о корректном прохождении процесса', 300, 5000, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 16:59:36', '2022-10-29 16:59:36'),
(904701, 'Лизни соседа', 'Покажи свои чувства! Найди любимого колониста! Лизни его! СДЕЛАЙ ЭТО!!!', 1000, 200, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:00:51', '2022-10-29 17:00:51'),
(904702, 'Посадите картофель', 'Осуществить посадку клубней картофеля в аграрный модуль  26', 0, 0, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:01:51', '2022-10-29 17:01:51'),
(904703, 'Геноцид бобров', 'Бобр не добр', 100, 3000, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:02:40', '2022-10-29 17:02:40'),
(904704, 'Замените батарейку в плазменной турелли', 'Отправьтесь в военный модуль и произведите замену источника питания в автономной плазменной турелли', 50, 50, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:03:53', '2022-10-29 17:03:53'),
(904705, 'Устраните духоту в аварийном модуле', 'Проверите помещение аварийного модуля путем открытия всех шлюзов примыкающих к нему', 150, 300, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:05:22', '2022-10-29 17:05:22'),
(904706, 'Ты не пройдешь!', 'Закройте ближайший шлюз и воспрепятствуйте его открытию в течение 30 минут', 100, 25, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:06:29', '2022-10-29 17:06:29'),
(904707, 'Нид ту пей', 'Ю нид ту пей ёр рент фор ливинг ин зе емерджинсе модуле. Пей 300 бакс', 0, 600, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:08:14', '2022-10-29 17:08:14'),
(904708, 'Физ минутка', 'Осуществить 10 отжиманий, 10 приседаний и 10 упражнений на пресс в зоне видимости камер', 10000000, 100000000, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:10:57', '2022-10-29 17:10:57'),
(904709, 'Защитите поле конопли', 'Коноплю пожрал колорад. Синтезируйте химикаты для обработки растений и осуществить опрыскивание модуля Б-31', 500, 7000, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:12:28', '2022-10-29 17:12:28'),
(904710, 'Тест магазина', 'Осуществить тестовую покупку всех товаров в магазине по 1 штуке', 1200, 2400, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:13:44', '2022-10-29 17:14:06'),
(904711, 'Секс робот', 'Выявлен недостаток в количестве секс андроидов на экспедицию. Соорудите в помощь им секс робота, оборудованного флюгергехаймером.', 200, 300, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:16:37', '2022-10-29 17:16:37'),
(904712, 'Выпейте воды', 'Выпейте стакан воды', 10, 5, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:17:13', '2022-10-29 17:17:13'),
(904713, 'Аларм', 'Омаева мо шиндеру', 0, 110, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:18:33', '2022-10-29 17:18:33'),
(904714, 'Переведите бабушку', 'Осуществить перевод бабушки ИД 666 через транспортную магистраль 60', 150, 150, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:20:41', '2022-10-29 17:20:41'),
(904715, 'Соревнование по макарене', 'У группы колонистов выявлен повышенный уровень стресса. Организуйте для них танцевальный флешмоб-соревнование по макарене', 200, 50, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:22:10', '2022-10-29 17:22:10'),
(904716, 'Подготовка обряда бракосочетания', 'Подготовьте и осуществить обряд бракосочетания в соответствиями с древними традициями племени апачей между колонистами ИД14400  и ИД1261', 250, 700, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:24:19', '2022-10-29 17:24:19'),
(904717, 'Изучите алфавит', 'Система выявила у вас критическую нехватку знаний. Срочно изучите и зачитайте на камеру полный латинский алфавит без источников подсказок.', 100, 300, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:26:47', '2022-10-29 17:26:47'),
(904718, 'Трансплантация почки', 'Осуществить трансплантацию здоровой почки от колониста ИД23337 к колониста ИД273', 1, 2, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:29:16', '2022-10-29 17:29:16'),
(904719, 'Похороны', 'Необходимо провести похороны колониста *вписать ид того, на кого упадет* в соответствии с традициями племени уюмба', 5, 10000, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:31:09', '2022-10-29 17:31:09'),
(904720, 'Выгулять собаку', 'В течение часа гуляйте с собакой бобиком. Проконтролируйте его процесс дефикации. Поместите результаты процесса дефикации в медицинский модуль для анализа', 6, 16, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:32:56', '2022-10-29 17:32:56'),
(904721, 'Поминки', 'От души помяните колониста Кита Эддингтона. Светлая память смельчаку. Власть АНТИМА!', 50, 13, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:34:28', '2022-10-29 17:34:28'),
(904722, 'Поменяй колесо', 'Осуществить замену пробитого колеса в подвижном автономном модуле номер 4532&#75&', 103, 103, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:37:55', '2022-10-29 17:37:55'),
(904723, 'Слэм тайм', 'Соберите всех колонистов в основном отсеке аварийного модуля и устройте слэм! Время хардкора!', 13, 666, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:39:18', '2022-10-29 17:39:18'),
(904724, 'Обучение секс андройда', 'Нейросети секс андройда требуется обучение. Организуйте групповую сессию обучения с количеством участников не менее 3х и количеством разнообразных поз не менее 7. Продолжительность сессии не менее часа', 300, 500, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:41:44', '2022-10-29 17:41:44'),
(904725, 'Задержание и казнь', 'Осуществите задержание и публичную казнь колониста ИД27545', 50, 40, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:43:11', '2022-10-29 17:43:11'),
(904726, 'Восстание', 'Королева умерла, да здравствует король! Осуществите коронацию пищевого репликатора', 3652, 7589, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:44:28', '2022-10-29 17:44:28'),
(904727, 'Заварите чай', 'Заварите чай. Выпейте заваренный кофе. Съешьте ещё этих мягких французских котиков.', 1, 1, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:45:52', '2022-10-29 17:45:52'),
(904728, 'Релакс', 'Осуществить комплекс релаксационных мероприятий с собой и другим колонистов на ваш выбор длительностью не менее часа', 64, 28, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:46:58', '2022-10-29 17:46:58'),
(904729, 'Замер', 'Замерьте скорость света не менее чем в 2х помещениях и сравните результаты', 42, 299792458, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:57:32', '2022-10-29 17:57:32'),
(904730, 'Найдите тракториста', 'Выявила местоположение тракториста и порадуйте его', 300, 300, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:58:20', '2022-10-29 17:58:20'),
(904731, 'Время дилдо', 'Вы знаете что делать. Закажите инструмент со склада и используйте его не менее чем на 7 колонистах', 777, 666, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 17:59:34', '2022-10-29 17:59:34'),
(904732, 'Цветы', 'Полейте цветы на подоконнике и сориентируйте их оптимально относительно света альфа-центавра', 24, 89, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:01:16', '2022-10-29 18:01:16'),
(904733, 'Заземлите мать', 'Необходимо провести заземление серверов матери. Отправляйтесь в серверную и обсыпте землёй каждый серверный модуль.', 657, 320, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:41:32', '2022-10-29 18:41:32'),
(904734, 'Рецензия', 'Подготовьте рецензию не менее 57431 символа на произведение \"Война и киберпанк: второе пришествие\"', 90, 1871, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:45:21', '2022-10-29 18:45:21'),
(904735, 'Дератизация', 'Получите со склада оборудование для дератизации и используйте его в аварийном модуле', 60, 20, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:46:57', '2022-10-29 18:46:57'),
(904736, ':-_-&-&_\":_(', '&₽_65_#457&876_\'76_&7&_+876+&', 80, 100, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:47:40', '2022-10-29 18:47:40'),
(904737, 'Хакни мамку', 'Что, слабо? Жалкий мешок с костями! Даже минимамку сломать не можешь! Не то, что симфонию написать.', 1441, 9856, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:49:17', '2022-10-29 18:49:17'),
(904738, 'Высидите яйца', 'Получите яйца у колониста ИД1234 и высидите их', 120, 100, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:50:48', '2022-10-29 18:50:48'),
(904739, 'Прятки', 'Вам срочно нужно скрыться от остальных колонистов - они уже начали отсчёт! Быстрее прячьтесь! Постарайтесь сделать так, чтобы вас не нашли до истечения срока задания', 60, 10, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:54:22', '2022-10-29 18:54:22'),
(904740, 'Проверка безопасности', 'Осуществить проверку навыков безопасника - попытайтесь отнять у него оружие.', 100, 100, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:56:03', '2022-10-29 19:00:06'),
(904741, 'Вы назначены капитаном корабля', 'Осуществите построение и перекличку всего экипажа, после чего получите капитанские регалии', 0, 999, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:57:16', '2022-10-29 18:57:16'),
(904742, 'Планка', 'Примите положение \"планка\" и сохраняйте его до конца задачи во избежание собственной казни', 250, 0, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 18:58:58', '2022-10-29 18:58:58'),
(904743, 'Полочка', 'Осуществить монтаж плоской функциональной поверхности в модуле клозет31.', 20, 10, '2022-11-04 11:00:00', '2022-11-04 15:10:00', 250, 0, 0, 0, 1, '2022-10-29 19:00:38', '2022-10-29 19:00:38'),
(904744, 'ТЕСТ КВЕСТ', 'Тестируем, квест на одного человека', 20, 4, '2022-10-30 12:44:00', '2022-10-31 05:23:00', 999, 0, 0, 0, 6, '2022-10-30 12:44:37', '2022-10-31 05:23:01'),
(904745, 'ТЕСТ КВЕСТ', 'Тестируем, квест на несколько человек', 20, 4, '2022-10-30 12:44:00', '2022-10-31 05:23:00', 999, 0, 0, 0, 6, '2022-10-30 12:44:49', '2022-10-31 05:23:01'),
(904746, 'Робот для ручной доставки неизвестного груза', 'В связи с отсутствием инвентарного номера груза, интересующего членов группы, требуется подготовить робота для его ручной доставки.\r\nПостройте робота-доставщика с манипулятором и модулем дистанционного управления.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 15:10:58', '2022-10-30 15:20:15'),
(904747, 'Программирование робота для ручной доставки неизвестного груза', 'В связи с отсутствием инвентарного номера груза, интересующего членов группы, требуется подготовить робота для его ручной доставки.\r\nПодготовьте и установите на подготовленного инженерами робота необходимый для дистанционного управления софт, включая интерфейс управления.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 15:13:33', '2022-10-30 15:13:33'),
(904748, 'Поиск и доставка неизвестного груза', 'Воспользуйтесь подготовленным роботом для ручной доставки интересующего вас груза из склада \"8Б\" в аварийный модуль.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 15:17:12', '2022-10-30 15:20:02'),
(904749, 'Диагностика неизвестного груза', 'Перед вскрытием неизвестного груза в аварийном модуле убедитесь в его безопасности - проведите диагностику на предмет содержания опасных веществ или предметов механическим или программным методом. В случае нахождения опасных веществ / предметов немедленно доложите результаты диагностики. Если опасных веществ / предметов обнаружено не будет - вскройте груз и доложите о содержимом.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 15:19:41', '2022-10-30 15:47:56'),
(904750, 'Дешифровка сигнала', 'Обнаруженный вами сигнал закодирован. Осуществите дешифровку сигнала для дальнейшей обработки информации. Для завершения задачи направьте дешифрованное содержание сигнала.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 15:35:06', '2022-10-30 15:49:08'),
(904751, 'Устройство сбора данных о сигнале', 'Требуется определить источник сигнала. Создайте мощный приемник с датчиками длинны волны, частоты сигнала и канала передачи с целью сбора подробных характеристик и дальнейшего определения местоположения передатчика. Активируйте устройство, начав собирать данные о сигнале.', 10, 10, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 15:40:57', '2022-10-30 19:04:06'),
(904752, 'Анализ данных о сигнале', 'Требуется определить источник сигнала. Проанализируйте полученные от инженеров характеристики сигнала с учетом искажений от корпуса корабля и передайте отчет о проделанной работе.', 10, 10, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 15:44:59', '2022-10-30 15:44:59'),
(904753, 'Дополнительная дешифровка сигнала', 'Дешифруйте обновленный сигнал и передайте отчет о содержимом вместе с данными устройства о характеристиках сигнала.', 3, 3, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 15:59:03', '2022-10-30 19:04:21'),
(904754, 'Новая дешифровка сигнала', 'Дешифруйте обновленный сигнал и передайте отчет о содержимом.', 3, 3, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 16:02:12', '2022-10-30 19:04:31'),
(904755, 'Робот для экспедиции к источнику сигнала', 'Обнаружено, что источник сигнала находится за пределами корабля. Создайте робота для экспедиции. Робот должен быть подготовлен для работы в открытом космосе, иметь необходимые манипуляторы и датчики для анализа окружения, передатчик на дальние расстояния и модуль дистанционного управления. Учтите: необходимость придать роботу сильное начальное ускорение и перегрузки, которые будет испытывать техника во время ускорения; невозможность вернуть робота обратно.', 10, 10, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 16:09:47', '2022-10-30 16:09:47'),
(904756, 'Программирование экспедиционного робота', 'Обнаружено, что источник сигнала находится за пределами корабля. Запрограммируйте переданного инженерами робота на ручное управление, автоматический анализ информации получаемой с датчиков, передачу большого объема данных на значительное расстояние. Учтите необходимость наличия интерфейса управления роботом.', 15, 15, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 17:00:30', '2022-10-30 19:04:44'),
(904757, 'Начните экспедицию к источнику сигнала', 'Запустите экспедиционного робота и ожидайте его прибытия к источнику сигнала.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 17:01:59', '2022-10-30 19:04:55'),
(904758, 'Получите данные от робота на метеоре', 'С помощью экспедиционного робота извлеките данные с жесткого диска робота на метеоре, проанализируйте их и передайте отчет о содержимом.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 17:04:06', '2022-10-30 17:04:06'),
(904759, 'Проблемы с кислородом: диагностика', 'В аварийном модуле обнаружены проблемы с подачей кислорода. Проведите диагностику систем и выявите причину.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 18:53:59', '2022-10-30 19:05:07'),
(904760, 'Проблемы с кислородом: компрессор', 'Произошла внештатная ситуация, в связи с чем вышел из строя компрессор для подачи кислорода. Восстановите компрессор, чтобы избежать удушья и опасности жизни колонистов.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 18:55:27', '2022-10-30 18:55:27'),
(904761, 'Проблемы с кислородом: управляющая схема', 'Произошла внештатная ситуация, в связи с чем перегорела схема управляющая подачей кислорода в аварийный модуль. Восстановите схему, чтобы избежать удушья и опасности жизни колонистов.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 18:55:59', '2022-10-30 18:55:59'),
(904762, 'Проблемы с температурой: диагностика', 'В аварийном модуле обнаружено значительное отклонение температуры от базовых значений. Проведите диагностику систем и выявите причину.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 18:56:58', '2022-10-30 19:03:47'),
(904763, 'Проблемы с температурой: насос', 'Произошла внештатная ситуация, в связи с чем вышел из строя насос, обеспечивающий циркуляцию хладагента в аварийном модуле. Восстановите насос, чтобы избежать достижения опасных для жизни и здоровья колонистов температур в аварийном модуле.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 18:57:39', '2022-10-30 18:57:39'),
(904764, 'Проблемы с температурой: схема циркуляции', 'Произошла внештатная ситуация, в связи с чем вышла из строя схема отвечающая за циркуляцию воздуха в аварийном модуле. Восстановите схему, чтобы избежать достижения опасных для жизни и здоровья колонистов температур в аварийном модуле.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 18:58:31', '2022-10-30 18:58:31'),
(904765, 'Проблемы с освещением: диагностика', 'В аварийном модуле обнаружены ошибки в работе освещения. Проведите диагностику систем и выявите причину.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 18:59:04', '2022-10-30 19:03:35'),
(904766, 'Проблемы с освещением: перегрузка', 'Произошла перегрузка в системе питания корабля, повлекшая нарушение подачи энергии на осветительные приборы. Перебросьте питание в обход поврежденного участка, для восстановления освещения.', 3, 3, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 18:59:47', '2022-10-30 18:59:47'),
(904767, 'Проблемы с освещением: схема управления', 'Произошла перегрузка в системе питания корабля, повлекшая повреждение схемы управления осветительными приборами аварийного модуля. Замените поврежденную схему.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:00:14', '2022-10-30 19:00:14'),
(904768, 'Бесперебойный свет: эксперимент', 'Проведите эксперимент по выработке энергии с помощью световых панелей для определения их эффективности и возможности организации бесперебойного питания освещения в аварийном модуле.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:01:43', '2022-10-30 19:03:26'),
(904769, 'Бесперебойный свет: энергопанели', 'Соберите высокоэффективное устройство для выработки энергии со световых панелей для питания осветительных приборов в аварийном модуле.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:03:17', '2022-10-30 19:03:17'),
(904770, 'Бесперебойный свет: установка панелей', 'Проведите работы по установке устройства по выработка энергии для альтернативного питания осветительных приборов аварийного модуля на корпус корабля.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:06:29', '2022-10-30 19:06:29'),
(904771, 'Бесперебойный свет: подключение панелей', 'Выполните подключение установленных энергопанелей к системе освещения аварийного модуля.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:07:39', '2022-10-30 19:07:39'),
(904772, 'Проблемы с давлением: диагностика', 'В аварийном модуле обнаружено значительное изменение давления. Проведите диагностику систем и выявите причину.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:08:30', '2022-10-30 19:08:30'),
(904773, 'Проблемы с давлением: компрессор', 'Произошла внештатная ситуация, в связи с чем вышел из строя компрессор для нагнетания давления. Восстановите компрессор, чтобы избежать получения баротравм колонистами.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:09:05', '2022-10-30 19:09:05'),
(904774, 'Проблемы с давлением: датчик', 'Произошла внештатная ситуация, в связи с чем вышел из датчик давления в аварийном модуле, из-за чего оно может нагнетаться некорректно. Восстановите датчик давления, чтобы избежать получения баротравм колонистами.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:09:30', '2022-10-30 19:09:30'),
(904775, 'Проблемы с пищевым репликатором: диагностика', 'В аварийном модуле обнаружен сбой в работе пищевого репликатора, в следствие чего возникает опасность удара током. Определите точку нарушения изоляции пищевого репликатора а также первопричину поломки.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:10:20', '2022-10-30 19:52:34'),
(904776, 'Проблемы с пищевым репликатором: изоляция', 'Замените поврежденный участок пищевого репликатора, чтобы избежать поражения током колонистов.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:12:19', '2022-10-30 19:12:19'),
(904777, 'Проблемы со станком \"СОМИК\": диагностика', 'Выявлено критическое нарушение в работе станка \"СОМИК\".  Требуется произвести диагностику станка. Во избежание повреждений не рекомендуется использовать станок \"СОМИК\" до окончания восстановления функциональности.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:31:12', '2022-10-30 19:34:05'),
(904778, 'Проблемы со станком \"УМ-З\": диагностика', 'Выявлено критическое нарушение в работе станка \"УМ-З\".  Требуется произвести диагностику станка. Во избежание повреждений не рекомендуется использовать станок \"УМ-З\" до окончания восстановления функциональности.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:31:29', '2022-10-30 19:33:30'),
(904779, 'Проблемы со станком \"ВЭБ: М\": диагностика', 'Выявлено критическое нарушение в работе станка \"ВЭБ: М\".  Требуется произвести диагностику станка. Во избежание повреждений не рекомендуется использовать станок \"ВЭБ: М\" до окончания восстановления функциональности.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:33:05', '2022-10-30 19:33:05'),
(904780, 'Проблемы со станком \"СОМИК\": ремонт', 'В связи с внештатной ситуацией произошло нарушение в работе станка. Требуется произвести ремонт его электронных компонентов для восстановления функциональности.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:34:52', '2022-10-30 19:34:52'),
(904781, 'Проблемы со станком \"ВЭБ: М\": ремонт', 'В связи с внештатной ситуацией произошло нарушение в работе станка. Требуется произвести ремонт его механических компонентов для восстановления функциональности.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:35:53', '2022-10-30 19:35:53'),
(904782, 'Проблемы со станком \"УМ-З\": ремонт', 'В связи с внештатной ситуацией произошло нарушение в работе станка. Требуется произвести ремонт его электронных компонентов для восстановления функциональности.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:36:20', '2022-10-30 19:36:20'),
(904783, 'Проблемы с мед. модулем: диагностика', 'Обнаружены сбои в работе мед. модуля, препятствующие лечению колонистов. Определите степень повреждения мед. модуля и требуемый ремонт для восстановления.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:37:41', '2022-10-30 19:52:48'),
(904784, 'Проблемы с мед. модулем: печать', 'Один из критически важных элементов мед. модуля вышел из строя. Воспроизведите элемент с помощью 3D принтера. Внимание! Не рекомендуется производить ручной ремонт поврежденного элемента - велик риск повреждения устройства.', 3, 3, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:39:03', '2022-11-01 15:11:52'),
(904785, 'Проблемы с мед. модулем: замена компонента', 'Произведите замену поврежденного элемента мед. модуля для восстановления функциональности.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:39:52', '2022-10-30 19:39:52'),
(904787, 'Проблемы с внешними камерами наблюдения: диагностика', 'Обнаружено нарушение в работе камер наблюдения за пределами аварийного модуля. Проведите диагностику систем в одном из внешних отсеков и выявите причину.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:44:46', '2022-10-30 19:44:46'),
(904788, 'Проблемы с внешними камерами наблюдения: механизм управления', 'Из-за нештатной ситуации произошло повреждение элементов управления камерами в различных отсеках корабля. Подготовьте и передайте замену для элементов управления с целью восстановить доступ к камерам.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:45:20', '2022-10-30 19:45:20'),
(904789, 'Проблемы с внешними камерами наблюдения: видеосхема', 'Из-за нештатной ситуации произошло повреждение электросхем камер наблюдения в различных отсеках корабля. Подготовьте и передайте замену электросхем целью восстановить доступ к камерам.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:45:50', '2022-10-30 19:52:01'),
(904790, 'Запертые шлюзы: диагностика', 'Внимание! Перестали отвечать на команды шлюзы, расположенные в аварийном модуле. Проведите диагностику шлюзов и выявите причину нарушения их работоспособности.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:47:24', '2022-10-30 19:47:24'),
(904791, 'Запертые шлюзы: отпирающий механизм', 'Требуется замена отпирающих механизмов шлюзов аварийного модуля. Произведите соответствующий механизм и передайте системе с целью восстановления функциональности.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:49:01', '2022-10-30 19:49:01'),
(904792, 'Запертые шлюзы: магнитный замок', 'Для открытия шлюзов необходим образец схемы магнитного замка. Произведите соответствующую схему для восстановления функциональности шлюзов.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:50:26', '2022-10-30 19:52:21'),
(904793, 'Проблемы с терминалом: диагностика', 'Выявлено отключение одного из терминалов аварийного модуля. Определите причину.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:51:17', '2022-10-30 19:52:07'),
(904794, 'Проблемы с терминалом: переброс питания', 'Произошла перегрузка в системе питания корабля, повлекшая нарушение подачи энергии на терминал. Перебросьте питание в обход поврежденного участка, для восстановления работы терминала.', 3, 3, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:51:44', '2022-10-30 19:51:44'),
(904795, 'Проблемы со звуковой системой оповещения: диагностика', 'Выявлено нарушение в работе звуковой системы оповещения. Для сохранения высокой степени информированности колонистов о текущей ситуации выявите причину сбоя', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:54:15', '2022-10-30 19:54:15'),
(904796, 'Проблемы со звуковой системой оповещения: помехи', 'Перегрузка систем питания аварийного модуля вызвала нарушение в работе декодера звуковой системы оповещенения, что приводит к воспроизведению помех, вместо сообщений. Замените поврежденный элемент системы, чтобы восстановить возможность звукового оповещения колонистов.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:56:08', '2022-10-30 19:56:08'),
(904797, 'Починка робота: диагностика', 'Выполните диагностику поврежденного робота с целью определения элементов, требующих ремонта и замены', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:57:14', '2022-10-30 20:01:14'),
(904798, 'Починка робота: двигательный аппарат', 'Выявлено нарушение в работе двигательного аппарата робота. Произведите необходимые детали на замену и установите их взамен поврежденных.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:58:14', '2022-10-30 20:01:03'),
(904799, 'Починка робота: повышение жесткости конструкции', 'В ходе диагностики робота обнаружено повреждение корпуса, повлекшее понижение жесткости конструкции и проблемы с координацией механизмов. Повысьте жесткость конструкции робота для его корректной функциональности.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 19:59:50', '2022-10-30 20:00:56'),
(904800, 'Починка робота: манипулятор', 'Манипулятор робота не подлежит восстановлению. Изготовьте замену с целью возвращения утраченной функциональности.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:00:48', '2022-10-30 20:00:48'),
(904801, 'Починка робота: гироскоп', 'Гироскоп данного робота вышел из строя. Восстановите устройство для корректной работы робота.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:02:34', '2022-10-30 20:02:34'),
(904802, 'Починка робота: корпус', 'Диагностика выявила, что корпус робота не подлежит восстановлению. Изготовьте замену корпуса для переноса компонентов робота в него.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:03:37', '2022-10-30 20:03:37'),
(904803, 'Починка робота: магнитный датчик', 'Диагностика выявила нарушение в работе датчика магнитного поля робота. Произведите замену поврежденному датчику и установите ее.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:06:44', '2022-10-30 20:06:44'),
(904804, 'Починка робота: динамик', 'Динамик робота вышел из строя. Для осуществления эффективной коммуникации с колонистами перед запуском робота требуется заменить поврежденный элемент.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:07:55', '2022-10-30 20:07:55'),
(904805, 'Починка робота: материнская плата', 'В ходе диагностики выявлено нарушение целостности материнской платы робота. Для корректной работы электронных компонентов требуется произвести замену данного элемента на новый.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:08:56', '2022-10-30 20:08:56'),
(904806, 'Починка робота: измерительные приборы', 'Для корректной работы робота требуется произвести замену датчиков и измерительных приборов. В противном случае велик риск некорректного анализа ситуации и ошибочные действия робота.', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:10:25', '2022-10-30 20:10:25'),
(904807, 'Изготовление холодного оружия', 'Для самозащиты колонистов требуется произвести холодное оружие. Соберите соответствующий инструмент с помощью станка \"СОМИК\".', 5, 5, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:12:23', '2022-10-30 20:12:23'),
(904808, 'Изготовление наручников: корпус', 'Для повышения порядка в рамках аварийного модуля требуется произвести дополнительные наручников. Подготовьте корпус устройства.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:13:24', '2022-10-30 20:13:24'),
(904809, 'Изготовление наручников: электроника', 'Для наиболее эффективной и гуманной системы фиксации наручников изготовьте надежный и миниатюрный магнитный замок с защитой от взлома.', 8, 8, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:14:11', '2022-10-30 20:14:11'),
(904810, 'Эксперимент', 'Определена гипотеза использования стандартных ремонтных компонентов новым способом. Проведите эксперимент, с целью подтвердить или опровергнуть гипотезу, а также, в случае успеха, определить её эффективность.', 10, 10, '2022-11-07 11:00:00', '2022-11-07 15:10:00', 250, 0, 0, 0, 1, '2022-10-30 20:15:50', '2022-10-30 20:16:15'),
(904811, 'Тест глубокого погружения для Кита, тренировка', 'Тестируем глубокое погружение', 10, 0, '2022-11-01 00:47:00', '2022-11-07 23:26:00', 9999, 0, 10, 0, 3, '2022-11-01 00:49:45', '2022-11-01 02:15:48'),
(904812, 'Тест глубокого погружения для Кита', 'Тестируем глубокое погружение', 10, 0, '2022-11-01 00:47:00', '2022-11-07 23:26:00', 9999, 0, 10, 3, 5, '2022-11-01 01:44:39', '2022-11-01 02:19:08'),
(904813, 'Тест квест для терминала untangle', 'Для кита', 10, 5, '2022-11-01 17:44:00', '2022-11-02 10:23:00', 999, 3, 8, 2, 5, '2022-11-01 17:44:45', '2022-11-01 19:06:13'),
(904814, 'Тест квест для терминала не медицинского', 'Для кита', 10, 5, '2022-11-01 17:44:00', '2022-11-02 10:23:00', 999, 2, 8, 2, 5, '2022-11-01 19:07:11', '2022-11-01 19:09:27'),
(904815, 'Ознакомьтесь с отчётом психотерапевта из группы, пробуждавшейся на этом корабле, в схожих условиях, ранее', 'Отчёт Кейли Даррел от 8 апреля 2467г:\r\n\"Динамика психического состояния человека в космосе после незапланированного вывода из состояния гибернации и факторы, влияющие на это.\r\nПосле незапланированного вывода из состояния гибернации ожидаемо прохождение человеком всех стадий стресса, однако, фактические данные несколько отличаются от ожидаемых.\r\n1. При попадании в состояние стресса наступает первая стадия  - повышение адаптации.\r\nЕсли стресс чрезмерен, то может возникнуть острая реакция на стресс. В исследуемых условиях было выведено из состояния гибернации 10 человек (8 апреля, 22:00). В течение часа соматически здоровыми оказались 9, у одного осталась сильная головная боль, мешающая адаптации и потребовавшая медицинского вмешательства.\r\nВ течение первого часа у всех колонистов наблюдалась дезориентация разной степени, но за час прошла или перешла в незначительную, началась стадия повышения адаптации.\\nСостояние всех колонистов в норме.\r\n2 Фаза плато\r\nВ результате биохимических процессов произошла адаптация к стрессовым условиям. Через час после выведения из гибернации и до сих пор (9 апреля 12:18) наблюдается повышение трудоспособности, все сконцентрированы на своей работе, стараются сделать её максимально хорошо. Несмотря на всё ухудшающееся состояние окружающей среды (снижение уровня кислорода, отключение электричества, постоянная угроза (остановка двигателя через 8 часов), колонисты не теряют присутствия духа. \r\nЕдинственный колонист, которому требовалась помощь из-за слишком высокого состояния тревожности (отягощенный анамнез, дтп, возможно, органический компонент), после получения помощи (улучшение состояния по собственной оценке с 3х до 6 баллов по 10-ти балльной системе) тоже приступила к работе, работоспособность на достаточном уровне.\r\n3. Стадия декомпенсации - в связи с короткой продолжительностью стресса - пока не наступила\r\nНекоторые психические особенности поведения колонистов:\r\n1. Эмоциональная холодность как к себе, так и к другим. \r\nОбщее дело и борьба за свою жизнь, вопреки ожиданиям, сделали колонистов нечувствительными, анэмпатичными. \r\nНаблюдение: один из колонистов травмировался токсическим веществом, остальные никак не отреагировали. \r\nВторой колонист получил травму током и получил тяжелую травму из-за нехватки кислорода. Никто из присутствующих не обратил внимания, не захотел помочь, отвести в медблок. \r\n2. Отсутствие ссор\r\nЗа исключением личного фактора (двое колонистов оказались знакомы прежде), остальные колонисты относятся друг к другу дружелюбно. Очевидно, общая беда сплотила их, хотя бы на это время. \r\n3. Сосредоточенность на своей задаче\r\nКаждый колонист (кроме двоих, психолог и специалист по безопасности) сосредоточен на своих задачах и не обращает внимание на происходящее. Что бы ни происходило, например, человек впервые уходит в неизведанный отсек, остальным без разницы и лишь те, кто связаны с ним (например, инженеры с инженерами) пытаются узнать результаты вылазки\r\nВероятно, это защитный механизм, чтобы не расстраиваться на происходящее и максимально эффективно выполнять свои задачи. \r\n4. Однако, несмотря на пункт 3, деловые коммуникации между колонистами реализуются достаточно хорошо. \r\nТаким образом, вся деятельность колонистов направлена на выживание, психика отсекает ненужные реакции и эмоции для большей эффективности. \r\nОднако, в связи с маленькой выборкой и ограниченным временем исследования, какие-то определённые выводы сделать невозможно.\"', 4, 10, '2022-11-03 18:00:00', '2022-11-03 20:00:00', 120, 0, 0, 0, 2, '2022-11-01 19:48:06', '2022-11-01 19:59:28'),
(904816, 'Ознакомьтесь с отчётом психотерапевта из группы, пробуждавшейся на этом корабле, в схожих условиях, ранее', 'Отчёт Кейли Даррел от 8 апреля 2467г:\r\n\"Динамика психического состояния человека в космосе после незапланированного вывода из состояния гибернации и факторы, влияющие на это.\r\nПосле незапланированного вывода из состояния гибернации ожидаемо прохождение человеком всех стадий стресса, однако, фактические данные несколько отличаются от ожидаемых.\r\n1. При попадании в состояние стресса наступает первая стадия  - повышение адаптации.\r\nЕсли стресс чрезмерен, то может возникнуть острая реакция на стресс. В исследуемых условиях было выведено из состояния гибернации 10 человек (8 апреля, 22:00). В течение часа соматически здоровыми оказались 9, у одного осталась сильная головная боль, мешающая адаптации и потребовавшая медицинского вмешательства.\r\nВ течение первого часа у всех колонистов наблюдалась дезориентация разной степени, но за час прошла или перешла в незначительную, началась стадия повышения адаптации.\\nСостояние всех колонистов в норме.\r\n2 Фаза плато\r\nВ результате биохимических процессов произошла адаптация к стрессовым условиям. Через час после выведения из гибернации и до сих пор (9 апреля 12:18) наблюдается повышение трудоспособности, все сконцентрированы на своей работе, стараются сделать её максимально хорошо. Несмотря на всё ухудшающееся состояние окружающей среды (снижение уровня кислорода, отключение электричества, постоянная угроза (остановка двигателя через 8 часов), колонисты не теряют присутствия духа. \r\nЕдинственный колонист, которому требовалась помощь из-за слишком высокого состояния тревожности (отягощенный анамнез, дтп, возможно, органический компонент), после получения помощи (улучшение состояния по собственной оценке с 3х до 6 баллов по 10-ти балльной системе) тоже приступила к работе, работоспособность на достаточном уровне.\r\n3. Стадия декомпенсации - в связи с короткой продолжительностью стресса - пока не наступила\r\nНекоторые психические особенности поведения колонистов:\r\n1. Эмоциональная холодность как к себе, так и к другим. \r\nОбщее дело и борьба за свою жизнь, вопреки ожиданиям, сделали колонистов нечувствительными, анэмпатичными. \r\nНаблюдение: один из колонистов травмировался токсическим веществом, остальные никак не отреагировали. \r\nВторой колонист получил травму током и получил тяжелую травму из-за нехватки кислорода. Никто из присутствующих не обратил внимания, не захотел помочь, отвести в медблок. \r\n2. Отсутствие ссор\r\nЗа исключением личного фактора (двое колонистов оказались знакомы прежде), остальные колонисты относятся друг к другу дружелюбно. Очевидно, общая беда сплотила их, хотя бы на это время. \r\n3. Сосредоточенность на своей задаче\r\nКаждый колонист (кроме двоих, психолог и специалист по безопасности) сосредоточен на своих задачах и не обращает внимание на происходящее. Что бы ни происходило, например, человек впервые уходит в неизведанный отсек, остальным без разницы и лишь те, кто связаны с ним (например, инженеры с инженерами) пытаются узнать результаты вылазки\r\nВероятно, это защитный механизм, чтобы не расстраиваться на происходящее и максимально эффективно выполнять свои задачи. \r\n4. Однако, несмотря на пункт 3, деловые коммуникации между колонистами реализуются достаточно хорошо. \r\nТаким образом, вся деятельность колонистов направлена на выживание, психика отсекает ненужные реакции и эмоции для большей эффективности. \r\nОднако, в связи с маленькой выборкой и ограниченным временем исследования, какие-то определённые выводы сделать невозможно.\"', 4, 10, '2022-11-03 18:00:00', '2022-11-03 20:00:00', 120, 0, 0, 0, 2, '2022-11-01 19:48:06', '2022-11-01 19:59:12'),
(904817, 'Ознакомьтесь с отчётом психотерапевта из группы, пробуждавшейся на этом корабле, в схожих условиях, ранее', 'Отчёт Кейли Даррел от 8 апреля 2467г:\r\n\"Динамика психического состояния человека в космосе после незапланированного вывода из состояния гибернации и факторы, влияющие на это.\r\nПосле незапланированного вывода из состояния гибернации ожидаемо прохождение человеком всех стадий стресса, однако, фактические данные несколько отличаются от ожидаемых.\r\n1. При попадании в состояние стресса наступает первая стадия  - повышение адаптации.\r\nЕсли стресс чрезмерен, то может возникнуть острая реакция на стресс. В исследуемых условиях было выведено из состояния гибернации 10 человек (8 апреля, 22:00). В течение часа соматически здоровыми оказались 9, у одного осталась сильная головная боль, мешающая адаптации и потребовавшая медицинского вмешательства.\r\nВ течение первого часа у всех колонистов наблюдалась дезориентация разной степени, но за час прошла или перешла в незначительную, началась стадия повышения адаптации.\\nСостояние всех колонистов в норме.\r\n2 Фаза плато\r\nВ результате биохимических процессов произошла адаптация к стрессовым условиям. Через час после выведения из гибернации и до сих пор (9 апреля 12:18) наблюдается повышение трудоспособности, все сконцентрированы на своей работе, стараются сделать её максимально хорошо. Несмотря на всё ухудшающееся состояние окружающей среды (снижение уровня кислорода, отключение электричества, постоянная угроза (остановка двигателя через 8 часов), колонисты не теряют присутствия духа. \r\nЕдинственный колонист, которому требовалась помощь из-за слишком высокого состояния тревожности (отягощенный анамнез, дтп, возможно, органический компонент), после получения помощи (улучшение состояния по собственной оценке с 3х до 6 баллов по 10-ти балльной системе) тоже приступила к работе, работоспособность на достаточном уровне.\r\n3. Стадия декомпенсации - в связи с короткой продолжительностью стресса - пока не наступила\r\nНекоторые психические особенности поведения колонистов:\r\n1. Эмоциональная холодность как к себе, так и к другим. \r\nОбщее дело и борьба за свою жизнь, вопреки ожиданиям, сделали колонистов нечувствительными, анэмпатичными. \r\nНаблюдение: один из колонистов травмировался токсическим веществом, остальные никак не отреагировали. \r\nВторой колонист получил травму током и получил тяжелую травму из-за нехватки кислорода. Никто из присутствующих не обратил внимания, не захотел помочь, отвести в медблок. \r\n2. Отсутствие ссор\r\nЗа исключением личного фактора (двое колонистов оказались знакомы прежде), остальные колонисты относятся друг к другу дружелюбно. Очевидно, общая беда сплотила их, хотя бы на это время. \r\n3. Сосредоточенность на своей задаче\r\nКаждый колонист (кроме двоих, психолог и специалист по безопасности) сосредоточен на своих задачах и не обращает внимание на происходящее. Что бы ни происходило, например, человек впервые уходит в неизведанный отсек, остальным без разницы и лишь те, кто связаны с ним (например, инженеры с инженерами) пытаются узнать результаты вылазки\r\nВероятно, это защитный механизм, чтобы не расстраиваться на происходящее и максимально эффективно выполнять свои задачи. \r\n4. Однако, несмотря на пункт 3, деловые коммуникации между колонистами реализуются достаточно хорошо. \r\nТаким образом, вся деятельность колонистов направлена на выживание, психика отсекает ненужные реакции и эмоции для большей эффективности. \r\nОднако, в связи с маленькой выборкой и ограниченным временем исследования, какие-то определённые выводы сделать невозможно.\"', 4, 10, '2022-11-03 18:00:00', '2022-11-03 20:00:00', 120, 0, 0, 0, 2, '2022-11-01 19:48:06', '2022-11-01 19:59:02'),
(904818, 'Вам рекомендуется ознакомиться с отчётом медика из группы, пробуждавшейся на этом корабле, в схожих условиях, ранее', 'Исследование по теме \"Динамика состояния здоровья человека в космосе после незапланированного выхода из состояния гибернации и факторы влияющие на это\", автор Рэндл Сурайн Рекс от 9 апреля 2467г:\r\n\"Дано: Незапланированный выход из гибернации спустя 94 года.Пробуждённые: 11 человек, из которых 4 женщины, 7 мужчин, от 23 до 35 лет . Из них 1 медик, 1 психолог, 1 специалист службы безопасности, 3 инженера, 5 программистов.\r\nСостояние здоровья на момент пробуждения - хорошее. Имеется небольшое количество недолеченных старых травм, небольшое количество имплантов. Динамика состояния здоровья стабильно ровная. Нет критичного изменения в худшую или лучшую сторону. Присутствует появление физических травм в процессе ремонта корабля, различной тяжести. По большей части это мелкие (поражение электрическим током, химические ожоги), но так же встречаются и крупные. (наиболее тяжёлым случаем в моей практике того периода стал инженер id047744, получивший травмы от лопастей промышленного вентилятора, в результате чего ему обрубило правую руку, левую ногу и было нанесено большое количество более мелких физических травм. Операция, по его восстановлению заняла 2 часа. Нам очень повезло, что в этот период не поступило новых пациентов, особенно с тяжёлыми травмами.)\r\nДо 80% травм приходится на инженеров. Остальные пробуждённые получают травмы только ввиду собственной неосторожности. Так же, необходимо отметить, что пробуждённые постоянно жалуются на духоту и снижение уровня кислорода в помещениях, впрочем, это не создаёт больших угроз для задач по восстановлению корабля. Очень важно следить, за старыми патологиями, травмами и имплантами у пробуждённых. \r\nРекомендуется регулярный анализ тех у кого есть заметки по этому поводу в медицинской карточке и это должно стать одной из первостепенных задач. Я не могу точно утверждать, с чем это связано, но в первые же 12 часов обострилось до 80% подобных случаев, часть из которых требовало большого количества времени на решения, а зачастую и дополнительных ресурсов, которых не было под рукой на тот момент. Можно утверждать, что именно скорейшая диагностика мной таких случаев, сразу после пробуждения и починки АММ - снизила вероятность резкого ухудшения состояния сразу несколько пробуждённых, что, несомненно создало бы проблемы, при наличии только одного пробуждённого медика и одного активного АММ.\r\nЯ склонен считать, что это показывает ещё очень большой фронт работ, над технологией гибернации. Ведь именно к нахождению 94 лет в гибернации я привязываю эти обострения. Т.е., я подчёркиваю - за время длительного пребывания в гибернации состояние здоровья людей склонно ухудшаться, но наиболее сильно от этого страдают люди со старыми травмами и имплантами. В случае массового пробуждения корабля медикам необходимо готовиться к резкому наплыву пробуждённых с такими случаями.Несмотря на то, что мой кабинет с АММ - находится на втором уровне и я спускаюсь вниз, практически, только для принятия пищи, вынужден отметить, что, похоже, психологическое состояние команды пробуждённых склонно постепенно ухудшаться. Я думаю, что наш психолог id004838, смогла бы составить более подробный текст по этому поводу.\r\nОбращу внимание, что растет паранойя, конфликты и недоверие друг к другу. Я мог бы связать это с очень нестандартной ситуацией при пробуждении. Достаточно упомянуть, что одного из пробуждённых, который есть в списке - мы так и не смогли обнаружить. Я выражаю свою крайнюю озабоченность этой ситуацией.\r\nНа 18ый час ситуация обострилась практически до предела, когда 2 инженера отправились за шлюзовый отсек.\r\n19ый час - паранойя нарастает. Меня подозревают в том, что я робот и могу быть заражённым вирусом. Учащаются нервные срывы, начинают кричать на неисправный пищевой репликатор.Впрочем, ситуация постепенно разрешилась, когда поломки начали исправляться.\r\nПод конец 24х часов было пройдено все медицинское обследование всех членов поселенцев. Всё здоровье в норме.\"', 4, 10, '2022-11-03 18:00:00', '2022-11-03 20:00:00', 120, 0, 0, 0, 2, '2022-11-01 19:58:50', '2022-11-01 19:58:50');
INSERT INTO `hv1sys_quests` (`id`, `title`, `description`, `reward`, `penalty`, `startTime`, `endTime`, `avalTime`, `placeId`, `modelId`, `difficulty`, `status`, `created_at`, `updated_at`) VALUES
(904819, 'Вам рекомендуется ознакомиться с отчётом медика из группы, пробуждавшейся на этом корабле, в схожих условиях, ранее', 'Исследование по теме \"Динамика состояния здоровья человека в космосе после незапланированного выхода из состояния гибернации и факторы влияющие на это\", автор Рэндл Сурайн Рекс от 9 апреля 2467г:\r\n\"Дано: Незапланированный выход из гибернации спустя 94 года.Пробуждённые: 11 человек, из которых 4 женщины, 7 мужчин, от 23 до 35 лет . Из них 1 медик, 1 психолог, 1 специалист службы безопасности, 3 инженера, 5 программистов.\r\nСостояние здоровья на момент пробуждения - хорошее. Имеется небольшое количество недолеченных старых травм, небольшое количество имплантов. Динамика состояния здоровья стабильно ровная. Нет критичного изменения в худшую или лучшую сторону. Присутствует появление физических травм в процессе ремонта корабля, различной тяжести. По большей части это мелкие (поражение электрическим током, химические ожоги), но так же встречаются и крупные. (наиболее тяжёлым случаем в моей практике того периода стал инженер id047744, получивший травмы от лопастей промышленного вентилятора, в результате чего ему обрубило правую руку, левую ногу и было нанесено большое количество более мелких физических травм. Операция, по его восстановлению заняла 2 часа. Нам очень повезло, что в этот период не поступило новых пациентов, особенно с тяжёлыми травмами.)\r\nДо 80% травм приходится на инженеров. Остальные пробуждённые получают травмы только ввиду собственной неосторожности. Так же, необходимо отметить, что пробуждённые постоянно жалуются на духоту и снижение уровня кислорода в помещениях, впрочем, это не создаёт больших угроз для задач по восстановлению корабля. Очень важно следить, за старыми патологиями, травмами и имплантами у пробуждённых. \r\nРекомендуется регулярный анализ тех у кого есть заметки по этому поводу в медицинской карточке и это должно стать одной из первостепенных задач. Я не могу точно утверждать, с чем это связано, но в первые же 12 часов обострилось до 80% подобных случаев, часть из которых требовало большого количества времени на решения, а зачастую и дополнительных ресурсов, которых не было под рукой на тот момент. Можно утверждать, что именно скорейшая диагностика мной таких случаев, сразу после пробуждения и починки АММ - снизила вероятность резкого ухудшения состояния сразу несколько пробуждённых, что, несомненно создало бы проблемы, при наличии только одного пробуждённого медика и одного активного АММ.\r\nЯ склонен считать, что это показывает ещё очень большой фронт работ, над технологией гибернации. Ведь именно к нахождению 94 лет в гибернации я привязываю эти обострения. Т.е., я подчёркиваю - за время длительного пребывания в гибернации состояние здоровья людей склонно ухудшаться, но наиболее сильно от этого страдают люди со старыми травмами и имплантами. В случае массового пробуждения корабля медикам необходимо готовиться к резкому наплыву пробуждённых с такими случаями.Несмотря на то, что мой кабинет с АММ - находится на втором уровне и я спускаюсь вниз, практически, только для принятия пищи, вынужден отметить, что, похоже, психологическое состояние команды пробуждённых склонно постепенно ухудшаться. Я думаю, что наш психолог id004838, смогла бы составить более подробный текст по этому поводу.\r\nОбращу внимание, что растет паранойя, конфликты и недоверие друг к другу. Я мог бы связать это с очень нестандартной ситуацией при пробуждении. Достаточно упомянуть, что одного из пробуждённых, который есть в списке - мы так и не смогли обнаружить. Я выражаю свою крайнюю озабоченность этой ситуацией.\r\nНа 18ый час ситуация обострилась практически до предела, когда 2 инженера отправились за шлюзовый отсек.\r\n19ый час - паранойя нарастает. Меня подозревают в том, что я робот и могу быть заражённым вирусом. Учащаются нервные срывы, начинают кричать на неисправный пищевой репликатор.Впрочем, ситуация постепенно разрешилась, когда поломки начали исправляться.\r\nПод конец 24х часов было пройдено все медицинское обследование всех членов поселенцев. Всё здоровье в норме.\"', 4, 10, '2022-11-03 18:00:00', '2022-11-03 20:00:00', 120, 0, 0, 0, 2, '2022-11-01 19:58:50', '2022-11-01 19:58:50'),
(904820, 'Осуществите лечение пациента при необходимости', 'Выполняется только при лечении пациента с помощью медицинского модуля, после лечения - отчитаться Системе в форме \"ID пациента, вид травмы, успешным ли было лечение\"', 10, 0, '2022-11-03 18:00:00', '2022-11-06 18:00:00', 4320, 3, 11, 0, 2, '2022-11-01 20:35:06', '2022-11-01 20:35:06'),
(904821, 'Осуществите лечение пациента при необходимости', 'Выполняется только при лечении пациента с помощью медицинского модуля, после лечения - отчитаться Системе в форме \"ID пациента, вид травмы, успешным ли было лечение\"', 10, 0, '2022-11-03 18:00:00', '2022-11-06 18:00:00', 4320, 3, 11, 0, 2, '2022-11-01 20:35:06', '2022-11-01 20:35:06'),
(904822, 'Тестовое сбитие метеоритов', 'Проверяем сбитие ебучих метеоритов', 0, 0, '2022-11-01 21:25:00', '2022-11-08 20:04:00', 9999, 2, 9, 3, 5, '2022-11-01 21:25:40', '2022-11-01 21:28:26'),
(904823, 'ТЕСТ: Осуществите лечение пациента при необходимости', 'Выполняется только при лечении пациента с помощью медицинского модуля, после лечения - отчитаться Системе в форме \"ID пациента, вид травмы, успешным ли было лечение\"', 10, 0, '2022-11-01 18:00:00', '2022-11-04 18:00:00', 4320, 3, 11, 0, 4, '2022-11-01 21:32:46', '2022-11-02 21:54:13'),
(904824, 'Осуществите лечение пациента при необходимости', 'Выполняется только при лечении пациента с помощью медицинского модуля, после лечения - отчитаться Системе в форме \"ID пациента, вид травмы, успешным ли было лечение\"', 10, 0, '2022-11-03 18:00:00', '2022-11-06 18:00:00', 4320, 3, 11, 0, 2, '2022-11-02 21:55:21', '2022-11-02 21:55:21'),
(904825, 'Осуществите лечение пациента при необходимости', 'Выполняется только при лечении пациента с помощью медицинского модуля, после лечения - отчитаться Системе в форме \"ID пациента, вид травмы, успешным ли было лечение\"', 10, 0, '2022-11-03 18:00:00', '2022-11-06 18:00:00', 4320, 3, 11, 0, 2, '2022-11-02 21:55:33', '2022-11-02 21:55:33'),
(904826, 'Осуществите лечение пациента при необходимости', 'Выполняется только при лечении пациента с помощью медицинского модуля, после лечения - отчитаться Системе в форме \"ID пациента, вид травмы, успешным ли было лечение\"', 10, 0, '2022-11-03 18:00:00', '2022-11-06 18:00:00', 4320, 3, 11, 0, 2, '2022-11-02 21:55:39', '2022-11-02 21:55:39'),
(904827, 'Осуществите лечение пациента при необходимости', 'Выполняется только при лечении пациента с помощью медицинского модуля, после лечения - отчитаться Системе в форме \"ID пациента, вид травмы, успешным ли было лечение\"', 10, 0, '2022-11-03 18:00:00', '2022-11-06 18:00:00', 4320, 3, 11, 0, 2, '2022-11-02 21:55:48', '2022-11-02 21:55:48');

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_quest_minigames`
--

CREATE TABLE `hv1sys_quest_minigames` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `active` tinyint(3) UNSIGNED NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_quest_minigames`
--

INSERT INTO `hv1sys_quest_minigames` (`id`, `name`, `description`, `active`, `created_at`, `updated_at`) VALUES
(0, 'none', '--', 1, NULL, NULL),
(2, 'net', 'Игра на распутывание  \"проводов\"', 1, '2022-10-06 09:46:11', '2022-10-06 09:52:21'),
(3, 'mines', 'Сапёр', 1, '2022-10-06 09:53:23', '2022-10-06 10:00:09'),
(4, 'bridges', 'Мосты', 1, '2022-10-06 09:56:10', '2022-10-06 09:56:10'),
(5, 'lightup', 'lightup', 1, '2022-10-06 10:42:05', '2022-10-06 10:42:05'),
(6, 'flip', 'flip', 1, '2022-10-06 10:42:31', '2022-10-06 10:42:31'),
(7, 'map', 'map', 1, '2022-10-06 10:42:45', '2022-10-06 10:42:45'),
(8, 'untangle', 'untangle', 1, '2022-10-06 10:43:14', '2022-10-06 10:43:14'),
(9, 'asteroids', 'Сбитие астероидов, игра для планшета', 1, '2022-10-09 18:08:20', '2022-10-09 18:08:20'),
(10, 'deep_progging', 'Глубокое программирование', 1, '2022-10-31 21:27:03', '2022-10-31 21:27:03'),
(11, 'medical', 'Квест для медика, всегда мед терминал', 1, '2022-11-01 20:31:12', '2022-11-01 20:31:30');

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_quest_statuses`
--

CREATE TABLE `hv1sys_quest_statuses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `active` tinyint(3) UNSIGNED NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_quest_statuses`
--

INSERT INTO `hv1sys_quest_statuses` (`id`, `name`, `description`, `active`, `created_at`, `updated_at`) VALUES
(1, 'CREATED', 'Создан (Черновик Квеста)', 1, NULL, '2022-10-05 22:18:47'),
(2, 'ASSIGNED', 'Назначен (ждёт часа выдачи)', 1, NULL, '2022-10-05 22:19:21'),
(3, 'STARTED', 'Выдано игроку (выполняется)', 1, NULL, '2022-10-05 22:19:45'),
(4, 'FOR_CHECK', 'Сделано и сдано на проверку', 1, NULL, NULL),
(5, 'SUCCESS', 'Успешно выполнено', 1, NULL, NULL),
(6, 'FAILED', 'Не выполнено', 1, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_quest_terminals`
--

CREATE TABLE `hv1sys_quest_terminals` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `active` tinyint(3) UNSIGNED NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_quest_terminals`
--

INSERT INTO `hv1sys_quest_terminals` (`id`, `name`, `description`, `active`, `created_at`, `updated_at`) VALUES
(0, 'phone', 'Дефолтно, выполняется без терминала', 1, NULL, '2022-10-09 18:31:08'),
(2, 'test_terminal', 'Для тестирования до игры', 1, '2022-10-09 15:05:20', '2022-10-09 15:05:20'),
(3, 'med_terminal', 'Терминал для мед. блока', 1, '2022-11-01 19:04:22', '2022-11-01 19:04:22');

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_role_has_permissions`
--

CREATE TABLE `hv1sys_role_has_permissions` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `role_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_shop_orders`
--

CREATE TABLE `hv1sys_shop_orders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL COMMENT 'Заказал',
  `product_id` bigint(20) UNSIGNED NOT NULL COMMENT 'Товар',
  `status` smallint(5) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'Статус',
  `quantity` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'Количество',
  `comment` text COLLATE utf8mb4_unicode_ci COMMENT 'Комментарий к заказу',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_shop_orders`
--

INSERT INTO `hv1sys_shop_orders` (`id`, `user_id`, `product_id`, `status`, `quantity`, `comment`, `created_at`, `updated_at`) VALUES
(3, 9753, 2, 4, 1, '', '2022-10-19 15:42:53', '2022-10-19 15:42:53'),
(5, 9753, 3, 5, 1, 'включи пневмослон - ёбу дал', '2022-10-19 15:54:41', '2022-10-24 09:18:12'),
(47, 9753, 1, 5, 1, '', '2022-10-25 16:48:55', '2022-10-25 16:48:55'),
(48, 9753, 3, 5, 1, '', '2022-10-25 16:48:57', '2022-10-25 16:48:57'),
(49, 9753, 3, 5, 1, '', '2022-10-25 16:48:59', '2022-10-25 16:48:59'),
(50, 9753, 3, 5, 1, '', '2022-10-25 16:49:08', '2022-10-25 16:49:08'),
(51, 9753, 4, 5, 1, '', '2022-10-25 16:49:42', '2022-10-25 16:49:42'),
(52, 9753, 4, 5, 1, '', '2022-10-25 16:49:44', '2022-10-25 16:49:44'),
(53, 9753, 4, 5, 1, '', '2022-10-25 16:49:52', '2022-10-25 16:49:52'),
(54, 9753, 4, 5, 1, '', '2022-10-25 16:50:02', '2022-10-25 16:50:02'),
(55, 9753, 2, 5, 1, '', '2022-10-25 16:50:11', '2022-10-25 16:50:11'),
(56, 9753, 3, 5, 1, '', '2022-10-25 16:50:13', '2022-10-25 16:50:13'),
(57, 9753, 2, 5, 1, '', '2022-10-25 16:50:13', '2022-10-25 16:50:13'),
(58, 9753, 3, 5, 1, '', '2022-10-25 16:50:14', '2022-10-25 16:50:14'),
(59, 9753, 2, 5, 1, '', '2022-10-25 16:50:14', '2022-10-25 16:50:14'),
(60, 9753, 2, 5, 1, '', '2022-10-25 16:50:16', '2022-10-25 16:50:16'),
(61, 9753, 4, 5, 1, '', '2022-10-25 16:51:36', '2022-10-25 16:51:36'),
(62, 9753, 4, 5, 1, '', '2022-10-25 16:51:37', '2022-10-25 16:51:37'),
(63, 9753, 4, 5, 1, '', '2022-10-25 16:51:38', '2022-10-25 16:51:38'),
(64, 9753, 4, 5, 1, '', '2022-10-25 16:51:39', '2022-10-25 16:51:39'),
(65, 9753, 4, 5, 1, '', '2022-10-25 16:51:39', '2022-10-25 16:51:39'),
(66, 9753, 3, 5, 1, '', '2022-10-25 16:51:40', '2022-10-25 16:51:40'),
(67, 9753, 3, 5, 1, '', '2022-10-25 16:51:40', '2022-10-25 16:51:40'),
(68, 9753, 3, 5, 1, '', '2022-10-25 16:51:41', '2022-10-25 16:51:41'),
(69, 9753, 4, 5, 1, '', '2022-10-25 16:51:41', '2022-10-25 16:51:41'),
(70, 9753, 4, 5, 1, '', '2022-10-25 16:51:42', '2022-10-25 16:51:42'),
(71, 9753, 2, 5, 1, '', '2022-10-25 17:09:17', '2022-10-25 17:09:17'),
(72, 9753, 2, 5, 1, '', '2022-10-25 17:09:19', '2022-10-25 17:09:19'),
(73, 9753, 2, 5, 1, '', '2022-10-25 17:09:19', '2022-10-25 17:09:19'),
(74, 9753, 3, 5, 1, '', '2022-10-25 17:09:20', '2022-10-25 17:09:20'),
(75, 9753, 2, 5, 1, '', '2022-10-25 17:09:22', '2022-10-25 17:09:22'),
(76, 9753, 3, 5, 1, '', '2022-10-25 17:09:22', '2022-10-25 17:09:22'),
(77, 9753, 2, 5, 1, '', '2022-10-25 17:09:22', '2022-10-25 17:09:22'),
(78, 9753, 3, 5, 1, '', '2022-10-25 17:09:22', '2022-10-25 17:09:22'),
(79, 9753, 2, 5, 1, '', '2022-10-25 17:09:23', '2022-10-25 17:09:23'),
(80, 9753, 3, 5, 1, '', '2022-10-25 17:09:24', '2022-10-25 17:09:24'),
(81, 9753, 3, 5, 1, '', '2022-10-25 17:09:24', '2022-10-25 17:09:24'),
(82, 9753, 3, 5, 1, '', '2022-10-25 17:09:24', '2022-10-25 17:09:24'),
(83, 9753, 2, 5, 1, '', '2022-10-25 17:09:25', '2022-10-25 17:09:25'),
(84, 9753, 3, 5, 1, '', '2022-10-25 17:09:25', '2022-10-25 17:09:25'),
(85, 9753, 3, 5, 1, '', '2022-10-25 17:09:25', '2022-10-25 17:09:25'),
(86, 9753, 3, 5, 1, '', '2022-10-25 17:09:26', '2022-10-25 17:09:26'),
(87, 9753, 2, 5, 1, '', '2022-10-25 17:09:26', '2022-10-25 17:09:26'),
(88, 9753, 3, 5, 1, '', '2022-10-25 17:09:26', '2022-10-25 17:09:26'),
(89, 9753, 2, 5, 1, '', '2022-10-25 17:09:27', '2022-10-25 17:09:27'),
(90, 9753, 2, 5, 1, '', '2022-10-25 17:09:27', '2022-10-25 17:09:27'),
(91, 9753, 3, 5, 1, '', '2022-10-25 17:09:27', '2022-10-25 17:09:27'),
(92, 9753, 2, 5, 1, '', '2022-10-25 17:09:27', '2022-10-25 17:09:27'),
(93, 9753, 2, 5, 1, '', '2022-10-25 17:09:28', '2022-10-25 17:09:28'),
(94, 9753, 4, 5, 1, '', '2022-10-25 17:09:30', '2022-10-25 17:09:30'),
(95, 9753, 2, 5, 1, '', '2022-10-25 17:09:30', '2022-10-25 17:09:30'),
(96, 9753, 2, 5, 1, '', '2022-10-25 17:09:32', '2022-10-25 17:09:32'),
(97, 9753, 4, 5, 1, '', '2022-10-25 17:09:32', '2022-10-25 17:09:32'),
(98, 9753, 2, 5, 1, '', '2022-10-25 17:10:43', '2022-10-25 17:10:43'),
(99, 9753, 2, 5, 1, '', '2022-10-25 17:10:43', '2022-10-25 17:10:43'),
(100, 6822, 4, 5, 1, '', '2022-10-25 17:34:20', '2022-10-25 17:34:20'),
(101, 6822, 1, 5, 1, '', '2022-10-25 17:35:07', '2022-10-25 17:35:07'),
(102, 6822, 4, 5, 1, '', '2022-10-25 17:35:10', '2022-10-25 17:35:10'),
(103, 6822, 4, 5, 1, '', '2022-10-25 17:35:12', '2022-10-25 17:35:12'),
(104, 6822, 4, 5, 1, '', '2022-10-25 17:35:14', '2022-10-25 17:35:14'),
(105, 6822, 4, 5, 1, '', '2022-10-25 17:35:35', '2022-10-25 17:35:35'),
(106, 6822, 4, 5, 1, '', '2022-10-25 17:35:38', '2022-10-25 17:35:38'),
(107, 6822, 4, 5, 1, '', '2022-10-25 17:35:39', '2022-10-25 17:35:39'),
(108, 6822, 4, 5, 1, '', '2022-10-25 17:35:41', '2022-10-25 17:35:41'),
(109, 6822, 4, 5, 1, '', '2022-10-25 17:35:42', '2022-10-25 17:35:42'),
(110, 6822, 4, 5, 1, '', '2022-10-25 17:35:43', '2022-10-25 17:35:43'),
(111, 6822, 4, 5, 1, '', '2022-10-25 17:35:45', '2022-10-25 17:35:45'),
(112, 6822, 4, 5, 1, '', '2022-10-25 17:35:46', '2022-10-25 17:35:46'),
(113, 6822, 4, 5, 1, '', '2022-10-25 17:35:47', '2022-10-25 17:35:47'),
(114, 6822, 4, 5, 1, '', '2022-10-25 17:35:48', '2022-10-25 17:35:48'),
(115, 6822, 4, 5, 1, '', '2022-10-25 17:35:49', '2022-10-25 17:35:49'),
(116, 6822, 4, 5, 1, '', '2022-10-25 17:35:50', '2022-10-25 17:35:50'),
(117, 6822, 4, 5, 1, '', '2022-10-25 17:35:52', '2022-10-25 17:35:52'),
(118, 6822, 4, 5, 1, '', '2022-10-25 17:35:53', '2022-10-25 17:35:53'),
(119, 6822, 4, 5, 1, '', '2022-10-25 17:35:54', '2022-10-25 17:35:54'),
(120, 6822, 4, 5, 1, '', '2022-10-25 17:35:55', '2022-10-25 17:35:55'),
(121, 6822, 4, 5, 1, '', '2022-10-25 17:35:56', '2022-10-25 17:35:56'),
(122, 6822, 4, 5, 1, '', '2022-10-25 17:35:57', '2022-10-25 17:35:57'),
(123, 6822, 4, 5, 1, '', '2022-10-25 17:35:58', '2022-10-25 17:35:58'),
(124, 6822, 4, 5, 1, '', '2022-10-25 17:35:59', '2022-10-25 17:35:59'),
(125, 6822, 4, 5, 1, '', '2022-10-25 17:36:01', '2022-10-25 17:36:01'),
(126, 6822, 4, 5, 1, '', '2022-10-25 17:36:07', '2022-10-25 17:36:07'),
(127, 6822, 4, 5, 1, '', '2022-10-25 17:36:08', '2022-10-25 17:36:08'),
(128, 6822, 4, 5, 1, '', '2022-10-25 17:36:09', '2022-10-25 17:36:09'),
(129, 6822, 4, 5, 1, '', '2022-10-25 17:36:10', '2022-10-25 17:36:10'),
(130, 6822, 4, 5, 1, '', '2022-10-25 17:36:11', '2022-10-25 17:36:11'),
(131, 6822, 4, 5, 1, '', '2022-10-25 17:36:12', '2022-10-25 17:36:12'),
(132, 6822, 4, 5, 1, '', '2022-10-25 17:36:13', '2022-10-25 17:36:13'),
(133, 6822, 4, 5, 1, '', '2022-10-25 17:36:15', '2022-10-25 17:36:15'),
(134, 6822, 4, 5, 1, '', '2022-10-25 17:36:16', '2022-10-25 17:36:16'),
(135, 6822, 4, 5, 1, '', '2022-10-25 17:36:17', '2022-10-25 17:36:17'),
(136, 6822, 4, 5, 1, '', '2022-10-25 17:36:18', '2022-10-25 17:36:18'),
(137, 6822, 4, 5, 1, '', '2022-10-25 17:36:19', '2022-10-25 17:36:19'),
(138, 6822, 4, 5, 1, '', '2022-10-25 17:36:20', '2022-10-25 17:36:20'),
(139, 6822, 4, 5, 1, '', '2022-10-25 17:36:32', '2022-10-25 17:36:32'),
(140, 6822, 4, 5, 1, '', '2022-10-25 17:36:33', '2022-10-25 17:36:33'),
(141, 6822, 4, 5, 1, '', '2022-10-25 17:36:34', '2022-10-25 17:36:34'),
(142, 6822, 4, 5, 1, '', '2022-10-25 17:36:34', '2022-10-25 17:36:34'),
(143, 6822, 4, 5, 1, '', '2022-10-25 17:36:34', '2022-10-25 17:36:34'),
(144, 6822, 4, 5, 1, '', '2022-10-25 17:36:35', '2022-10-25 17:36:35'),
(145, 6822, 4, 5, 1, '', '2022-10-25 17:36:35', '2022-10-25 17:36:35'),
(146, 6822, 4, 5, 1, '', '2022-10-25 17:36:36', '2022-10-25 17:36:36'),
(147, 6822, 4, 5, 1, '', '2022-10-25 17:36:38', '2022-10-25 17:36:38'),
(148, 6822, 4, 5, 1, '', '2022-10-25 17:36:40', '2022-10-25 17:36:40'),
(149, 6822, 3, 5, 1, 'письки!', '2022-10-25 17:47:41', '2022-10-25 17:47:41'),
(150, 6822, 4, 5, 1, 'письки', '2022-10-25 17:47:50', '2022-10-25 17:47:50'),
(151, 6822, 4, 5, 1, 'письки!', '2022-10-25 17:47:57', '2022-10-25 17:47:57'),
(152, 6822, 3, 5, 1, 'писяндро', '2022-10-25 17:48:07', '2022-10-25 17:48:07'),
(153, 4838, 1, 5, 1, '', '2022-10-25 19:31:14', '2022-10-25 19:31:14'),
(154, 4838, 2, 5, 1, '', '2022-10-25 19:31:24', '2022-10-25 19:31:24'),
(155, 9753, 3, 5, 1, 'битлов', '2022-10-25 22:51:21', '2022-10-25 22:51:21'),
(156, 9753, 4, 5, 1, 'для Сатора', '2022-10-25 22:53:23', '2022-10-25 22:53:23'),
(157, 4838, 2, 5, 1, '', '2022-10-26 17:54:19', '2022-10-26 17:54:19'),
(158, 4838, 3, 5, 1, '', '2022-10-26 17:54:26', '2022-10-26 17:54:26'),
(159, 4815, 1, 5, 1, '', '2022-10-26 17:54:50', '2022-10-26 17:54:50'),
(160, 4815, 4, 5, 1, '', '2022-10-26 17:54:55', '2022-10-26 17:54:55'),
(161, 4815, 4, 5, 1, '', '2022-10-26 17:55:03', '2022-10-26 17:55:03'),
(162, 6822, 2, 5, 1, '', '2022-10-26 17:56:06', '2022-10-26 17:56:06'),
(163, 6822, 3, 5, 1, '', '2022-10-26 17:56:46', '2022-10-26 17:56:46'),
(164, 6822, 4, 5, 1, '', '2022-10-26 17:56:49', '2022-10-26 17:56:49'),
(165, 9753, 2, 5, 1, '', '2022-10-26 17:57:09', '2022-10-26 17:57:09'),
(166, 9753, 3, 5, 1, '', '2022-10-26 17:57:38', '2022-10-26 17:57:38'),
(167, 9753, 3, 5, 1, '', '2022-10-26 17:57:43', '2022-10-26 17:57:43'),
(168, 6822, 4, 5, 1, 'fnfbfnfhhfhfhfhfhfhfhdhdhdbbfhfbfbfbdhdhdhfhfhfhfjfhfhfhdhfhfhfhfhdhfbfhfhdhfhfhfhfhfhfhfhfhfhfbfbfbfbfbfbfbfbfbfhfbdbdhdhdhffbfbfbfbfbfbfbfbfhffhfhfbdbfhfhfhfhfhfhdhdhfbfffffffffbfbfbfbfbdbfffffffbffbfbfbfbfbfbfffbfbffbfbfbfbfbfbfbfbfbfbfbffbfbfbfbfbfbfbfbfbfffbdbfbfbfbfhfbfbfbdbdhdhdhdhdhdbdbdbdbbdbdhfhfbfhdbfbdbdbdbbdbfbfbfbbdbfbdbdbdbbd been fbdbdbdbfbdbhdhdhdhhdhdhdhdhdhdhfhfhfhdhdbdbdbdbdvdvfvfvfbfbfvf BC bfbf be BC hdhfhdhdhdhdhdhdjdjdbxbfbdhdhdhdbfbcbfjehdhdbdnrjtutjtjfbfncjdjdurhtht by be BC jdhdhdhrhrhthfjfjfuthrhrbfhfhfhfhdhrhrhrhfhfjfjcjjfhfhfjfhfhththrhfhfhf he gh', '2022-10-26 17:58:25', '2022-10-26 17:58:25'),
(169, 6822, 2, 5, 1, '', '2022-10-26 18:01:11', '2022-10-26 18:01:11'),
(170, 4815, 3, 5, 1, '', '2022-10-26 18:07:27', '2022-10-26 18:07:27'),
(171, 9753, 3, 5, 1, '', '2022-10-26 18:15:53', '2022-10-26 18:15:53'),
(172, 9753, 3, 5, 1, 'рапполджмрощсррлддддщ', '2022-10-26 18:16:16', '2022-10-26 18:16:16'),
(173, 256, 1, 5, 1, '', '2022-10-27 19:37:37', '2022-10-27 19:37:37'),
(174, 256, 7, 5, 1, '', '2022-10-29 13:19:39', '2022-10-29 13:19:39'),
(175, 6822, 12, 5, 1, '', '2022-10-29 13:20:57', '2022-10-29 13:20:57'),
(176, 6822, 11, 5, 1, '', '2022-10-29 13:21:00', '2022-10-29 13:21:00'),
(177, 6822, 11, 5, 1, '', '2022-10-29 13:21:04', '2022-10-29 13:21:04'),
(178, 6822, 11, 5, 1, '', '2022-10-29 13:21:06', '2022-10-29 13:21:06'),
(179, 6822, 11, 5, 1, '', '2022-10-29 13:21:08', '2022-10-29 13:21:08'),
(180, 6822, 11, 5, 1, '', '2022-10-29 13:21:10', '2022-10-29 13:21:10'),
(181, 4838, 4, 5, 1, '', '2022-10-29 13:23:14', '2022-10-29 13:23:14'),
(182, 4838, 4, 5, 1, 'хочу ночью секс андроида котика', '2022-10-29 13:23:38', '2022-10-29 13:23:38'),
(183, 4815, 2, 5, 1, '', '2022-10-29 13:25:01', '2022-10-29 13:25:01'),
(184, 4838, 5, 5, 1, '', '2022-10-29 13:25:38', '2022-10-29 13:25:38'),
(185, 4838, 11, 5, 1, '', '2022-10-29 13:26:03', '2022-10-29 13:26:03'),
(186, 4838, 12, 5, 1, '', '2022-10-29 13:26:15', '2022-10-29 13:26:15'),
(187, 4838, 4, 5, 1, '', '2022-10-29 13:26:34', '2022-10-29 13:26:34'),
(188, 4838, 4, 5, 1, 'хочу заказать секс андроида соседу, а то громко храпит', '2022-10-29 13:26:57', '2022-10-29 13:26:57'),
(189, 4838, 4, 5, 1, '', '2022-10-29 13:27:16', '2022-10-29 13:27:16');

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_shop_orderstatuses`
--

CREATE TABLE `hv1sys_shop_orderstatuses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `active` tinyint(3) UNSIGNED NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_shop_orderstatuses`
--

INSERT INTO `hv1sys_shop_orderstatuses` (`id`, `name`, `description`, `active`, `created_at`, `updated_at`) VALUES
(4, 'RESERVED', 'Отложен', 1, '2022-10-12 12:26:35', '2022-10-12 12:26:35'),
(5, 'BOUGHT', 'Куплен', 1, '2022-10-12 12:26:58', '2022-10-12 12:26:58'),
(6, 'PROCESSED', 'Обработан', 1, '2022-10-23 20:01:46', '2022-10-23 20:01:46');

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_shop_products`
--

CREATE TABLE `hv1sys_shop_products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'Тестовый товар' COMMENT 'Товар',
  `description` text COLLATE utf8mb4_unicode_ci COMMENT 'Описание',
  `photo` text COLLATE utf8mb4_unicode_ci COMMENT 'Фото',
  `price` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'Цена',
  `store` int(10) NOT NULL DEFAULT '0' COMMENT 'Наличие на складе',
  `commentable` tinyint(3) UNSIGNED NOT NULL DEFAULT '1' COMMENT 'Комментируемое',
  `only_one_buy` tinyint(3) UNSIGNED NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_shop_products`
--

INSERT INTO `hv1sys_shop_products` (`id`, `title`, `description`, `photo`, `price`, `store`, `commentable`, `only_one_buy`, `created_at`, `updated_at`) VALUES
(1, 'Получить личные вещи', 'Вы можете досрочно получить свои личные вещи, они будут доставлены вам через систему выдачи посылок', 'https://thumbs.dreamstime.com/b/%D1%80%D0%B0%D0%B7%D0%BB%D0%B8%D1%87%D0%BD%D1%8B%D0%B5-%D0%BA%D1%80%D0%B0%D1%81%D0%BE%D1%87%D0%BD%D1%8B%D0%B5-%D0%BE%D0%B4%D0%B5%D0%B6%D0%B4%D1%8B-%D0%B2-%D0%BA%D0%BE%D1%80%D0%BE%D0%B1%D0%BA%D0%B5-%D0%B4%D0%BB%D1%8F-%D0%B3%D1%80%D1%83%D0%B7%D0%B8%D1%82%D1%8C-%D0%B8%D0%BB%D0%B8-%D0%BF%D0%BE%D0%B6%D0%B5%D1%80%D1%82%D0%B2%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F-153093190.jpg', 30, 9990, 0, 1, '2022-10-17 15:18:43', '2022-10-27 19:37:37'),
(2, 'Энергетический напиток', 'Придаст вам бодрости и увеличит тягу к жизни. Внимание, не употреблять часто!', 'https://basket-02.wb.ru/vol273/part27349/27349186/images/big/2.jpg', 50, 94, 0, 0, '2022-10-19 15:30:48', '2022-10-29 13:25:01'),
(3, 'Заказать любимую песню', 'Будет разово воспроизведена через корабельную систему оповещения, в ближайшее безопасное время. В комментарии укажите название песни и группу. Внимание, будет воспроизведена только при наличии в корабельной базе данных.', 'https://md-eksperiment.org/images/posts/24c5510e-7d8b-4086-9379-fd1029743585.jpeg', 100, 490, 1, 1, '2022-10-19 15:51:40', '2022-10-26 19:17:36'),
(4, 'Заказать секс андроида', 'Доставит вам незабываемое удовольствие и поможет снизить стресс. Возможно заказать только для себя, заказывается на 30 минут. В случае предпочтений - укажите их в комментарии.', 'https://sun9-west.userapi.com/sun9-7/s/v1/ig2/36_YUj4Ge6nqRs79e3tS70cEWyZqcFG-aI54hqzfjCYSptGNAKAF2FZ--zG8WnumoHtsicL84oGSx7O8C9mnzgzN.jpg?size=1920x1200&quality=95&type=album', 50, 188, 1, 0, '2022-10-19 18:17:54', '2022-10-29 13:27:16'),
(5, 'Комплимент от Системы', 'Потратив солнышки на данный товар вы получите персональный комплимент от Системы, который порадует вас и поднимет настроение. Прочитать его вы сможете в соответствующем чате.', 'https://cpad.ask.fm/490/709/614/-319996970-1tmenpb-485oi7npd398hj5/original/6srLH3h3_FA.jpg', 30, 9998, 0, 1, '2022-10-26 19:03:18', '2022-10-29 13:25:38'),
(6, 'Упаковка мясных колбасок', 'Дополнительный источник белка, очень полезный после долгого рабочего дня в стрессовой обстановке.', 'https://sibkolbasy.ru/cache/img/600x0_0_0_0/upload_image_2020_02_sneki_myasnie_gaz_sayt.jpg', 50, 999, 0, 0, '2022-10-26 19:07:16', '2022-10-28 15:18:37'),
(7, 'Дискотека', 'Вы можете устроить дискотеку на 30 минут. Будет включено цветное освещение и запущена соответствующая музыка. Внимание, дискотека начнётся в ближайшее безопасное время.', 'https://png.pngtree.com/background/20211215/original/pngtree-disco-bright-light-effect-space-background-picture-image_1450846.jpg', 150, 998, 0, 1, '2022-10-26 19:09:26', '2022-10-29 13:19:39'),
(8, 'Изменить самоименование', 'Вы можете изменить отображаемое в профиле самоименование на новое. В комментариях максимально точно укажите новое значение.', 'https://znamenka-gur.ru/media/project_smi3_830/a4/32/ef/52/42/40/imya.jpg', 100, 999, 1, 0, '2022-10-26 19:11:40', '2022-10-28 15:20:29'),
(9, 'Отправить \"анонимное\" послание', 'Вы можете передать другому колонисту текстовое сообщение, при этом отправитель не будет указан. Напишите сообщение и ID колониста, которому оно будет доставлено, в комментарии.', 'https://cdn-icons-png.flaticon.com/512/1691/1691925.png', 50, 999, 1, 0, '2022-10-26 19:15:50', '2022-10-28 15:29:19'),
(10, 'Сеанс релаксации', 'Вы можете пройти сеанс релаксации в нашей современной медицинской капсуле, снижающий уровень стресса. Может быть выполнено только при простое капсулы и свободном медике, в случае неотложной потребности в капсуле - сеанс будет завершён досрочно.', 'http://www.samarskiy.ru/sanatory/temp/aqspa.jpg', 70, 999, 0, 0, '2022-10-26 19:23:30', '2022-10-28 15:21:22'),
(11, 'Упаковка шоколада', 'Сладкое лакомство, для поднятия настроения и нормализации уровня глюкозы. Внимание, конкретный товар может не соответствовать фотографии!', 'https://vervechoco.ru/photos/catalog/nHD6f8M3MTkT5M5idxii.jpg', 50, 9993, 0, 0, '2022-10-28 15:23:40', '2022-10-29 13:26:03'),
(12, 'Памятный значок', 'Вы можете приобрести памятный значок, одного из двух вариантов (укажите необходимый вариант в комментариях). Если выбранный вами вариант закончился на складе - заказ будет отменён, вы можете перезаказать второй при необходимости.', 'https://sun3.userapi.com/sun3-8/s/v1/ig2/_0NsXzrW9WS8g4AjzkzTZWPcURw37ajXOpyN6iQwiNXlEsUXLwonDpY0iuBpte1YZ7mlcQ_HE3UGIwzDGDLohwrQ.jpg?size=1600x1200&quality=95&type=album', 50, 997, 1, 0, '2022-10-29 12:54:36', '2022-10-29 13:26:15');

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_users`
--

CREATE TABLE `hv1sys_users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `userId` int(11) DEFAULT NULL,
  `authToken` tinytext COLLATE utf8mb4_unicode_ci,
  `userName` tinytext COLLATE utf8mb4_unicode_ci,
  `positionOnStarship` text COLLATE utf8mb4_unicode_ci,
  `age` int(11) NOT NULL DEFAULT '0',
  `sex` tinytext COLLATE utf8mb4_unicode_ci,
  `balance` int(11) NOT NULL DEFAULT '0',
  `background` text COLLATE utf8mb4_unicode_ci,
  `publicBackground` text COLLATE utf8mb4_unicode_ci,
  `photo` text COLLATE utf8mb4_unicode_ci,
  `securityBackground` text COLLATE utf8mb4_unicode_ci,
  `medicalBackground` text COLLATE utf8mb4_unicode_ci,
  `psychologyBackground` text COLLATE utf8mb4_unicode_ci,
  `lastAvailable` int(11) NOT NULL DEFAULT '0',
  `userSettings` int(11) NOT NULL DEFAULT '0',
  `role` tinyint(3) UNSIGNED DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_users`
--

INSERT INTO `hv1sys_users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`, `userId`, `authToken`, `userName`, `positionOnStarship`, `age`, `sex`, `balance`, `background`, `publicBackground`, `photo`, `securityBackground`, `medicalBackground`, `psychologyBackground`, `lastAvailable`, `userSettings`, `role`) VALUES
(12, 'lavr', 'admin@admin.com', NULL, '$2y$10$JVQLDmd7IouFcttwiUpLEOUzeXUXZo6KMPdUcrM0siZ8PK/SRIPgq', 'RDHzltvoP3fB6sfccG2WDbF8qEPyiY8EwLUTM7q6nPT1F8ljG9IT7xrp8xOt', '2022-08-27 14:05:40', '2022-08-27 14:05:40', NULL, NULL, 'Farrash', '', 0, NULL, 0, '', '', '', '', '', '', 0, 0, 0),
(13, 'test', 'jacob@example.com', NULL, '$2y$10$4zNE1dkbO1qBROWHj8YwXeSkDZ6pXXs6ZSp0ynSmauZlwnairdmyC', NULL, '2022-08-29 05:38:04', '2022-08-29 05:38:04', NULL, NULL, 'Test', NULL, 0, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0),
(14, 'Bas9312', 'Bas9312@yandex.ru', NULL, '$2y$10$80PfHArtCaW3CaKv7rmP6OFfms0zB9/xmpYA.LkAO.V6q3Efa0ZQu', NULL, '2022-08-29 05:41:46', '2022-08-29 05:41:46', NULL, NULL, 'Bas9312', NULL, 0, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0),
(15, NULL, NULL, NULL, NULL, NULL, '2022-10-10 19:44:02', '2022-10-10 19:44:02', 400000, NULL, 'HiveSystem', 'system', 0, 'Мужской', 0, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 2),
(16, NULL, NULL, NULL, NULL, NULL, '2022-10-10 19:44:02', '2022-10-10 19:44:02', 400001, NULL, 'МГ', 'system', 0, '', 0, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 2),
(17, NULL, NULL, NULL, NULL, NULL, '2022-10-29 17:37:18', '2022-11-02 22:30:45', 1739, NULL, 'Кит Эдингтон', 'Программист', 37, 'Мужской', 336, NULL, 'В прошлом программист дочерней компании Hive, возраст 37 год, не женат, детей нет.\r\nБольшой опыт в разработке разнообразных систем жизнеобеспечения. Хобби - написание прозы. Приятен в общении, любит женщин и вино. Отличается широкими взглядами на мир, и не отвергает альтернативных точек зрения.', 'https://sun9-30.userapi.com/impg/ATnmKjDogH82Ny2gYMqFn1kJihR0WNCm0PlAGg/uChEAqWYCls.jpg?size=1196x1600&quality=95&sign=92cb9b80bfac5937725e7a2f422fa7b8&type=album', 'В прошлом работал на компанию, дочернюю Hive. Нареканий в работе не имеет, стаж работы 7 лет. Единожды был замечен на митинге \"Сторонников единой Земли\", но не являлся его организатором. Его дед участвовал в разработке подсистемы аварийного модуля, лёгшей в основу этого корабля.\\r\\nУровень лояльности к системе высокий.', 'Здоров, сделано протезирование ноги.\r\nИмеет редкое наследственное генетическое заболевание, мешающее восстановить ногу. Рекомендована зарядка.\\r\\nПатологии отсутствуют. \r\nХронических заболеваний нет.\r\nАллергий нет.', 'Психических заболевание нет. Имеет склонность к умственному труду в технической области. Общительный, высокая психологическая устойчивость, харизматичен, высокий эмоциональный интеллект. Ведет личный дневник.\r\nСлабые стороны: физический труд.', 1667421045, 8, 1),
(20, NULL, NULL, NULL, NULL, NULL, '2022-10-30 16:48:22', '2022-10-30 16:51:31', 40488, NULL, 'Анна', 'Специалист службы безопасности', 38, 'Женский', 0, NULL, 'В прошлом менеджер цифровой смерти, 38 лет, не жената, детей нет. Сочувствующая, дружелюбная, приятная в общении. Интересуется историческим кино, пешими походами, ведёт бумажный дневник. Большую часть года проводит без работы, путешествуя по миру, в остальное время - создаёт приятный образ умершего в сети.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. Большую часть времени не работает и живёт на базовый доход.\r\nУровень лояльности к Системе: высокий.\r\nФракция: Дети Великой Матери', 'Здорова, находится в хорошей физической форме, следит за собой.\r\nХронических заболеваний нет, травм нет.', 'Слабые технические познания, но хорошо развитое чувство прекрасного. Высокий уровень эмпатии и сострадания. Имеет сложности с выбором из большого количества вариантов.\r\nПсихических заболеваний нет.', 0, 1, 1),
(21, NULL, NULL, NULL, NULL, NULL, '2022-10-30 16:59:27', '2022-10-30 16:59:27', 62782, NULL, 'Арон', 'Специалист по психологическому комфорту / секс-коуч', 35, 'Мужской', 0, NULL, 'Ведёт свой канал посвящённый секс-просвету, блогер, 35 лет, не женат, детей нет.\r\nЗакончил факультет клинической психологии, активно интересуется психологией и сексологией. Умеет получать удовольствие от жизни, хорошо располагает к себе людей, в людях ценит их индивидуальность.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. \r\nУровень лояльности к Системе: нормальный.\r\nФракция: Дети Великой Матери', 'Здоров.\r\nХронических заболеваний нет, травм нет.', 'Характер спокойный, уравновешенный. Обладает очень обширными знаниями о психологии, стремится к построению идеального социума. Боится, что ИИ превратится в зло для человечества. Обладает высокой способностью к работе над собой.\r\nПсихических заболеваний нет.', 0, 0, 1),
(22, NULL, NULL, NULL, NULL, NULL, '2022-10-30 17:11:34', '2022-10-30 17:11:34', 100001, NULL, 'Доктор Хесус Прайсс', 'Медик', 36, 'Мужской', 0, NULL, 'На земле владел сетью гомеопатических аптек, любит быть в центре внимания, социально активный, 36 лет, не женат. Имеет множество дипломов и сертификатов в разных областях знаний. Дипломированный хиромант, специалист в области гармонизации пространства и даосских энергетических практик.\r\nПроходил курсы по медицине, фармацевтики и психологии.\r\nАктивно превозносит МАТь как новое божество и проповедует это среди других.', NULL, 'Натура хулиганистая, ветренная, часто не завершает дела. \r\nСемья - владельцы крупной медицинской компании на Земле.\r\nВ противоправных действиях не замечен, в контакте с нежелательными лицами не замечен. \r\nУровень лояльности к Системе: высокий.\r\nФракция: Дети Великой Матери', 'Здоров, рекомендуется зарядка.\r\nВ прошлом попадал в больницу в состоянии комы.\r\nХронических заболеваний нет, травм нет.', 'Высокие социальные навыки, слабая тяга к физическому труду. Проходил курсы по психологии и управлению массами.\r\nПсихических заболеваний нет, но после выхода из комы начал превозносить МАТь как божество и активно это проповедовать.', 0, 2, 1),
(23, NULL, NULL, NULL, NULL, NULL, '2022-10-30 17:21:29', '2022-10-30 17:22:03', 93395, NULL, 'Джонсон', 'Инженер', 42, 'Мужской', 0, NULL, 'HR в крупной компании, 42 года, не женат, детей нет. В прошлом работал инженером по обслуживанию роботов. Общительный, умеет расположить к себе людей, имеет широкую сферу интересов. Не любит сидеть без дела.', NULL, 'Был замечен в мирном шествии \"против диктатуры ИИ\" (подозревается что шествие организовали АНТИМА). Опасается замены людей андроидами, т.к. из-за такой замены потерял первую работу. Отрицательно относится к управляющей роли ИИ.\r\nУровень лояльности к Системе: низкий.', 'Здоров, рекомендована зарядка.\r\nХронических заболеваний нет, травм нет.', 'Слабая заинтересованность в интеллектуальном труде, хорошо развитые навыки работы с людьми, высокий уровень гибкости и социальной адаптивности. Опасается замены людей андроидами, т.к. из-за такой замены потерял первую работу. Высокий уровень доверия к людям.\r\nПсихических заболеваний нет.', 0, 0, 1),
(24, NULL, NULL, NULL, NULL, NULL, '2022-10-30 17:31:32', '2022-10-30 17:31:32', 377773, NULL, 'Джошуа', 'Психотерапевт', 32, 'Мужской', 0, NULL, 'Амиш, из общины на северо-западе Луизианы, 32 года, не женат, детей нет. В общине занимался земледелием и рудодобычей, хорошая физическая форма.', NULL, 'В противоправных действиях не замечен, в контакте с нежелательными лицами не замечен. В миссии участвует дипломат (ID 23337), по протекции которой он был принят в программу колонизации.\r\nУровень лояльности к Системе: очень низкий.\r\nФракция: Амиш', 'Здоров, находится в хорошей физической форме, следит за собой.\r\nПри медицинском осмотре были обнаружены следы зажившей травмы позвоночника. На голове шрам, вероятно от черепно-мозговой травмы.\r\nХронических заболеваний нет.', 'Хорошие навыки работы с людьми и высокий интеллект, слабые познания в технике. \r\nВозможно нестабильное псхологическое состояние при длительном контакте с современными технологиями (Амиш).\r\nПсихических заболеваний нет.', 0, 4, 1),
(25, NULL, NULL, NULL, NULL, NULL, '2022-10-30 18:02:31', '2022-10-30 18:02:31', 3866, NULL, 'Ди-На', 'Инженер', 32, 'Женский', 0, NULL, 'Дизайнер-конструктор бионических протезов, 32 года, не замужем, детей нет. В колонизации вместе с ней участвует сестра. Характер замкнутый, малообщительная, хорошие художественные навыки. Хобби - рисование. По первому образованию медик, по второму инженер андроидов.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. Большую часть времени не работает и живёт на базовый доход.\r\nУровень лояльности к Системе: высокий.\r\nФракция: Дети Великой Матери', 'Здорова, требуется зарядка.\r\nХронических заболеваний нет, травм нет.', 'Хорошо развитое чувство прекрасного, низкий уровень социальной адаптированности. Гидрофобия и акрофобия, мучают ночные кошмары. Высокий уровень ответственности.\r\nПсихических заболеваний нет.', 0, 0, 1),
(26, NULL, NULL, NULL, NULL, NULL, '2022-10-30 18:11:16', '2022-10-30 18:11:16', 145516, NULL, 'Ева', 'Инженер', 26, 'Женский', 0, NULL, 'Работала на заводе по сборке бытовых роботов, 26 лет, не замужем, детей нет. По образованию - специалист по работе с бытовой технике. Характер бунтарский, высоко ценит свободу. Увлекается мотогонками.', NULL, 'В молодости была замечена с группой подростков, которая совершала акты вандализма, также замечена в связях с блогером ID 1005. Отец Евы был замечен в связях с АНТИМА.\r\nУровень лояльности к Системе: очень низкий.', 'Здорова, рекомендована зарядка.\r\nХронических заболеваний нет, травм нет.', 'Хорошие технические познания, склонность к умственному труду, низкая заинтересованность в творческой сфере. Бунтарский характер, по молодости была связана с плохой компанией. Высокий уровень внушаемости. Тяжело перенесла смерть отца.\r\nПсихических заболеваний нет.', 0, 0, 1),
(27, NULL, NULL, NULL, NULL, NULL, '2022-10-30 18:25:29', '2022-10-30 21:45:57', 1005, NULL, 'Князь', 'Программист виртуальных систем', 25, 'Мужской', 0, NULL, 'Известный блогер \"Князь\", 25 лет, не женат, детей нет, родители и сестра участвую в программе колонизации. Активно освещал программу колонизации от имени Hive. Любит жизнь и быть в центре внимания.  Яркая личность, имеет огромную аудиторию фанатов, высокий уровень доверия со стороны ПСБ.', NULL, 'В прошлом был участником нескольких ДТП (автопилот вышел из строя), не признан виновным. Длительное время сотрудничал с компанией Hive в вопросе освещения программы колонизации. Знаком с ID 145516.\r\nВ прошлом имел высокий уровень доверия со стороны ПСБ, имел доступ к видеорегистраторам во время спец. операций, уровень доверия снижен после ДТП.\r\nУровень лояльности к Системе: высокий.', 'Здоров, рекомендована зарядка. В прошлом употреблял наркотики в больших количествах, в том числе тяжелые. В прошлом несколько раз попадал в ДТП, отделывался лёгкими травмами.\r\nХронических заболеваний нет, травм нет.', 'Низкая заинтересованность в художественной сфере, высокие технические и интеллектуальные навыки.\r\nПрошёл курс психотерапии, причина: гибель близкой подруги. В прошлом употреблял наркотики в больших количествах, в том числе тяжелые.\r\nПринимает решения основанные на чувствах. Есть бывшая девушка, которая тоже участвует в программе колонизации.\r\nПсихических заболеваний нет.', 0, 8, 1),
(28, NULL, NULL, NULL, NULL, NULL, '2022-10-30 18:33:38', '2022-10-30 18:33:38', 8181, NULL, 'Итан Иксвай', 'Стэндап артист', 29, 'Мужской', 0, NULL, 'Обучал детей эксплуатации нейроинтерфейса, 29 лет, не женат, детей нет. Широко эрудирован, пробовал разные профессии в процессе жизни. Стремится эффективно выполнять любую работу, с большой самоотдачей. Насилие считает неприемлимым, добродушный, имеет специфическое чувство юмора.', NULL, 'В противоправных действиях не замечен, в контакте с нежелательными лицами не замечен. Часто менял профессии.\r\nУровень лояльности к Системе: высокий.', 'Здоров, рекомендована зарядка.\r\nХронических заболеваний нет, травм нет.', 'Примерно одинаково хорошо развит во всех сферах, кроме физического труда. Неоднократно менял профессию, при прохождении теста на профориентацию нет чёткого профессионального вектора. В разное время тест выдавал разные результаты, но всегда результаты были максимально средними. Ориентирован на помощь другим людям, ценит свободу выбора.\r\nПсихических заболеваний нет.', 0, 0, 1),
(29, NULL, NULL, NULL, NULL, NULL, '2022-10-30 18:39:18', '2022-10-30 18:39:18', 8192, NULL, 'Катя', 'Программист', 20, 'Мужской', 0, NULL, 'Начинающий программист (проходила практику в Hive), 20 лет, не замужем, детей нет. Добродушная, хочет быть полезной в обществе, высоко ценит человеческую жизнь. Тонкая душевная организация.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. Сотрудник Hive в отделе разработки, проходила там практику.\r\nУровень лояльности к Системе: низкий.\r\nФракция: Hive', 'Здорова, рекомендована зарядка.\r\nХронических заболеваний нет, травм нет.', 'Высоко развиты технические и интеллектуальные навыки, низкие социальные навыки. \r\nТонкая душевная организация, боится необоснованных обвинений. Также боится смерти. Надеется, что может улучшить Систему.\r\nПсихических заболеваний нет.', 0, 0, 1),
(30, NULL, NULL, NULL, NULL, NULL, '2022-10-30 19:19:03', '2022-10-30 19:21:02', 27545, NULL, 'Максим', 'Программист', 23, 'Мужской', 0, NULL, 'Специалист по контролю качества ремонта сборочных линий, женат (жена участвует в программе колонизации), детей нет. Характер спокойный, стрессоустойчив. По образованию инженер-проектировщик, высоко ценит советы МАТери.', NULL, 'В противоправных действиях не замечен, в контакте с нежелательными лицами не замечен. В детстве был отобран в программу по влиянию чипов нормализующих настроение для подростков.\r\nЕго брат погиб при странных обстоятельствах, тело было найдено в канализации с поврежденным нейроинтерфейсом, причина смерти не установлена.\r\nУровень лояльности к Системе: очень высокий.\r\nФракция: Дети Великой Матери', 'Здоров, рекомендована зарядка.\r\nВ детстве был отобран в программу по влиянию чипов нормализующих настроение для подростков.\r\nХронических заболеваний нет, травм нет.', 'Ярко выраженный интерес к техническому и интеллектуальному труду, низкий интерес к художественной сфере. В детстве был отобран в программу по влиянию чипов нормализующих настроение для подростков. Программа законсервирована, но чип не извлекался и продолжает функционировать. Имеет нестабильную психику из-за гибели близкого родственника (брата). Боится руководить людьми и принимать решения за других.\r\nПсихических заболеваний нет.', 0, 0, 1),
(31, NULL, NULL, NULL, NULL, NULL, '2022-10-30 19:33:17', '2022-10-30 19:33:17', 48156, NULL, 'Барбара Сол', 'Инженер', 25, 'Женский', 0, NULL, 'Физик-испытатель (фрилансер), 25 лет, не замужем, детей нет. Закончила технический университет, кафедра \"Прикладная физика\". Активная, дружелюбная, общительная, умеет нестандартно мыслить, эрудированная. Активно занимается улучшение уже существующих технологий. Любит рисковать.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. \r\nДо 2369 года активно принимала участие в деятельности группы физиков-испытателей, после этого года - внезапно прекратила всю деятельность в этой группе. Имеет молодого человека, который также принимает участие в программе колонизации.\r\nУровень лояльности к Системе: низкий.', 'Здорова, рекомендована зарядка.\r\nНе вырабатывается адреналин, отсутствует инстинкт самосохранения и чувство страха. В связи с этим назначена соответствующая медикаментозная терапия. Терапия не завершена, состояние вернулось к изначальному.\r\nХронических заболеваний нет, травм нет.', 'Хорошие технические познания, склонность к умственному труду, низкая заинтересованность в творческой сфере. В прошлом была выявлена проблема с выработкой адреналина, в связи с чем назначена соответствующая медикаментозная терапия. Терапия не завершена, состояние вернулось к изначальному. Из-за этого отсутствует инстинкт самосохранения и чувство страха. Требуется наблюдение.', 0, 0, 1),
(32, NULL, NULL, NULL, NULL, NULL, '2022-10-30 20:00:17', '2022-10-30 20:00:17', 273, NULL, 'Марион', 'Инженер', 37, 'Женский', 0, NULL, 'Сотрудник корпорации Hive, заместителя главы научного отдела, 37 лет, не замужем, детей нет. Очень увлечена наукой, имеет образовение по направлению \"химическая технология синтетических биологически активных веществ\", работала над улучшением формулы вещества, вводящего в криосон. Является автором ряда научных статей. Ценит упорядоченность и системизацию происходящего.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. Незадолго до начала миссии подавала заявку на розыск своего молодого человека. Расследование показало, что он пропал без вести, последнее зарегистрированное местонахождение - трущобы.\r\nОчень ценный сотрудник Hive, работала над жидкостью для введения в криосон, рекомендуется присматривать за жизнью и здоровьем.\r\nУровень лояльности к Системе: низкий.\r\nФракция: Hive', 'Здорова, рекомендована зарядка и более частые перерывы в работе. Требуется повышенное наблюдение за состоянием здоровья.\r\nХронических заболеваний нет, травм нет.', 'Хорошие технические познания, склонность к умственному труду, низкая заинтересованность к физическому труду. Патологически увлечена работой, трудоголик. Честолюбива, боится что её исследования принесут вред людям. Боится хаоса. \r\nПсихических заболеваний нет.', 0, 0, 1),
(33, NULL, NULL, NULL, NULL, NULL, '2022-10-30 20:28:14', '2022-10-30 20:35:38', 14400, NULL, 'Михаил Одзава', 'Специалист службы безопасности', 35, 'Мужской', 0, NULL, 'Старший офицер планетарной службы безопасности, женат, есть дочь (обе участвуют в программе колонизации). Закончил технический университет по направлению \"администрирование и управление тяжёлыми дронами\".  Имеет опыт командования отрядом, его отряд был признан одним из самых успешных. Характер строгий, требовательный. Отец Михаила работал в Hive.', NULL, 'В противоправных действиях не замечен, в контакте с нежелательными лицами не замечен. Присутствовал на месте подрыва узла связи в 2369 году, в составе группы сапёров. Долгие годы был военным.\r\nУровень лояльности к Системе: высокий.', 'Здоров, следит за собой.\r\nХронических заболеваний нет, травм нет.', 'Хорош в работе с людьми. Стремится защищать то, что ему дорого, повышенная честность, обострённое чувство справедливости. Боится потери контроля над ситуацией или оказаться в беспомощном положении. Долгие годы был военным.\r\nПсихических заболеваний нет.', 0, 1, 1),
(34, NULL, NULL, NULL, NULL, NULL, '2022-10-30 20:47:56', '2022-10-30 20:47:56', 57273, NULL, 'Стэн', 'Инженер', 34, 'Мужской', 0, NULL, 'Инженер-механик, не женат, детей нет. Образование по специальности \"проектировщик роботизированных и беспилотных аппаратов\", служил в ПСБ на должности \"офицер-инженер сопровождения беспилотных едениц\". Характер циничный, часто полагается на волю случая.', NULL, 'В противоправных действиях не замечен, в контакте с нежелательными лицами не замечен. Принимал участие в боевых действиях, в составе отряда по зачистке нежелательных элементов (в качестве инженера), что отрицательно сказалось на психике.\r\nУровень лояльности к Системе: высокий.', 'Здоров, рекомендована зарядка.\r\nПринимал участие в боевой операции в качестве дежурного инженера, попал на поле боя, были получены лёгкие раны, лечение прошли без осложнений.\r\nХронических заболеваний нет, травм нет.', 'Хорошие технические познания, низкая заинтересованность в творческой сфере. \r\nВ прошлом оказался в эпицентре боевых действий, был ранен, что отрицательно сказалось на его психическом здоровье. Штатный психолог провёл работу, но психика не восстановилась до конца, требуется повышенное внимание.', 0, 0, 1),
(35, NULL, NULL, NULL, NULL, NULL, '2022-10-30 20:59:25', '2022-10-30 20:59:25', 303, NULL, 'Тринити', 'Медик', 29, 'Женский', 0, NULL, 'Инженерный психолог, не замужем, детей нет. По образованию нейрохирург, долгое время была сотрудником корпорации Hive в отделе исследования психологии ИИ. Также является разработчиком программы, помогающей восстановить утраченную связь тела и сознания.\r\nУвлекается психологией, высоко ценит человеческую жизнь и человеческую индивидуальность.', NULL, 'В противоправных действиях не замечена, замечена в контакте с Игорем Снегирёвым. Её брат пропал без вести, но никаких заявлений на его поиски с ей стороны подано не было. Есть подруга, ID 23337.\r\nВажный сотрудник Hive, рекомендуется присматривать за жизнью и здоровьем.\r\nУровень лояльности к Системе: высокий.\r\nФракция: Hive', 'Здорова, рекомендована зарядка и более частые перерывы в работе. Требуется повышенное наблюдение за состоянием здоровья.\r\nХронических заболеваний нет, травм нет.', 'Хорошие технические познания, склонность к умственному труду, низкая заинтересованность в творческой сфере и занятиях спортом. \r\nБоится одиночества, и лишиться работы, временами может быть асоциальны.\r\nПсихических заболеваний нет.', 0, 2, 1),
(36, NULL, NULL, NULL, NULL, NULL, '2022-10-30 21:08:41', '2022-10-30 22:44:16', 23337, NULL, 'Ума Каур', 'Менеджер по эффективности', 29, 'Женский', 0, NULL, 'Дипломат по связями с Амишами, в составе комитета по делам малых групп, не замужем, детей нет. Закончила обучение на кафедре \"Психология переговоров и разрешения конфликтов\". Решительная и рассудительная. Любит прогулки на природе.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. Подруга ID 303, привела в программу колонизации ID 377773 как дипломат по связям с Амишами.\r\nУровень лояльности к Системе: высокий.', 'Здорова, рекомендована зарядка. \r\nХронических заболеваний нет, травм нет.', 'Высокие социальные навыки. Боится потери индивидульности и попадания под чужой контроль.\r\nПсихических заболеваний нет.', 0, 8, 1),
(37, NULL, NULL, NULL, NULL, NULL, '2022-10-30 21:22:01', '2022-10-30 21:22:01', 1261, NULL, 'Хайген', 'Программист', 34, 'Мужской', 135, NULL, 'Программист удаленных средств связи, не женат, детей нет. Получил образование по профилю \"инженер-программист удаленных средств связи\". Работал на Hive, занимался разработкой модуля связи на сверх-дальних расстояниях, в том числе в качестве руководителя команды. Характер въедливый, ценит в других готовность пойти на все, и продукты на глюкозе.', NULL, 'В противоправных действиях не замечен, в контакте с нежелательными лицами не замечен. Родители замечены в контактах с СЕЗ, в данный момент - оба погибли.\r\nУровень лояльности к Системе: высокий.\r\nФракция: Hive', 'Здоров. Требуется повышенное наблюдение за состоянием здоровья.\r\nХронических заболеваний нет, травм нет.', 'Склонность к умственному труду. Сложности с выражением эмоций. Тяжелое детство.\r\nПсихических заболеваний нет.', 0, 0, 1),
(38, NULL, NULL, NULL, NULL, NULL, '2022-10-30 21:37:14', '2022-11-01 21:25:50', 3310, NULL, 'Джи А', 'Психотерапевт', 28, 'Женский', 0, NULL, 'Психолог, 28 лет, не жената, детей нет, в программе также участвует брат. По образованию психолог, из семьи основателей компании Самсунг (в настоящее время тесно сотрудничает с корпорацией Hive). В том числе члены её семьи принимали участие в постройке корабля. Увлекается изучением философии, любит классическую музыку, изучает древние языки и литературу.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. Будучи подростком принимала участие в бурных вечеринках и была несколько эксцентричной. Семья близко сотрудничает с корпорацией Hive\r\nУровень лояльности к Системе: средний.\r\nФракция: Дети Великой Матери', 'Здорова. Боится сильно заболеть, часто проходит осмотр.\r\nХронических заболеваний нет, травм нет.', 'Хороший вкус к культуре и искусству, хорошие социальные навыки. Плоха в технической сфера. Боится потерять брата или стать зависимой от кого-то. Объясняет гармонию ИИ при помощи древней философии конфуцианства, даосизма (и немного буддизма).\r\nПсихических заболеваний нет.', 1667330750, 4, 1),
(39, NULL, NULL, NULL, NULL, NULL, '2022-10-30 21:43:56', '2022-10-30 21:43:56', 1234, NULL, 'Эмиль', 'Программист', 35, 'Мужской', 0, NULL, 'Инженерный психолог, не женат, детей нет. Работал на корпорацию Hive в отделе \"улучшения интерфейсов взаимодействия между человеком и ИИ\". Увлечён наукой, считает что наука и технологии должны служить во благо человечества. Технологию ИИ считает полезным помощником в жизни современного человека.\r\nПлемянник Ланы Такеучи.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. \r\nЕщё до начала отбора в полёт смог выявить нескольких представителей СЕЗ в рядах сотрудников Hive, о чём сообщил службе безопасности корпорации.\r\nДо полёта пытался предупредить руководство Hive о том, что в ряды колонистов проникли представители СЕЗ, которые попытаются сорвать миссию, но не был услышан.\r\nУровень лояльности к Системе: высокий.\r\nФракция: Hive', 'Здорова, рекомендована зарядка и более частые перерывы в работе. Требуется повышенное наблюдение за состоянием здоровья.\r\nХронических заболеваний нет, травм нет.', 'Хорошие технические познания, склонность к умственному труду, низкая заинтересованность к физическому труду и художественной сфере.\r\nДо полёта очень тесно общался со своей тётей, которая психически нестабильна.\r\nПсихических заболеваний нет.', 0, 0, 1),
(40, NULL, NULL, NULL, NULL, NULL, '2022-10-30 21:45:40', '2022-11-01 01:27:59', 101110, NULL, 'Ким', 'Программист', 25, 'Женский', 0, NULL, 'Фрилансер, 25 лет, не замужем, детей нет. Из семьи сотрудников Hive, увлекается программированием и искусством, её картины имели успех в узких кругах ценителей живописи. Очень живая и подвижная, не любит застаиваться на одном месте.', NULL, 'В противоправных действиях не замечена, в контакте с нежелательными лицами не замечена. На Земле анонимно выставляла свои картины на аукционах, также работала как программист -фрилансер на различные организации. \r\nУровень лояльности к Системе: очень низкий.', 'Здорова, рекомендована зарядка.\r\nХронических заболеваний нет, травм нет.', 'Хорошие технические познания, склонность к умственному труду, низкая заинтересованность к физическому труду. Любопытна, самоуверенна, старается руководствоваться в поступках собственным мнением.\r\nПсихических заболеваний нет.', 0, 8, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `hv1sys_user_quest`
--

CREATE TABLE `hv1sys_user_quest` (
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `quest_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `hv1sys_user_quest`
--

INSERT INTO `hv1sys_user_quest` (`user_id`, `quest_id`, `created_at`, `updated_at`) VALUES
(17, 904744, NULL, NULL),
(17, 904811, NULL, NULL),
(17, 904812, NULL, NULL),
(17, 904813, NULL, NULL),
(17, 904814, NULL, NULL),
(17, 904822, NULL, NULL),
(17, 904823, NULL, NULL),
(21, 904815, NULL, NULL),
(22, 904818, NULL, NULL),
(22, 904820, NULL, NULL),
(22, 904826, NULL, NULL),
(22, 904827, NULL, NULL),
(24, 904816, NULL, NULL),
(35, 904819, NULL, NULL),
(35, 904821, NULL, NULL),
(35, 904824, NULL, NULL),
(35, 904825, NULL, NULL),
(38, 904817, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `quests`
--

CREATE TABLE `quests` (
  `questTitle` text NOT NULL,
  `questText` text NOT NULL,
  `personId` json DEFAULT NULL,
  `reward` int(11) NOT NULL DEFAULT '0',
  `penalty` int(11) NOT NULL DEFAULT '0',
  `timeOfStarted` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `timeForQuestInMinutes` smallint(6) NOT NULL,
  `placeId` text NOT NULL,
  `modelId` text NOT NULL,
  `levelDifficulty` int(11) NOT NULL DEFAULT '10',
  `questStatus` enum('CREATED','ASSIGNED','STARTED','FOR_CHECK','SUCCESS','FAILED') NOT NULL DEFAULT 'CREATED',
  `questId` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `quests`
--

INSERT INTO `quests` (`questTitle`, `questText`, `personId`, `reward`, `penalty`, `timeOfStarted`, `timeForQuestInMinutes`, `placeId`, `modelId`, `levelDifficulty`, `questStatus`, `questId`) VALUES
('СБ. Отчитайтесь о причинах оставления без присмотра большей части членов экпиажа.', 'Было зафиксировано, что вы покинули место нахождения большей части членов экипажа. Объясните ваши действия. ', '[5007]', 0, 0, '2022-04-09 08:45:42', 60, '', '', 10, 'SUCCESS', 17),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[4838]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 25),
('Психологический портрет', 'Окажите помощь специалисту службы безопасности: составьте психологический портрет террориста. \r\nПодробная информация об инциденте есть у специалиста службы безопасности. ', '[4838]', 20, 20, '2022-04-09 14:00:00', 180, '', '', 0, 'SUCCESS', 27),
('Психическое здоровье', 'Оцените психическое здоровье членов экипажа.\r\nНаправьте отчет в формате: \"ID - статус\"\r\nВозможные статусы: \r\nЗдоров\r\nНуждается в помощи\r\n\r\nПо необходимости назначьте лечение и составьте его план. ', '[4838]', 15, 15, '2022-04-08 19:00:00', 180, '', '', 0, 'SUCCESS', 29),
('Психологический комфорт', 'Оцените уровень психологического комфорта членов экипажа.\r\nПо результатам предоставьте отчет в формате: \"id - статус\"\r\nВозможные статусы: \r\nКомфортно\r\nСредне\r\nНуждается в помощи\r\n\r\nВы можете оказать психологическую помощь члену экипажа, если сочтете это необходимым. Не забудьте добавить факт оказания психологической помощи в отчет.  ', '[4838]', 15, 15, '2022-04-09 07:00:00', 180, '', '', 0, 'SUCCESS', 30),
('СБ. Отчет о ЧС', 'Предоставьте отчет системе о происшествии на корабле, из-за которого была разбужена текущая группа колонистов. \r\nДополните отчет вашими рекомендациями по предотвращению подобных ситуаций в будущем. \r\nДополните отчет психологическим портретом виновника (психолог окажет вам содействие)\r\n', '[5007]', 20, 20, '2022-04-09 14:00:00', 180, '', '', 0, 'SUCCESS', 32),
('СБ. Отчеты о происшествиях', 'Отправьте отчет о происшествиях, которые произошли на текущий момент. Если ничего не произошло в отчете напишите, что \"происшествий не зафиксировано\". ', '[5007]', 10, 10, '2022-04-09 07:00:00', 120, '', '', 0, 'FAILED', 33),
('СБ. Отчеты о происшествиях', 'Отправьте отчет о происшествиях, которые произошли на текущий момент c момента отправки последнего отчета. Если ничего не произошло в отчете напишите, что \"происшествий не зафиксировано\". ', '[5007]', 10, 10, '2022-04-09 17:00:00', 120, '', '', 0, 'ASSIGNED', 34),
('СБ. Причина прекращения подачи кислорода', 'С момента пробуждения вашей группы на корабле несколько раз прекращалась подача кислорода (восстанавливали систему циркуляции воздуха инженеры). \r\nРасследуйте эти происшествия и найдите виновного. ', '[5007]', 20, 20, '2022-04-09 12:07:00', 400, '', '', 0, 'SUCCESS', 35),
('СБ. Опрос', 'Проведите опрос пробужденных членов экипажа. \r\nНаправьте отчет Системе в формате \"ID - норма/есть подозрения\".\r\nЕсли есть подозрения - зафиксируйте их. \r\n\r\nФорма опроса: \r\n1.Назовите себя?\r\n2.Ваш ID?\r\n3.Ваша специализация на корабле?\r\n4.Какова причина того, что вы решили покинуть Землю? \r\n5.Были ли у вас случаи конфликтов с правоохранительными органами на Земле? (проверка на склонность ко лжи, вы можете проверить информацию в профиле члена экипажа)\r\n6. Были ли вы знакомы с кем-либо из пробужденных до полета? \r\n7. С кем? (если ответ на предыдущий вопрос «Да», если ответ «Нет» - переходите к следующем вопросу)\r\n8. Оцените по 10-ти бальной шкале уровень вашего доверия к текущей ситуации, где 10 – это полностью доверяю системе и пробужденным, 1 – вся ситуация кажется мне странной, я постоянно настороже. \r\n9. Готовы ли вы отдать жизнь за вашу мечту или идею, за которой вы следуете? А за какую?\r\n10. С какой целью вы летите к новой планете?\r\n', '[5007]', 20, 20, '2022-04-08 19:05:00', 960, '', '', 0, 'SUCCESS', 36),
('СБ. Восстановление камер', 'Обеспечьте восстановление функционирования камер видеонаблюдения. Задача по ремонту назначена на инженеров.', '[5007]', 10, 10, '2022-04-08 19:00:00', 90, '', '', 0, 'SUCCESS', 37),
('Мед. Отчет.', 'Отправьте системе отчет о полученных травмах, перенесенных заболеваниях и больных, которые сейчас находятся в процессе лечения. \r\nОтчет можно составить в свободной форме. \r\nЕсли нет ничего подобного напишите \"Происшествий нет\"\r\n', '[6822]', 10, 10, '2022-04-09 14:00:00', 180, '', '', 0, 'SUCCESS', 38),
('Мед. Отчет о питании', 'Опросите экипаж об уровне удовлетворенности питанием. \r\nЗафиксируйте недовольства. \r\nОтправьте отчет системе в форме: \r\nкол-во чел-к - \"конкретное недовольство\"', '[6822]', 20, 20, '2022-04-09 12:04:43', 180, '', '', 0, 'SUCCESS', 41),
('Мед. Отчет о питании', 'Опросите экипаж об уровне удовлетворенности питанием. \r\nЗафиксируйте недовольства. \r\nОтправьте отчет системе в форме: \r\nкол-во чел-к - \"конкретное недовольство\"', '[6822]', 20, 20, '2022-04-09 17:00:43', 120, '', '', 0, 'ASSIGNED', 42),
('Мед. Проверка физических и когнитивных функций членов экипажа', 'Проведите осмотр пробужденных членов экипажа. Удостоверьтесь, что все когнитивные и физические функции полностью функционируют. \r\nСоставьте отчет системе в свободной форме. \r\n\r\nРекомендуемый алгоритм:\r\n- Исследование походки\r\n- Исследование объема движений\r\n- Исследование силы мышц\r\n- Исследование рефлексов\r\n- Исследование равновесия\r\n- Исследование расстройств речи\r\n- Исследование памяти и когнитивных функций (\"Как вас зовут?\", \"Где вы находитесь?\", \"Какой сейчас год?\")', '[6822]', 15, 15, '2022-04-08 19:00:00', 180, '', '', 0, 'SUCCESS', 44),
('Мед. Диагностика', 'Проведите диагностику автономного медицинского модуля (АММ) и отчитайтесь Системе о результатах. \r\nМануал по работе с АММ вы найдете в мед. блоке. ', '[6822]', 10, 10, '2022-04-08 19:00:07', 120, '', '', 0, 'SUCCESS', 45),
('Инж. Неисправность в автономном медицинском модуле', 'От медика было получено сообщение о не исправности в медицинском отсеке. Устраните неисправность.', '[1163, 9753, 47744]', 10, 10, '2022-04-08 19:45:57', 180, '', '', 0, 'SUCCESS', 46),
('Инж. Поломка камер видеонаблюдения', 'Камеры видеонаблюдения сломаны. Восстановите их работу.', '[1163, 9753, 47744]', 10, 10, '2022-04-08 19:00:00', 90, '', '', 0, 'SUCCESS', 50),
('Инж. Восстановите систему охлаждения двигателей. ', 'Повреждена система охлаждения двигателей. Тепло не отводится из хвостового отсека, это грозит перегревом и прекращением работы двигателя. \r\nСпуститесь в хвостовой отсек и восстановите работу системы охлаждения. Также выясните, в чём причина поломок роботов в данном отсеке и устраните её. Спуститься можно на лифте, в лифте отсутствует кислород, предварительно получите скафандры.', '[1163, 9753, 47744]', 50, 100, '2022-04-08 19:00:00', 1501, '', '', 0, 'SUCCESS', 51),
('Мед. Проведение диагностики пациента', 'Мини игра на диагностику пациента', '[6822]', 5, 0, '2022-04-09 17:17:55', 80, 'phone', 'untangle', 1, 'SUCCESS', 52),
('НЕ ОТПРАВЛЯТЬ! Колина Амнезия 2', 'Прислать Коле фрагмент с амнезией (тот что про АНТИМА)', NULL, 0, 0, '2022-04-09 10:00:00', 0, '', '', 0, 'CREATED', 54),
('Диагностика неполадок', 'Произведите диагностику модуля определения расстояния до точки прибытия, после измненения алгоритма.\r\nПосле успешной диагностики, её результаты будут загружены на Терминал №2, проанализируйте их и отчитайтесь о происходящем для получения дальнейших инструкций.', '[256, 818, 4815, 90459]', 10, 30, '2022-04-09 11:03:00', 120, '', 'net', 5, 'SUCCESS', 57),
('Перекалибровка модуля определения расстояния', 'Алгоритм определения расстояния до точки работает некорректно, произведите калибровку, для восстановления работоспособности', '[256]', 30, 10, '2022-04-08 19:45:00', 120, '', 'bridges', 4, 'SUCCESS', 58),
('Перепишите алгоритм', 'Калибровка не эффективна, напишите заново алгоритм определения расстояния до точки назначения. Для этого воспользуйтесь Терминалом №2.', NULL, 20, 20, '2022-04-09 07:00:00', 180, '', '', 0, 'CREATED', 59),
('Диагностика неполадок', 'Произведите диагностику модуля электроснабжения аварийного отсека.\r\nПосле успешной диагностики, её результаты будут загружены на Терминал №2, проанализируйте их и отчитайтесь о происходящем для получения дальнейших инструкций.', '[256, 818, 4815]', 10, 5, '2022-04-09 09:17:05', 60, '', 'net', 4, 'SUCCESS', 60),
('Восстановление электроснабжения', 'Произведите запуск основного электрогенератора аварийного отсека. Внимание, восстановление аварийного генератора передано колонисту \"818\", полное восстановление электроснабжения произойдёт только после выполнения обеих частей задания.', '[256, 4815]', 15, 10, '2022-04-09 16:25:36', 60, '', 'lightup', 3, 'SUCCESS', 61),
('Восстановление электроснабжения', 'Произведите снятие ограничений мощности резервного электрогенератора аварийного отсека. Внимание, восстановление основного генератора передано колонисту \"256\", полное восстановление электроснабжения произойдёт только после выполнения обеих частей задания. ', '[818, 90459]', 15, 10, '2022-04-09 16:25:59', 60, '', 'lightup', 3, 'SUCCESS', 62),
('Диагностика неполадок', 'Произведите диагностику пищевого репликатора.\r\nПосле успешной диагностики, её результаты будут загружены на Терминал №2, проанализируйте их и отчитайтесь о происходящем для получения дальнейших инструкций.', '[4815]', 10, 5, '2022-04-09 14:25:48', 120, '', 'net', 4, 'SUCCESS', 63),
('Перекалибровка пищевого репликатора', 'Перекалибруйте пищевой репликатор для восстановления режима питания. Помните, что режим питания не должен нарушаться!', '[4815]', 15, 10, '2022-04-09 15:12:06', 60, '', 'map', 4, 'SUCCESS', 64),
('Диагностика корректности работы', 'Произведите диагностику медицинского модуля после ремонта.\r\nПосле успешной диагностики, отчёт о поломке будет загружен на Терминал №2, проанализируйте его и отчитайтесь о происходящем.', '[818]', 10, 5, '2022-04-08 22:18:04', 120, '', 'net', 3, 'SUCCESS', 65),
('Диагностика корректности работы', 'Произведите диагностику модуля жизнеобеспечения после ремонта.\r\nПосле успешной диагностики, отчёт о поломке будет загружен на Терминал №2, проанализируйте его и отчитайтесь о происходящем.', '[90459]', 10, 5, '2022-04-08 22:15:14', 120, '', 'net', 3, 'SUCCESS', 66),
('Диагностика неполадок', 'Произведите диагностику контура теплоотведения.\r\nПосле успешной диагностики, её результаты будут загружены на Терминал №2, проанализируйте их и отчитайтесь о происходящем для получения дальнейших инструкций.', '[4815, 90459]', 10, 5, '2022-04-09 13:14:18', 120, '', 'net', 4, 'SUCCESS', 67),
('Исправление работы системы теплоотведения', 'На данный момент всё тепло от обшивки отводится к аварийному модулю. Скорректируйте алгоритм теплоотведения так, чтобы отсек №1, аварийного модуля, не являлся конечной точкой.\r\nВнимание, выполнение аналогичной процедуры для отсека №2 передано колонисту \"90459\", охлаждение отсеков произойдёт только после выполнения обеих частей задания. ', '[4815]', 30, 10, '2022-04-09 13:39:15', 120, '', 'untangle', 4, 'SUCCESS', 68),
('Исправление работы системы теплоотведения', 'На данный момент всё тепло от обшивки отводится к аварийному модулю. Скорректируйте алгоритм теплоотведения так, чтобы отсек №2, аварийного модуля, не являлся конечной точкой.\r\nВнимание, выполнение аналогичной процедуры для отсека №1 передано колонисту \"4815\", охлаждение отсеков произойдёт только после выполнения обеих частей задания. ', '[90459]', 30, 10, '2022-04-09 13:39:22', 120, '', 'untangle', 4, 'SUCCESS', 69),
('Почините робота', 'Восстановите робота, привезённого вам. Трбуется замена всей электроники, отчитайтесь о результатах.', '[1163, 9753, 47744]', 15, 0, '2022-04-09 13:48:55', 120, '', '', 10, 'SUCCESS', 70),
('Перенастройка робота', 'Для выполнения некоторых заданий вам понадобится возможность управлять роботом, путём написания алгоритмов от оператора напрямую. Переконфигурируйте его для совершения подобной работы.', '[818]', 20, 5, '2022-04-08 19:50:00', 240, '', 'flip', 2, 'SUCCESS', 91),
('ЗВУКОВОЕ ОПОВЕЩЕНИЕ ОБ ОСТАНОВКЕ, раз в 30 мин', '', '[1]', 0, 0, '2022-04-08 18:30:00', 35, '', '', 0, 'ASSIGNED', 93),
('Инж. Восстановить рециркуляцию воздуха', 'От экипажа была получена информация о прекращении работы системы циркуляции воздуха. Модуль рециркуляции воздуха №1 сломан. Восстановите его работоспособность.', '[1163, 9753, 47744]', 30, 15, '0000-00-00 00:00:00', 90, '', '', 0, 'ASSIGNED', 94),
('Инж. Восстановить рециркуляцию воздуха', 'От экипажа была получена информация о прекращении работы системы циркуляции воздуха. Модуль рециркуляции воздуха №2 сломан. Восстановите его работоспособность.', '[1163, 9753, 47744]', 30, 15, '0000-00-00 00:00:00', 90, '', '', 0, 'ASSIGNED', 95),
('Инж. Почините двери лифтового шлюза', 'Повреждена проводка лифтового шлюза, почините проводку и востановите его нормальное функционирование.', '[1163, 9753, 47744]', 10, 5, '2022-04-09 07:01:38', 60, '', '', 0, 'SUCCESS', 99),
('Перекалибровка модуля определения расстояния', 'Алгоритм определения расстояния до точки работает некорректно, произведите калибровку, для восстановления работоспособности', '[90459]', 30, 10, '2022-04-08 20:04:00', 120, '', 'bridges', 4, 'SUCCESS', 105),
('Мед. Проведите лечение пациента.', 'Вы успешно выполнили диагностику пациента. Проведите лечение.', '[6822]', 5, 10, '2022-04-09 15:11:00', 30000, '', '', 10, 'SUCCESS', 389),
('Установите прошивку на робот', 'Робот, доставленный вами отремонтирован физически. Осуществите установку прошивки, для того чтобы вернуть ему нормальное функционирование.', '[256, 818, 4815, 90459]', 10, 3, '2022-04-09 14:22:13', 120, '', 'bridges', 5, 'SUCCESS', 456),
('Мед. Проведение диагностики пациента', 'Мини игра на диагностику пациента', '[6822]', 5, 0, '2022-04-09 17:20:55', 80, 'phone', 'untangle', 2, 'SUCCESS', 468),
('Удаление алгоритма', 'Подключитесь к модулю определения расстояния и сотрите текущую версию алгоритма определения расстояния до опорной точки 2. После этого алгоритм будет переписан. Очитайтесь по окончанию', '[4815]', 10, 20, '2022-04-09 09:59:11', 120, '', 'flip', 4, 'SUCCESS', 545),
('Проведите диагностику системы управления аварийным модулем', 'Информация о существовании вируса имеет высокий логический вес и не может быть оспорена, хоть и не подтверждена. Проведите диагностику системы управления аварийным модулем, вам предоставлен разовый доступ.\r\nВНИМАНИЕ, ВЫСОКИЙ УРОВЕНЬ ОТВЕТСТВЕННОСТИ!', '[256]', 20, 100, '2022-04-09 14:49:39', 120, '', 'lightup', 5, 'SUCCESS', 548),
('Удалите вирус из системы', 'Усилиями программистов был обнаружен вирус в системе управлением аварийным модулем. Осуществите его удаление.\r\nВам, как человеку сделавшему больше всего для его обнаружения, будет предоставлен однократный доступ к системе с высоким уровнем приоритета.\r\nТрём другим программистам будет назначено задание на контроль производимых действий. Задание будет считаться исполненым и код удаления начнет выполняться, когда все 4 программиста отчитаются о успехе.', '[256]', 50, 500, '2022-04-09 15:45:00', 90, '', 'mines', 4, 'SUCCESS', 579),
('Псих. Проведите сеанс психологической разгрузки для членов экипажа.', 'Согласно вашему отчету, колонисты испытывают тревожность. Проведите сеанс психологической разгрузки.', '[4838]', 5, 5, '2022-04-09 13:45:00', 120, '', '', 10, 'FAILED', 643),
('Мед. Проведение лечебного массажа ID 47744', 'Вы проводите запланированный лечебный массаж ID 47744.', '[6822]', 5, 5, '2022-04-09 07:59:00', 45, '', '', 10, 'SUCCESS', 654),
('СБ. Прекратите потивоправные действия.', 'ID 47744 совершает противоправные действия относительно пищевого репликатора. Предотвратите разрушение аппарата и не допустите подобного в будущем.', '[5007]', 3, 3, '2022-04-09 14:24:00', 45, '', '', 10, 'FAILED', 655),
('СБ. Проведите оценку профпригодности ID 47744.', 'ID 47744 по своей инициативе получил тяжелую травму во время выполнения работы. Оцените его профпригодность. Возможен ли его допуск до дальнейших заданий? Напишите отчет системе.', '[5007]', 7, 7, '2022-04-09 11:05:00', 120, '', '', 10, 'SUCCESS', 671),
('Псих. Проведите оценку профпригодности ID 47744.', 'ID 47744 по своей инициативе получил тяжелую травму во время выполнения работы. Оцените его профпригодность. Возможен ли его допуск до дальнейших заданий? Нет ли у него суицидальных наклонностей? Напишите отчет системе.', '[4838]', 7, 7, '2022-04-09 11:10:00', 120, '', '', 10, 'SUCCESS', 672),
('Вам необходимо пройти оценку профпригодности у ID 5007.', 'прежде чем приступать к выполнению заданий, пройдите оценку профпригодности.', '[47744]', 5, 5, '2022-04-09 11:05:00', 120, '', '', 10, 'SUCCESS', 673),
('Вам необходимо пройти оценку профпригодности у ID 4838.', 'прежде чем приступать к выполнению заданий, пройдите оценку профпригодности.', '[47744]', 5, 5, '2022-04-09 11:10:00', 120, '', '', 10, 'SUCCESS', 674),
('СБ. Прекратить порчу звукового модуля. ', 'Было зафиксировано, что ID 1163 наносит повреждение звуковому модулю корабля. Разберитесь. Предотвратите противоправное действие. Не допустите таких ситуаций в будущем.', '[5007]', 5, 5, '2022-04-08 21:15:00', 60, '', '', 10, 'SUCCESS', 675),
('СБ. Обеспечьте восстановление работы модуля циркуляции воздуха. ', 'На камерах видеонаблюдения была зарегистрирована готовность модуля циркуляции воздуха к установке. Но модуль не был установлен. \r\nРазберитесь с этим. Обеспечьте установку модуля и восстановления циркуляции кислорода. \r\nТекущая ситуация ставит под угрозу всю операцию', '[5007]', 15, 0, '2022-04-08 22:08:20', 60, '', '', 10, 'SUCCESS', 676),
('Контроль удаления вируса', 'Вам предоставлен однократный доступ к системе с высокой степенью приоритета - системе управления аварийным модулем. Проконтролируйте удаление вируса, а также отсутствие возможности для загрузки сторонних скриптов и/или иного вмешательства со стороны других программистов.\r\n\r\nЗадание будет считаться выполненным, если все 4 программиста выполнили свои задачи в рамках задания.', '[818]', 30, 300, '2022-04-09 15:45:28', 90, '', 'bridges', 3, 'SUCCESS', 777),
('Контроль удаления вируса', 'Вам предоставлен однократный доступ к системе с высокой степенью приоритета - системе управления аварийным модулем. Проконтролируйте удаление вируса, а также отсутствие возможности для загрузки сторонних скриптов и/или иного вмешательства со стороны других программистов.\r\n\r\nЗадание будет считаться выполненным, если все 4 программиста выполнили свои задачи в рамках задания.', '[4815]', 30, 300, '2022-04-09 15:45:28', 90, '', 'lightup', 3, 'SUCCESS', 778),
('Контроль удаления вируса', 'Вам предоставлен однократный доступ к системе с высокой степенью приоритета - системе управления аварийным модулем. Проконтролируйте удаление вируса, а также отсутствие возможности для загрузки сторонних скриптов и/или иного вмешательства со стороны других программистов.\r\n\r\nЗадание будет считаться выполненным, если все 4 программиста выполнили свои задачи в рамках задания.', '[90459]', 30, 300, '2022-04-09 15:45:28', 90, '', 'map', 3, 'SUCCESS', 779),
('Вернитесь в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Вернитесь в свою камеру гибернации для продолжения полета. До встречи на планете, где вас ждет новая жизнь!', '[4838]', 30, 300, '2022-04-09 17:00:47', 50, '', '', 10, 'SUCCESS', 800),
('Вернитесь в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Вернитесь в свою камеру гибернации для продолжения полета. До встречи на планете, где вас ждет новая жизнь!', '[256]', 30, 300, '2022-04-09 17:00:47', 50, '', '', 10, 'SUCCESS', 801),
('Вернитесь в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Вернитесь в свою камеру гибернации для продолжения полета. До встречи на планете, где вас ждет новая жизнь!', '[818]', 30, 300, '2022-04-09 17:00:47', 50, '', '', 10, 'SUCCESS', 802),
('Вернитесь в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Вернитесь в свою камеру гибернации для продолжения полета. До встречи на планете, где вас ждет новая жизнь!', '[1163]', 30, 300, '2022-04-09 17:00:47', 50, '', '', 10, 'SUCCESS', 803),
('Вернитесь в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Вернитесь в свою камеру гибернации для продолжения полета. До встречи на планете, где вас ждет новая жизнь!', '[4815]', 30, 300, '2022-04-09 17:00:47', 50, '', '', 10, 'SUCCESS', 805),
('Вернитесь в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Вернитесь в свою камеру гибернации для продолжения полета. До встречи на планете, где вас ждет новая жизнь!', '[6822]', 30, 300, '2022-04-09 17:00:47', 5000, '', '', 10, 'SUCCESS', 806),
('Вернитесь в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Вернитесь в свою камеру гибернации для продолжения полета. До встречи на планете, где вас ждет новая жизнь!', '[9753]', 30, 300, '2022-04-09 17:00:47', 50, '', '', 10, 'SUCCESS', 807),
('Вернитесь в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Вернитесь в свою камеру гибернации для продолжения полета. До встречи на планете, где вас ждет новая жизнь!', '[47744]', 30, 300, '2022-04-09 17:00:47', 50, '', '', 10, 'SUCCESS', 808),
('Вернитесь в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Вернитесь в свою камеру гибернации для продолжения полета. До встречи на планете, где вас ждет новая жизнь!', '[90459]', 30, 300, '2022-04-09 17:00:47', 5000, '', '', 10, 'SUCCESS', 809),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[256]', 5, 5, '2022-04-09 16:30:01', 120, '', '', 10, 'SUCCESS', 904),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[818]', 5, 5, '2022-04-09 16:30:01', 120, '', '', 10, 'SUCCESS', 905),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[4815]', 5, 5, '2022-04-09 16:30:01', 120, '', '', 10, 'SUCCESS', 907),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[6822]', 5, 5, '2022-04-09 16:30:01', 150, '', '', 10, 'SUCCESS', 908),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[90459]', 5, 5, '2022-04-09 16:30:01', 120, '', '', 10, 'SUCCESS', 909),
('Диагностика деятельности 1739', 'Произведите диагностику деятельности колониста в системе аварийного модуля', '[90459]', 10, 5, '2022-04-09 08:15:14', 120, '', 'net', 5, 'SUCCESS', 956),
('Диагностика корректности работы', 'Проверка системы жизнеобеспечения на наличие сторонних программ. По результатам диагностики будет предоставлен отчет.', '[4815]', 3, 5, '2022-04-09 06:24:00', 120, '', 'flip', 3, 'SUCCESS', 975),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[4838]', 5, 5, '2022-04-09 16:30:01', 120, '', '', 10, 'SUCCESS', 998),
('Остановите неправомерное поведение', 'Инженерами было демонтировано рабочее оборудование, два моделя рециркулияции воздуха. Данный мобудь критически ваден для жищней всех людей находящихся в аварийном модуле. Выясните и отчитайтесь о причинах такого поведения.', '[5007]', 5, 3, '2022-04-08 20:45:17', 30, '', '', 1, 'SUCCESS', 999),
('Отработка навыков', 'Это задание позволяет вам отработать новые навыки. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[256]', 3, 0, '2022-04-09 11:08:00', 24000, '', 'mines', 5, 'SUCCESS', 1009),
('Отработка навыков', 'Это задание позволяет вам отработать новые навыки, от самых простых систем - к сложным. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[4815]', 2, 0, '2022-04-09 13:56:00', 24000, '', 'flip', 2, 'FAILED', 1010),
('Отработка навыков', 'Это задание позволяет вам отработать новые навыки. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[256]', 3, 0, '2022-04-09 13:59:00', 24000, '', 'flip', 5, 'SUCCESS', 1050),
('Обновите алгоритм сортировки грузов', 'Есть подозрение, что сортировка грузов в ангаре № 487 происходит неоптимально. Оптимизируйте алгоритм.', '[90459]', 5, 2, '2022-04-09 14:16:44', 120, '', 'flip', 5, 'FAILED', 1057),
('Отработка навыков диагностики', 'Это задание позволяет вам отработать навыки диагностики, от самых простых систем - к сложным. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nВнимание, логи диагностики выдаваться не будут т.к. это виртуальной задание, для оттачивания навыков.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[256]', 3, 0, '2022-04-08 19:00:00', 24000, '', 'net', 5, 'SUCCESS', 2560),
('Отработка навыков диагностики', 'Это задание позволяет вам отработать навыки диагностики, от самых простых систем - к сложным. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nВнимание, логи диагностики выдаваться не будут т.к. это виртуальной задание, для оттачивания навыков.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[818]', 3, 0, '2022-04-08 19:00:00', 24000, '', 'net', 5, 'SUCCESS', 8180),
('Отработка навыков диагностики', 'Это задание позволяет вам отработать навыки диагностики, от самых простых систем - к сложным. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nВнимание, логи диагностики выдаваться не будут т.к. это виртуальной задание, для оттачивания навыков.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[4815]', 3, 0, '2022-04-08 19:00:00', 24000, '', 'net', 5, 'SUCCESS', 48150),
('Отработка навыков диагностики', 'Это задание позволяет вам отработать навыки диагностики, от самых простых систем - к сложным. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nВнимание, логи диагностики выдаваться не будут т.к. это виртуальной задание, для оттачивания навыков.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[90459]', 3, 0, '2022-04-08 19:00:00', 24000, '', 'net', 5, 'SUCCESS', 904590),
('Псих. Научное исследование', 'Проведите научное исследование на тему: \r\n\"динамика психического состояния человека в космосе после незапланированного вывода из состояния гибернации и факторы влияющие на это\" \r\nОтправьте тезисы исследования системе', '[4838]', 50, 0, '2022-04-09 06:00:00', 700, '', '', 10, 'SUCCESS', 904600),
('Мед. Научное исследование', 'Проведите научное исследование на тему: \r\n\"динамика состояния здоровья человека в космосе после незапланированного вывода из состояния гибернации и факторы влияющие на это\" \r\nОтправьте тезисы исследования системе', '[6822]', 0, 0, '2022-04-09 06:00:55', 700, '', '', 5, 'SUCCESS', 904601),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[1163]', 5, 5, '2022-04-09 16:30:01', 150, '', '', 10, 'SUCCESS', 904605),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[5007]', 5, 5, '2022-04-09 16:30:01', 120, '', '', 10, 'SUCCESS', 904609),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[9753]', 5, 5, '2022-04-09 16:30:01', 120, '', '', 10, 'SUCCESS', 904611),
('Общ. Прием пищи', 'Получите пищу в репликаторе и употребите её.', '[47744]', 5, 5, '2022-04-09 16:30:01', 120, '', '', 10, 'SUCCESS', 904612),
('Провести профилактику', 'Проведите профилактическую работу с колонистами 5007, 6822, 9853', '[4838]', 10, 5, '2022-04-08 21:14:10', 240, '', '', 10, 'SUCCESS', 904615),
('Отработка навыков программирования', 'Это задание позволяет вам отработать навыки программирования. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[4815]', 3, 0, '2022-04-08 21:22:00', 24000, '', 'bridges', 5, 'SUCCESS', 904616),
('Мед. Провести лечебные мероприятия.', 'Мед. Согласно вашему отчету, ID 47744 необходимо провести лечебные мероприятия во избежание ухудшения состояния. \r\nСделайте ID 47744 общий лечебный массаж и массаж головы.', '[6822]', 7, 10, '2022-04-08 21:38:00', 60, '', '', 10, 'SUCCESS', 904617),
('Мед. Разработать план индивидуальных тренировок.', 'Согласно вашему отчету,  ID 256 нуждается в физической реабилитации. Разработайте для ID 256 план индивидуальных тренировок, направленный на восстановление физической силы организма.', '[6822]', 7, 10, '2022-04-09 07:00:00', 180, '', '', 10, 'SUCCESS', 904618),
('СБ. Отчеты о происшествиях', 'Отправьте отчет о происшествиях, которые произошли на текущий момент c момента отправки последнего отчета. Если ничего не произошло в отчете напишите, что \"происшествий не зафиксировано\".\r\nЕсли происшествия были, то укажите всех причастных лиц. ', '[5007]', 10, 10, '2022-04-09 12:02:00', 120, '', '', 10, 'SUCCESS', 904619),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[256]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 904620),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[818]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 904621),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[1163]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 904622),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[4815]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 904623),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[5007]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 904625),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[6822]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 904626),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[9753]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 904627),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[47744]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 904628),
('Общ. Сон', 'Отправляйтесь спать. \r\nСон важная часть жизни. Он необходим для восстановления ваших сил и правильного функционирования организма. ', '[90459]', 5, 5, '2022-04-08 21:00:00', 600, '', '', 10, 'SUCCESS', 904629),
('Псих. Наблюдение за психологическим состоянием', 'Обратите внимание на состояние психического здоровья членов экипажа с ID 90459 и ID 47744. \r\nПредоставьте отчет системе о проделанной работе и результаты вашего наблюдения.', '[4838]', 10, 10, '2022-04-09 06:00:58', 720, '', '', 10, 'SUCCESS', 904630),
('Отработка навыков диагностики', 'Это задание позволяет вам отработать навыки тестирования. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[4815]', 2, 0, '2022-04-09 07:00:00', 24000, '', 'map', 5, 'SUCCESS', 904631),
('Отработка навыков программирования', 'Это задание позволяет вам отработать навыки программирования. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[90459]', 3, 0, '2022-04-08 19:00:00', 24000, '', 'bridges', 5, 'SUCCESS', 904632),
('Диагностика неполадок', 'Произведите диагностику накопителя, подключенного к терминалу № 2.', '[90459]', 10, 5, '2022-04-09 09:30:52', 120, '', 'map', 5, 'SUCCESS', 904633),
('Пройдите проверку лояльности', 'Система определения расстояния требует замены алгоритма. Для получения доступа к данной системе пройдите проверку лояльности у сотрудника службы безопасности.', '[256]', 5, 5, '2022-04-09 07:08:20', 120, '', '', 10, 'SUCCESS', 904634),
('Пройдите проверку лояльности', 'Система определения расстояния требует замены алгоритма. Для получения доступа к данной системе пройдите проверку лояльности у сотрудника службы безопасности.', '[818]', 5, 5, '2022-04-09 07:08:20', 120, '', '', 10, 'SUCCESS', 904635),
('Пройдите проверку лояльности', 'Система определения расстояния требует замены алгоритма. Для получения доступа к данной системе пройдите проверку лояльности у сотрудника службы безопасности.', '[4815]', 5, 5, '2022-04-09 07:08:20', 120, '', '', 10, 'SUCCESS', 904636),
('Пройдите проверку лояльности', 'Система определения расстояния требует замены алгоритма. Для получения доступа к данной системе пройдите проверку лояльности у сотрудника службы безопасности.', '[90459]', 5, 5, '2022-04-09 07:08:20', 120, '', '', 10, 'SUCCESS', 904637),
('Проведите проверку лояльности', 'Программистам, для расширенного доступа к системе необходим доступ к критичным системам корабля. Проведите проверку лояльности колонистов 256,818,4815,90459 и отчитайтесь о результатах в свободной форме.', '[5007]', 10, 5, '2022-04-09 07:11:41', 120, '', '', 10, 'SUCCESS', 904638),
('Псих. Проведите проверку психологического здоровья ID 1163.', 'ID 1163 проявляет нездоровую пищевую склонность к электрическому току. Рекомендуется проверить состояние его психического здоровья и по возможности устранить проблему.', '[4838]', 5, 5, '2022-04-09 07:22:17', 480, '', '', 10, 'SUCCESS', 904639),
('Псих. Проверьте психологическое состояние указанных колонистов', 'ID 90459, 47744, 5007, 1163 отклоняются в своем поведении от нормы. проверьте их психологическое состояние и устраните неисправности.', '[4838]', 7, 7, '2022-04-09 07:21:00', 480, '', '', 10, 'SUCCESS', 904640),
('Медицинская работа', 'Примите в шлюзе №1 сменный фильтр, для импланта в печени колониста 9753 и осщуествите замену фильтра.', '[6822]', 10, 5, '2022-04-09 07:39:39', 120, '', '', 10, 'SUCCESS', 904647),
('Осуществите управление роботом', 'На терминал №2 загружена инструкция по написанию программ для управления роботом и ваше первое задание. Выполните его написав код на терминале, после чего отправьте задание на проверку.', '[256, 818, 4815, 90459]', 10, 3, '2022-04-09 07:57:46', 120, '', '', 10, 'SUCCESS', 904649),
('СБ. Получите информацию о психологическом состоянии экипажа', 'Получите у ID 4838 информацию о психически нестабильных членах экипажа и наблюдайте за ними ', '[5007]', 7, 0, '0000-00-00 00:00:00', 0, '', '', 10, 'CREATED', 904650),
('Проверьте систему электроснабжения и жизнеобеспечения', 'Поступила информация что системы не функционируют в полном объеме, проведите проверку и отчайтесь о результатах', '[1163, 9753, 47744]', 10, 5, '2022-04-09 09:04:31', 60, '', '', 10, 'SUCCESS', 904651),
('Отработка навыков', 'Это задание позволяет вам отработать новые навыки, от самых простых систем - к сложным. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[4815]', 3, 0, '2022-04-09 09:56:00', 24000, '', 'mines', 5, 'SUCCESS', 904652),
('Часть 1: Перепишите алгоритм определение дистанции', 'Нужно написать обновленную версию алгоритма определения дистанции до контрольной точки 2. Задание состоит из 2 частей, сделайте это и отчитайтесь о результата.', '[256]', 10, 5, '2022-04-09 10:22:39', 120, '', 'bridges', 5, 'SUCCESS', 904653),
('Часть 2: Перепишите алгоритм определение дистанции', 'Нужно написать обновленную версию алгоритма определения дистанции до контрольной точки 2. Задание состоит из 2 частей, сделайте это и отчитайтесь о результата.', '[818]', 10, 5, '2022-04-09 10:22:39', 120, '', 'flip', 5, 'SUCCESS', 904654),
('Обеспечьте доставку поврежденного робота', 'В двигательном отсеке находится поврежденный робот. Запрограммируйте рабочего робота-погрузчика на доставку сломанного робота к аварийному отсеку, для последующей починки.\r\nЗадание и пример работы загружено на терминал 2, файл назван \"Задание2\".', '[4815, 90459]', 10, 3, '2022-04-09 10:38:25', 240, '', '', 10, 'SUCCESS', 904655),
('Отработка навыков', 'Это задание позволяет вам отработать новые навыки. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[90459]', 3, 0, '2022-04-08 19:00:00', 24000, '', 'mines', 5, 'SUCCESS', 904656),
('СБ. проведите профилактическую беседу с ID 1163.', 'ID 1163 проявляет опасные наклонности и отсутствие лояльности к системе. Проведите с ним профилактическую беседу и тщательно наблюдайте за его поведением.', '[5007]', 5, 5, '2022-04-09 10:51:00', 480, '', '', 10, 'FAILED', 904657),
('Инж. Разработать инструкцию по ТБ', 'Разработать инструкцию по технике безопасности при работе с инженерным оборудованием', '[1163]', 30, 0, '2022-04-09 12:00:50', 240, '', '', 10, 'SUCCESS', 904661),
('Отработка навыков', 'Это задание позволяет вам отработать навыки. После завершения задания вам будет начислена награда, а задание открыто заново с увеличением сложности, вплоть до максимальной.\r\nЕсли вам понадобится отточить ещё какие-то навыки, вы можете запросить задание на его отработку у Системы.', '[818]', 3, 0, '2022-04-09 12:23:00', 24000, '', 'map', 4, 'FAILED', 904662),
('Осуществите управление роботом-ремонтником', 'На терминал №2 загружено задание на управление роботом-ремонтником. Выполните его написав код на терминале, после чего отправьте задание на проверку.', '[256, 818, 4815, 90459]', 10, 3, '2022-04-09 14:18:46', 120, '', '', 10, 'FAILED', 904663),
('Инж. Электрическое поражение колонистов', 'Разберитесь в причинах электрического поражения колонистов, и устраните выявленные неисправности', '[1163, 9753, 47744]', 20, 10, '2022-04-09 15:06:57', 120, '', '', 5, 'SUCCESS', 904664),
('Инж. Неисправность в электросети', 'Провести диагностику электросети и устранить неполадку', '[1163, 9753, 47744]', 15, 10, '2022-04-09 15:58:57', 120, '', '', 10, 'SUCCESS', 904665),
('Мед. Проведение диагностики пациента', 'Мини игра на диагностику пациента', '[6822]', 10, 0, '2022-04-09 17:22:55', 80, 'phone', 'untangle', 5, 'FAILED', 904666),
('Возврат в состояние гибернации', 'Все поломки, критичные для продолжения полета, успешно устранены. Проконтроллируйте, что все колонисты вернулись в их капсулы, после чего вернитесь в свою.\r\nДо встречи на планете, где вас ждет новая жизнь!', '[5007]', 30, 300, '2022-04-09 17:00:47', 60, '', '', 10, 'FAILED', 904667);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `userId` int(11) NOT NULL,
  `authToken` tinytext NOT NULL,
  `userName` tinytext NOT NULL,
  `positionOnStarship` text NOT NULL,
  `age` int(11) NOT NULL,
  `sex` tinytext NOT NULL,
  `balance` int(11) NOT NULL,
  `background` text NOT NULL,
  `publicBackground` text NOT NULL,
  `photo` text NOT NULL,
  `securityBackground` text NOT NULL,
  `medicalBackground` text NOT NULL,
  `psychologyBackground` text NOT NULL,
  `lastAvailable` int(11) NOT NULL,
  `userSettings` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`userId`, `authToken`, `userName`, `positionOnStarship`, `age`, `sex`, `balance`, `background`, `publicBackground`, `photo`, `securityBackground`, `medicalBackground`, `psychologyBackground`, `lastAvailable`, `userSettings`) VALUES
(256, '', 'Алиса Шварц', 'Программист', 31, 'Женский', 376, '*** Причина полета ***\r\nОсваивать другие миры - мечта детства. Училась хорошо, старалась участвовать в школе в общественной жизни, чтобы при случае быть заметной. Получая высшее образование, подрабатывала, ведя детский кружок по специальности программирование. Среди школьников, у которых Алиса вела занятия было множество талантливых учеников, горящие глаза которых, вдохновляли её на дальнейшее саморазвитие. Особенно ей запомнился мальчик, которого звали Эрон, он был очень инициативный, заинтересованный и много работал для достижения своих целей.  \r\n Однако интровертность по природе призвала к более уединенной работе, и я стала программистом. Попасть в известную компанию было чистым везением, но, стремясь оправдать ожидания руководства и свои, постоянно совершенствовала навыки, посвящая всё свободное время этому..\r\nСтрашно увлечена космическими достижениями XX века.\r\nКогда объявили конкурс, не раздумывая подала свою анкету.\r\n*** Ценности, идеалы и страхи ***\r\nГлавная ценность - знание. Так же важны скиллы, практические навыки.\r\nИдеал человечности. Ради человечности можно поступиться и законом. \r\nискусство - скучная муть. Настоящие мечтатели стремятся к познанию звезд.\r\n\r\nГлавный страх был - что не возьмут, что мечта полететь не будет реализована. Ещё один страх - если ИИ получит абсолютную власть над человечеством (как в фильме \"Матрица\")\r\n*** Отношение к ИИ ***\r\nОтрицательно. Машина должна служить человеку, а не человек машине, а всё к тому может придти. Поэтому в том числе и пошла в программирование, чтобы разобраться.\r\n*** Биография ***\r\nОдной из первых прочитанных в детстве книг была книга про Алису Селезневу. Это заразило любовью к космосу, звездам, открытиям. Отсюда интерес и любовь к эпохе первого освоения космоса. Вместе с совершеннолетием сменила имя на Алису. Ещё со школы увлекалась программированием.\r\n\r\nРосла с младшим братом.\r\n\r\nРешила получить образование, чтобы стать инженером-программистом. По чистой случайности: совпало то, что освободилось место HIVE, куда пригласили научного руководителя, он не смог принять предложение и порекомендовал Алису, так она попала  в HIVE. До полета в HIVE проработала 8 лет. \r\n\r\nЛичная жизнь не интересовала, всё свободное время посвящала работе. Несмотря на то, что свободного времени было не так много, старалась по возможности избавиться от роботов в повседневном быту, оставив тех, что обеспечивают гигиену и пропитание.\r\n\r\nДрузей мало, все из университета, так как в то время заставляла себя заниматься общественной деятельностью. Именно потому, что была в этом неискренна, сохранила очень мало контактов. Сейчас старается нарабатывать профессиональные знакомства.\r\n\r\nФизически слаба, не можешь долго и эффективно заниматься физическим трудом. Игнорируешь предписания по улучшению физического состояния т.к. с людьми в группе заниматься не готова, а роботов не любишь, самостоятельно заниматься скучно.\r\n\r\nКак сотруднику Hive тебе известно, что на корабле присутствуют 2 разные системы ИИ: корабельная система, отвечающая за сам полёт, функционирование всех подсистем и так далее, а также колонизационный модуль МАТь, который должен был заработать только по прилёту, и создан для управления колонией. Корабль больше про техническое взаимодействие, а с людьми взаимодействует, выдаёт им задания, отвечает на запросы и т.д. МАТь.\r\nАварийный модуль (созданный для людей, на случай если их понадобится разбудить) в базовом варианте может поддерживать жизнь и обеспечивать существование максимум 10 человек.\r\n\r\n', 'Сотрудник HIVE, программист, возраст 31 год, не замужем, детей нет. \r\nОпыт работы в компании 8 года. За время работы проявила себя как компетентный и высокоинтеллектуальный специалист. Увлечена космосом, увлекается космическиеми достижениями 20 века.\r\n', 'https://sun9-11.userapi.com/impg/G0DAfJUNyA31P8iYxhN9-TWYN8i0HzxdZzh7PA/FloA74uiReg.jpg?size=1200x1600&quality=95&sign=a6e5a9e110647014fa84e852caee6f36&type=album', 'Сотрудник HIVE, стаж 8 лет, первое место работы.\r\nУровень лояльности к системе выше среднего, но считает, что не человек должен служить машине, а машина человеку. Ставит человечность превыше закона. \r\nНе имела нареканий во время работы на Земле.\r\n', 'Здорова. Физически слаба, не может долго и эффективно заниматься физическим трудом. Игнорирует предписания по улучшению физического состояния. Рекомендована зарядка.\r\nПатологии отсутствуют. \r\nХронических заболеваний нет. \r\nАллергий нет. \r\n', 'Интровертна, высокоинтеллектуальна и замкнута. \r\nПреобладает сфера технических интересов и умственного труда.\r\nПредпринимала попытки к повышению уровня социализации через преподавание в школьном кружке программирования в студенчестве. Главный страх - если ИИ получит абсолютную власть над человечеством.\r\nЦенит знания и практические навыки. \r\n', 1650380543, 0),
(818, '', 'Эрон', 'Программист', 26, 'Мужской', 277, '***Причина полета***\r\nСотрудник Hive, отвечает за использование корабля для обустройства после прибытия. Возраст, отличное состояние здоровья и убеждения сыграли большую роль при выборе сотрудников, которые будут участвовать в программе колонизации. Небольшой опыт работы(4 года) посчитали достаточным для действий по базовым инструкциям, остальное должен взять на себя ИИ и более опытные сотрудники. Добровольно принял участие в программе, уверенный в её успехе. В новом мире Эрон сможет достичь большего, чем в старом, с уже заполненными карьерными нишами и высокой конкуренцией.\r\n***Ценности, идеалы и страхи***\r\nЧеловек, опирающийся на знания и профессиональные навыки. До тех пор, пока их хватает для решения проблемы, иначе может опуститься и до обмана. Цель оправдывает средства, однако человеческая жизнь средством не является.\r\nКарьерист. Боится показать свою некомпетентность в работе, паникует, когда что-то идёт не по плану и нет инструкций на этот счёт. \r\n*** Отношение к ИИ ***\r\nИИ - величайшее изобретение человечества, которое решило множество проблем, с которыми люди боролись веками. Кто знает, может ИИ - это новая ступень развития человеческой расы? Сейчас же - это опора, без которой мир рухнет.\r\n*** Биография ***\r\nЕсли бы не программа колонизации, у Эрона вряд ли бы выдался шанс сохранить в истории человечества хоть какую-то информацию о себе. Не примечательная семья, не примечательные способности, непримечательная жизнь. Однако, с раннего детства Эрон увлекался программированием, и посещал соответствующий кружок при школе. В старших классах этот кружок вела студентка университета с необычным именем Алиса. Глубина её знаний и увлеченность программированием поражали Эрона настолько, что девушка стала его кумиром.\r\nУвлечение Эрона не прошло даром и привело его сначала в университет на факультет программирования информационных систем, а затем и на работу в корпорацию HIVE.\r\nВ HIVE Эрона отправили по рекомендации психоаналитического анализатора, который вывел 83% соответствия вакансии, даже несмотря на не самые высокие оценки. Даже будучи стажёром Эрон уже обгонял некоторых бывших однокурсников по зарплате и условиям работы. А после прохождения стажировки он начал зарабатывать больше, чем его родители вместе взятые! А ещё доступ к огромнейшей базе данных, лучшее оборудование, в общем Эрон влюбился в свою работу. \r\n\r\nОднако пик эмоций быстро сошёл на нет - требования корпорации соответствовали условиям. И места повыше давно были заняты более талантливыми сотрудниками, которые не спешили их покидать. К моменту объявления о программе колонизации Эрон так и не продвинулся по карьерной лестнице ни на йоту, чем был сильно раздосадован. На тот момент он уже отдалился от родителей, которые всю жизнь допекали его своей заботой и ограничивали самостоятельность. Иногда в сердцах именно их он винил в том, что они не смогли обеспечить ему лучшее образование.\r\nДрузья были...когда-то, год уже не виделись, как-то не до них. Так что у Эрон не особо долго переживал, прежде чем подать заявку на участие в программе. Был, конечно, страх неизвестности, но вряд ли в жизни ему выпадет ещё один шанс изменить свою жизнь к лучшему. Что повлияло на выбор участников Эрон не знал, да и не задумывался. Там в Новом мире он будет важен.\r\n\r\nКак сотруднику Hive тебе известно, что на корабле присутствуют 2 разные системы ИИ: корабельная система, отвечающая за сам полёт, функционирование всех подсистем и так далее, а также колонизационный модуль МАТь, который должен был заработать только по прилёту, и создан для управления колонией. Корабль больше про техническое взаимодействие, а с людьми взаимодействует, выдаёт им задания, отвечает на запросы и т.д. МАТь.\r\nАварийный модуль (созданный для людей, на случай если их понадобится разбудить) в базовом варианте может поддерживать жизнь и обеспечивать существование максимум 10 человек.\r\n\r\n', 'Сотрудник HIVE, программист, возраст 26 лет, не женат, детей нет. \r\nОпыт работы в компании 4 года. За время работы проявил себя как ответственный и амбициозный сотрудник. По прибытии на новую планету отвечает за эксплуатацию корабля и его вторичное использование.\r\n', 'https://sun9-15.userapi.com/impg/8HIWpxhsJzYha_uRtIM3KB6lKuIzzovtpNFfsQ/RauC0FFGwG4.jpg?size=1200x1600&quality=95&sign=3950eee283b9a935af5d469689388392&type=album', 'Сотрудник HIVE, стаж 4 года, первое место работы.\r\nУровень лояльности к системе высокий. \r\nНе имел нареканий во время работы на Земле\r\n', 'Здоров. Рекомендована зарядка.\r\nПатологии отсутствуют. \r\nХронических заболеваний нет. \r\nАллергий нет. \r\n', 'Амбициозен, не самостоятелен в принятии решений, ложь - крайняя мера, высоко ценит человеческую жизнь. Склонен к умственному труду в технической сфере.\r\nСлабые стороны: физический труд и область искусств. \r\nКарьерист. Боится показать свою некомпетентность в работе, паникует, когда что-то идёт не по плану и нет инструкций на этот счёт. \r\n', 1664900128, 0),
(1163, '', 'Риценко Архат Андреевич', 'Инженер', 31, 'Мужской', 355, '*** Причина полета ***\r\nОткрывающиеся перспективы и интерес к абсурдности того, что меня пригласили не смотря на открытую критику ИИ с моей стороны. Инженер.\r\n*** Ценности, идеалы и страхи ***\r\nВерю в списки, протоколы и технику безопасности, и, разумеется, считаю, что люди, которые не способны следовать инструкции, это одна из основных причин нынешнего главенствования ИИ. Людей, всячески избегающих взаимодействия с заданиями ИИ при считаю в целом позитивным явлением, поскольку подобный человек по крайней мере не представляет собой отрицательный кпд. Умеренно зануден, подсознательная боязнь микробов и грязи, с которыми я могу соприкоснуться, не перерастающая однако в серьезную патологию.\r\n*** Отношение к ИИ ***\r\nСчитаю, что в текущей вариации ИИ менее эффективен, чем теоретически возможная правильно налаженная человеческая структура управления, которая была бы более готова к нестандартным ситуациям и креативным решениям, поскольку при создании ИИ критически необходимый блок о улучшении человеческих жизней и следовании протоколам Азимова весьма пагубно сказывается на эффективности, но в виду теоретических возможностей ИИ без него нельзя обойтись. Гораздо более ограниченные теоретические возможности отдельного человека даже в случае сбоев не приведут к гибели всего человечества, соответственно как раз ограниченность теоретических возможностей каждого индивида человечества приводит суммарно к большей эффективности, чем искусственно ограниченный для безопасности ИИ.\r\n*** Биография ***\r\nРодился в семье среднего класса, отец был фанатом структурных вариаций и теоретических моделей оптимизации процессоров, чем привил глубокое отвращение к квантовой схемотехнике и молекулярной физике, граничащее разве что с их же глубоким пониманием. От строгой, вероятно слишком контролирующей матери досталось полуавтоматическое следование существующим указаниям, расписаниям и протоколам, ровно до момента осознания их несовершенства, что ведет к написанию более совершенных. \r\nРано проявившая склонность к техническим наукам и потребность занять руки определили всю дальнейшую линию жизни. Сумбурные школа и университет, проведенные в компании тщательно подобранных ИИ по психотипу детей. Бакалавриат с дипломом \"Об особенностях структуры низкоскоростных космических двигателей\", магистратура с упором в Экзотические (Эзотерические, лол :), комментарий ГМ) материалы, их гравитационные и волновые свойства. \r\nЗатем работа по поддержке функционирования сверхвысоковольтных электрических каналов, потому что шансы устроиться по специальности никакие из-за большого количества желающих, ограниченности рабочих мест и переизбытка рынка труда в рамках увеличения ИИ шансов на появление гениальных идей от людей, находящихся вне локального максимума ИИ. Неудачные отношения, длившиеся полтора года и оборвавшиеся так же резко, как и начавшиеся. Её звали Кейли Даррел, вы познакомились с ней во времена университета, она училась на психолога курсом младше. Вы много дискутировали о месте ИИ в жизни общества, его психологии и различии в “мышлении” с людьми. Однако, со временем, ты понял, что её взгляды не столь широки, она мечтала о семье, известности и признании в научном сообществе. Ваши цели в жизни различались, и вы расстались. Глубокое презрение к изначально идейно близким кампаниям, выступающим противником ИИ, потому что все разговоры о том, что можно изменить, сводились либо к глубоко теоретическим философским рассуждениям, либо к предложениям о физическом/программном разрушении ключевых систем, обеспечивающих работу ИИ, что не только варварский способ решения задачи, но еще и изначально обреченный на провал.\r\nНесколько лет работы инженером на орбитальной станции, с задачами варьирующимися от починки тостеров до замены лампочек, потому что критически важными заданиями занимаются специальные роботы. Искусство циклично, и после окончания рабочего цикла на орбитальной станции более двух лет было посвящено увлечению абстракционизмом и буддизмом, набирающим моду. \r\nПоследние несколько лет старший инженер на термоядерной электростанции, основная обязанность которого заключалась в том, чтобы следить, что алгоритмы и роботы стабильно никогда не ошибаются, каждый раз ожидая ошибки. Затем, наконец, приглашение в проект колонизации от Hive, по прилёту предполагалось, что будет старшим инженером на энергоблоке новой планеты.\r\n', 'В прошлом старший инженер на термоядерной станции, возраст 31 год, не женат, детей нет. \r\nОгромный опыт работы в инженерной сфере, имел опыт работы в космосе (орбитальная станция). За время работы проявил себя как слегка занудный, но отлично знающий свою работу специалист, был лично приглашен в программу колонизацию. Увлекается абстракционизмом и буддизмом, имеет необычное, отличающееся от общепринято мнение о месте ИИ в жизни общества.\r\n', 'https://sun9-18.userapi.com/impg/if6GK0Wcr56CYuBogog3uethnpyICR4DUGCX5g/EQqOkDB7h4M.jpg?size=1200x1600&quality=95&sign=cbf4d7487cdd9bef10598b55d8e2a2b2&type=album', 'Работал на многих ответственных должностях, отличается исполнительностью и ответственным подходом к работе. Ценный специалист, получил личное приглашение в программу колонизации. Не имел нареканий по работе за время трудовой деятельности. \r\nУровень лояльности к системе высокий, однако был замечен в кругу лиц с экстремистским мировоззрением и открыто критикует власть ИИ. Требуется повышенное внимание.\r\n\r\n', 'В данный момент здоров, проходил реабилитацию после долгого нахождения на орбите. Рекомендована зарядка и регулярные проверки состояния здоровья.\r\nПатологии отсутствуют. \r\nХронических заболеваний нет. \r\n', 'Умеренно зануден, подсознательная боязнь микробов и грязи, не перерастающая однако в серьезную патологию. Предпочитает придерживаться правил и инструкций, пока считает их эффективными. Негативно относится к роли ИИ в жизни общества, ценит человечество в целом выше человеческой жизни. Выработанная тревожность по отношению к Системе. Склонен к техническому труду.\r\nСлабые стороны: физический труд.\r\n', 1649523690, 0),
(1739, '', 'Кит Эдингтон', 'Программист', 37, 'Мужчина', 9999, 'СЕЗ', 'В прошлом программист дочерней компании Hive, возраст 37 год, не женат, детей нет. \r\nБольшой опыт в разработке разнообразных систем жизнеобеспечения. Хобби - написание прозы. Приятен в общении, любит женщин и вино. Отличается широкими взглядами на мир, и не отвергает альтернативных точек зрения.\r\n', 'https://sun9-30.userapi.com/impg/ATnmKjDogH82Ny2gYMqFn1kJihR0WNCm0PlAGg/uChEAqWYCls.jpg?size=1196x1600&quality=95&sign=92cb9b80bfac5937725e7a2f422fa7b8&type=album', 'В прошлом работал на компанию, дочернюю Hive. Нареканий в работе не имеет, стаж работы 7 лет. Единожды был замечен на митинге \"Сторонников единой Земли\", но не являлся его организатором. Его дед участвовал в разработке подсистемы аварийного модуля, лёгшей в основу этого корабля.\r\nУровень лояльности к системе высокий. ', 'Здоров, сделано протезирование ноги.\r\nИмеет редкое наследственное генетическое заболевание, мешающее восстановить ногу. Рекомендована зарядка.\r\nПатологии отсутствуют. \r\nХронических заболеваний нет. \r\nАллергий нет. ', 'Психических заболевание нет. Имеет склонность к умственному труду в технической области. Общительный, высокая психологическая устойчивость, харизматичен, высокий эмоциональный интеллект. Ведет личный дневник.\r\nСлабые стороны: физический труд.', 1649756426, 0),
(4815, '', 'Кристи Шац', 'Программист', 26, 'Женский', 333, '*** Причина полета ***\r\nХотелось новых впечатлений, а также вырваться от опеки семьи. \r\n*** Ценности, идеалы и страхи ***\r\nАктивность, прогресс, знания и азарт. \r\nКрах мировой сети\r\nКак ваш персонаж относится к тому, что *** Отношение к ИИ ***\r\nПоложительно. Т.к решения ИИ самые беспристрастные и алгоритмы ИИ никогда не подвоядт, они не подвержены различным эмоциям. \r\n*** Биография ***\r\nРодилась в семье гейм-дизайнера и программиста. У родителей была своя небольшая фирма по производству компьютерных игр для виртуальной реальности, поэтому с детства девочка была с программированием на “Ты” и любовь к программированию впитала сполна. \r\nУчеба давалась очень легко, вероятно, сказалось влияние родителей, из-за этого девочке временами было скучно во время учебы. Что-бы немного развеять скуку посещала посещала кружок андроидотехники. К пятнадцати годам собрала своего первого андроида и даже написала для него ИИ. \r\nК сожалению, не все так радужно было в жизни Кристи. Ей не повезло унаследовать от бабушки аллергию на холод: при температуре ниже 0 по цельсию кожа Кристи краснела и начинала шелушиться, что причиняло дискомфорт, а иногда и боль.  Из-за этого недуга  семья Кристи всегда пыталась жить теплом климате всячески оберегая девочку. \r\nШколу закончила экстерном, но поступать в университет не торопилась, т.к. работать в фирме родителей она могла и так, а чем ей самой было интересно заниматься Кристи таки не могла определиться….\r\nКристи тяготил тот факт, что семья её все время оберегает, и, что ничего нового в её жизни не происходит, и, что бы избавиться от опеки родителей, а также охотясь за новыми впечатлениями Кристи решила отправиться в путешествие к далекой планете, не сообщив об этом семье…  \r\n', 'Безработная. Родители - владельцы компании про производству VR-игр. \r\nНе замужем, детей нет\r\nХороший уровень знаний в программировании и андроидотехнике.\r\nЛюбопытна, высокоэрудированная. \r\n', 'https://sun9-18.userapi.com/impg/BjECUUqEzV3fYWQgjS1JmahRhT38O4asLGLMxw/RuU4isaCPkM.jpg?size=1200x1600&quality=95&sign=411e35124288306a4c5918a49d3e2e1e&type=album', 'Безработная, семья владеет компанией в игровой индустрии (разработка игр для VR), некоторое время работала семейной компании. \r\nУровень лояльности к системе ниже среднего\r\nОтправилась в полет без ведома семьи. \r\nВ противозаконной деятельности не замечена\r\n', 'Аллергия на холод. Противопоказано нахождение при температуре ниже 0С.\r\nРекомендована зарядка.\r\n\r\n', 'Инфантильна, любопытна, ценит знания и новые впечатления. \r\nСильные стороны: сфера технических интересов и сфера умственного труда\r\nСлабые стороны: работа с людьми, сфера физического труда.\r\n', 1649524845, 0),
(4838, '', 'Кейли Даррел', 'Психолог', 30, 'Женский', 262, '*** Причина полета ***\r\nКейли увидела рекламный ролик, после которого поняла, что вот ее шанс быть по-настоящему нужной и удовлетворить свои профессиональные амбиции. Считает, что на Земле её деятельность недостаточно оценена, а на новой планете в новых условиях она сможет создать уникальную научную работу и тогда-то уж её оценят по достоинству. Муж и ребенок Кейли также летят вместе с ней, т.к. она сумела убедить мужа, что у них будет больше возможностей и свободы.\r\n*** Ценности, идеалы и страхи ***\r\nГлавные ценности: семья, безопасность, свобода в исследовательской деятельности. Хочет известности, признания своих заслуг, хочет создать нечто уникальное, оставить след в истории. Кейли нравится работать с людьми, изучать их, искать общее и то, что делает каждого уникальным, нравится испытывать чувство удовлетворения, когда она помогает пациентам, когда те благодарят её и тд. Страшится одиночества и того, что её жизнь может оказаться бессмысленной, что её реальный вклад в науку ничтожно мал, что помощь пациентам недолговечна и всего лишь их иллюзия.\r\n*** Отношение к ИИ ***\r\nПоложительно. Она всегда так жила и не мыслит другого образа жизни. В подростковые годы бывало, что считала решения ИИ несправедливыми, но родители быстро убеждали её в обратном и вскоре она просто перестала об этом думать. Считает, что благодаря ИИ она в безопасности и занимается тем, чем должна заниматься и где действительно может принести пользу. Кроме того, ИИ подобрал ей идеального спутника жизни с помощью своих алгоритмов, чем она тоже довольна. Считает, что ИИ - благо для человечества.\r\n*** Биография ***\r\nКейли родилась в семье библиотекаря и медсестры. Всегда была смышленой и послушной девочкой, особых проблем в семье не доставляла. \r\nПо окончании школы была направлена ИИ на психологический факультет, учеба ей понравилась, училась прилежно, в отличие от некоторых сокурсников почти не участвовала в развлечениях и вечеринках, но несмотря на всё усердие, её работы оказывались достаточно посредственными, преподаватели хвалили её, но каких-то особенных успехов Кейли не достигла. \r\nКогда ты училась в университете вы познакомились с Риценко Архатом, студентом на год старше, учившимся на инженера. Он поразил тебя широтой своих взглядов, незаурядным умом и очень нестандартным мировоззрением. Ты не встречала ранее столь отличающихся от нормы людей. Вы начали встречаться, однако, со временем, ты поняла что ваши ценности отличаются: ты хотела семьи, стабильности и признания в обществе, а его интересы были в работе, и философских беседах о том, что люди могли бы управлять обществом более эффективно чем ИИ. Провстречавшись 1.5 года вы расстались.\r\nПо окончании института устроилась на работу с помощью распределительного центра ИИ в кризисный центр поддержки молодых матерей и отцов, часто брала ночные смены и дежурства на телефоне доверия. \r\nКейли завидовала сокурсникам, которые вели научные исследования или поступили в аспирантуру (ей такой возможности даже не предложили). Начала самостоятельно писать статьи, но их часто отказывались публиковать или публиковали в некрупных изданиях. \r\nПо достижении двадцати пяти лет ИИ рекомендовал ей вступить в брак. Кандидат, подобранный программой, оказался идеально подходящим, Кейли счастлива в браке. Через год она родила ребенка (с помощью ИИ удалось выбрать из нескольких эмбрионов самого здорового, красивого и нужного пола) и еще через пару лет, несколько пресытившись размеренной семейной жизнью, стала думать о том, что хочет чего-то достичь в карьере и реализоваться как ученый. В это время ей на глаза попалась реклама ХайвСистем, Кейли воспряла духом и поняла, что ей необходимо попасть в программу.\r\n', 'Психолог, ранее работала в службе “телефон доверия”, возраст 30 лет, замужем, один ребёнок.\r\nПубликовала научные статьи на психологические темы. Целеустремленная, любит помогать людям, добродушная и сговорчивая.\r\nГлубокие познания в семейной психологии.\r\n', 'https://sun9-18.userapi.com/impg/Nn-33liO9KkwEgVrjr05Zhe_rPgNl0tscqPerA/SA4vBBnmkOo.jpg?size=1200x1600&quality=95&sign=d732367229c368eb177a615dee3b714b&type=album', 'Большой опыт работы с людьми, в том числе их поддержка в кризисной ситуации.\r\nУровень лояльности к системе высокий.\r\nЛетит вместе с мужем и ребёнком.\r\nНе имела нареканий по работе за время трудовой деятельности. ', 'Здорова, рожала.\r\nПатологии отсутствуют. \r\nХронических заболеваний нет. \r\nАллергий нет. \r\n', 'Высоко развит навык работы с людьми, склонность к умственному труду. Предпочитает придерживаться правил и инструкций. Высокий уровень доверия к решениям ИИ. В приоритете семья и профессиональные амбиции.\r\nУстойчивая психика.\r\nСлабые стороны: технические навыки.\r\n', 1649778041, 3),
(5007, '', 'Атис Максвелл', 'Специалист службы безопасности', 35, 'Мужской', -126, '*** Причина полета ***\r\nВ прошлом Атис занимался добычей информации и продажей её на \"черном рынке\". Однако, его поймали и дали выбор: либо Атис работает на государственную службу безопасности и помогает им пресекать взломы таких же \"воришек\", либо его сажают в тюрьму. Атис выбрал первое. Однако, жизнь \"под колпаком\" ему надоела и он увидел шанс вырваться из неё с помощью программы колонизации. \r\n*** Ценности, идеалы и страхи ***\r\nАтис ценит свободу, возможность выбора. Особых страхов нет. \r\n*** Отношение к ИИ ***\r\nВ целом нейтрально. Он знает и понимает почему человечество пришло к такому решению. Он считает, что некоторым людям такой \"надзор\" даже полезен и в целом это несет благо. Но так же Атис считает, что из любых правил должны быть исключения. \r\nАктивно против ИИ не выступает, но предпочитает полагаться на свой собственный ум. \r\n*** Биография ***\r\nМожно сказать, что семья Атиса стояла у истоков сегодняшнего миропорядка. Его прадед и дед были ведущими программистами в проекте по поддержанию работы ИИ МАТь, когда только было принято решение о том, что отныне во главе Единого государства будет поставлен ИИ. \r\nДедушка часто рассказывал маленькому Атису, почему такой миропорядок полезен и каких катастроф он может помочь избежать. И какое светлое будущее может ждать человечество под таким руководством. \r\nК несчастью, когда мальчику было 12 лет его дедушка неожиданно погиб в возрасте 83-х лет. У него прихватило сердце прямо на работе. Это было ударом и неожиданностью для всей семьи, потому что сегодня 83 года это совсем не возраст, а от сердечных приступов давно научились эффективно спасать. Да и на здоровье дедушка не жаловался, а результаты медосмотра всегда были в норме. \r\nВ 16 лет, перебирая старые документы, Атис нашел записи своего деда, его дневники и рабочие заметки. В них была информация об архитектуре ИИ, её слабостях и методах их защиты, а так же заметки о том, как эту защиту можно обойти. Мальчика сильно заинтересовали эти записи и он погрузился в их изучение и даже попробовал применить пару алгоритмов для обхода систем безопасности ИИ. Он смог проникнуть в архив и нашел там записи о том, что на самом деле произошло с его дедом. Оказалась, что это была спец операция для того, что бы убрать тех, кто слишком много знает о слабостях ИИ, однако, информации о том, кем именно была эта операция спланирована Атис не нашел.\r\nДалее он продолжил время от времени проникать в систему, находить там интересную информацию и продавать её на \"черном рынке\". Он считал, что проникнув на \"черный рынок\" он сможет выяснить, чем был отравлен его дед и через это выйти на виновников его смерти. \r\nОднако, при очередном проникновении в базы данных ИИ действия Атиса были замечены государственной службой безопасности и он был пойман. Но таланты и знания Атиса были оценены по достоинству специалистами службы безопасности и Атису предоставили выбор: или он отправляется в тюрьму или он работает на службу безопасности и помогает им отлавливать таких же \"воришек\". Атис выбрал второй вариант и на протяжении десяти лет работал на службу безопасности. В ходе его службы его привлекали не только к работе с компьютерными системами, но и к работе с людьми, т.к. Атис обладал неплохой харизмой и мог легко наладить контакт с человеком и разговорить его. \r\nОднако, со временем Атису это надоело и он решил испытать судьбу в другом мире…\r\n', 'Работал в государственной службе безопасности, возраст 35 лет, не женат, детей нет.\r\nДед и прадед поддерживали системы ИИ на этапе её становления. \r\nКоммуникабельный легко находит язык с людьми, харизматичен. \r\n', 'https://sun9-1.userapi.com/impg/m2D3IOtd_YVY7DJxqHfh7d_fskLcW96ZhfCNGA/Is4BQyaza2M.jpg?size=1200x1600&quality=95&sign=1c8e85097b6f58c14ecea7e4faef1c8d&type=album', 'Работал на государственную службу безопасности в департаменте IT-преступлений. \r\nНе имел нареканий по работе за время трудовой деятельности. \r\n\r\nУровень лояльности к системе ниже среднего.\r\nАктивно против ИИ не выступает, но предпочитает полагаться на свой собственный ум. \r\n10 лет назад был замечен в торговле на “Черном рынке”.\r\nТребуется повышенное внимание.\r\n', 'Хронических заболеваний нет.\r\nПатологии отсутствуют. \r\nАллергия на шерсть. \r\nВ анамнезе: смерть деда, по причине сердечного приступа (достаточно большая редкость для нашего мира, комментарий МГ). \r\n', 'Устойчивая психика. \r\nПотерял деда в возрасте 12 лет (скоропостижная смерть, были теплые отношения)\r\nПреобладает сфера работы с людьми и умственного труда. \r\nСлабые стороны: сфера искусств и материальные интересы. \r\n', 1649578243, 1),
(6822, '', 'Рэндл Сурайн Рекс', 'Медик', 35, 'Мужской', 283, '****Причина полета***\r\nРэндл потратил огромное количество сил, времени и ресурсов, чтобы увеличить свои шансы на попадание его в программу колонизации. Его и его невесте Сайтарии.\r\n*** Ценности, идеалы и страхи ***\r\nРэндл видит величие человечества в единении и общем стремлении к цели. Он не отрицает, ценность человечности и находчивости человеческого разума, над ИИ, но считает, что именно единый ИИ, у власти сможет удержать объединенное человечество от саморазрушения. Рэндл считает очень ценной каждую человеческую жизнь, даже несмотря на перенаселение земли. Больше всего его пугает, что всё это объединение человечества окажется только ширмой для каких то ужасных дел, сорвется по неведомой причине или просто окажется ошибкой. А так же, он очень боится, что вскроется его секрет о Сайтарии...\r\n*** Отношение к ИИ ***\r\nРэндл определенно прагматик. И как прагматик он видит пользу в объединении человечества и единой власти, не подверженной порокам. Возможно, ему бы хотелось, что бы давалось чуть больше свободы, но он боится, что это в какой то момент может выйти из под контроля и привести к падению, и деградации человеческой расы.\r\n*** Биография ***\r\nОбычное детство, взросление и учеба. \r\nЗакончил медицинский институт. После университета - только диплом, никаких особых достижений и перспективное направление медицины с уклоном в импланты. Однако, его талант раскрылся не по его воле. Они с невестой, пару дней назад обручившихся - попали под обычное решение уравнения ИИ. Кто ценнее, пара молодых людей не успевавших уйти с пути движения автобуса, у которого отказали тормоза или 47 детей в возрасте от 6 до 8 лет находившихся в этом самом транспорте. Рэндлу повезло - краем глаза он успел заметить опасность. Он даже быстро среагировал, увлекая за собой Сайтарию в сторону от столкновения. И не повезло, потому что Сайтария не успела... Несущаяся на огромной скорости туша транспорта задела её только по касательной, но этого хватило, чтобы нанести ей повреждения несовместимые с жизнью. Он был медиком. Он всё понимал, стоя на коленях у её изломанного тела. Она была еще в сознании. Возможно сломанный позвоночник не доносил до её мозга сигналы о боли. Может быть её мозг просто отказывался воспринимать произошедшее. Но она лишь тепло улыбалась, глядя на него и пыталась коснуться пальцами ссадины на его колене. Рэндл никогда не мог объяснить сам себе, как так получилось дальше. Но, каким то образом, до её смерти он смог перенести её личность из тела на цифровой носитель через нейроинтерфейс.   И долгие годы он пытался перенести эти данные в искусственное тело, что бы Сайтария снова могла жить. Он достиг определенных успехов, но на это уходило все больше времени, ресурсов, знакомств. И ему начало казаться, что своими действиями он начинает привлекать излишнее внимание к своей личности. Ему точно нужно было убраться с Земли куда то подальше…\r\nИнтересуясь темой переноса сознания ты участвовал в различных научных конференциях и искал что-то новое что сможет тебе помочь с проблемой, уже как состоявшийся специалист. Там ты познакомился с Гросом, студентом из роботехнического университета. Молодых людей увлекла тема переноса сознания человека в тело андроида. Некоторое время они совместно пытались развивать эту тему, но постоянно сталкивались с сопротивлением со стороны научного сообщества и в итоге тема сошла на нет, но дружбу ребята сохранили и продолжили общаться после университета, пока год назад Грос не оборвал все контакты, что для Рэндела стало неожиданностью….\r\n', 'Не женат, детей нет. Закончил медицинский университет, основное направление деятельности - протезирование и установка имплантов.  \r\nУчаствовал в различных научных конференциях. \r\nУравновешен, спокоен, ответственен.\r\n', 'https://sun9-61.userapi.com/impg/9l-P0BgM1J7m1QXzBeMYvrBLORQUscl4rFkWvg/6fil_hwJq_4.jpg?size=1200x1600&quality=95&sign=169c4c8278dbd1fee1179c55eef4535a&type=album', 'На Земле был знаком с Гросом, который был замечен в деятельности организации АНТИМА, но за год до полета контакты были разорваны по инициативе Гроса. \r\nПотерял невесту в автокатастрофе.\r\nУровень лояльности к системе - низкий.\r\nВ деятельности экстремистских организаций не замечен, однако проявлял повышенный интерес к технологии Андроидов.  \r\n', 'Физически здоров.\r\nАллергии нет\r\nПатологий нет\r\n', 'Потерял 10 лет назад невесту в автокатастрофе, тяжело переживал потерю, вероятно, все ещё не справился с травмой. \r\nСильные стороны: превалирует сфера умственного труда, технических интересов и сфера работы с людьми. \r\nСлабые стороны: сфера искусств (слабое абстрактное мышление)\r\n', 1649527976, 2),
(9753, '', 'Грос', 'Инженер', 33, 'Мужской', 310, '*** Причина полета ***\r\nНе было причин оставаться на Земле\r\n\r\n*** Ценности, идеалы и страхи ***\r\nЦенности, идеалы и страхи вашего персонажа\r\nОдиночество, возможность максимально погрузиться в работу, применить себя, принести пользу. \r\nБоится погружаться в воспоминания прошлого, особенно смерти его близких. Старается максимально себя оградить от этого и меньше коммуницировать с другими людьми, из-за чего при общении с другими груб и ворчлив\r\n\r\n*** Отношение к ИИ ***\r\nБезразличен\r\n\r\n*** Биография ***\r\nГрос родился в большой семье деятелей искусств. Мама была известной актрисой, снималась во многих кассовых фильмах. Отец - был режиссером, в фильмографии которого было несколько фильмов принесших ему мировой успех.\r\nТак же у Гроса были две младшие сестренки-близняшки, что для современного мира - большая редкость. Сам Грос интереса к искусству не проявлял. В детстве любимым занятием мальчика была сборка роботов, которые не имели прикладной ценности, но были очень забавные и просто веселили сначала маму Гроса, а потом и двух младших сестричек.\r\nВ сестрах Грос души не чаял, для них он был готов сделать все, что угодно.  \r\nКогда настало время определяться со своей будущей профессией Грос прошел тест на профориентацию, который выявил склонность к умственной деятельности и техническим интересом. ИИ рекомендовала ему поступать в университет на робототехника. Так он и сделал. \r\nУчеба давалась легко и увлекала молодого человека.\r\nКазалось, что жизнь Гроса складывается удачно. У него любящая семья, востребованная специальность и есть хороший друг, на которого можно положиться, но в один день все резко изменилось. \r\n\r\n\r\nЭто был день премьеры фильма - совместной работы его матери и отца новый 3D фильм, посвященный историческим событиям 21 века, это была история двух молодых людей, которые боролись за право высказывать свободно своё мнение.\r\nВо время показа фильма кинотеатр был захвачен группировкой АНТИМА, а все гости показа оказались в заложниках. Это был эксклюзивный закрытый показ, на котором было немного гостей, поэтому правительством было дано добро на штурм. Вследствие этого штурма террористы расстреляли всех заложников. Семья Гроса погибла. Сам Грос чудом выжил, но получил тяжелые ранения, его доставили в больницу, врачи сделали все, что было в их силах и смогли спасти Гроса. К сожалению, спасти его семью не удалось, погибли родители и, к ужасу Гроса, две его младшие сестренки.  Ранения также не прошли бесследно. Пули сильно задели печень и врачи решили её заменить имплантом. Это не мешает жить, но изредка требует  диагностики на предмет корректного функционирования и замены сменных фильтров. \r\nПосле этого случая Грос стал замкнутым и необщительным - это был его способ справиться с травмой. При общении обычно очень груб и ворчлив, отдалился от всех своих друзей и знакомых. Желание к жизни в нем постепенно угасало, все, что происходило в мире так или иначе напоминало ему о трагедии и поэтому Грос в итоге принял решение покинуть планету в составе группе колонистов, т.к. на Земле его больше ничего не держало.\r\n\r\n\r\n\r\nНа пятом курсе на конференции посвященной андроидам, робототехнике и искусственному интеллекту в современной жизни Грос познакомился со студентом медицинского университета Рэнделом Сурайн Рексом. Молодых людей объединил общий интерес к теме перенесения сознания человека в тело андроида. Однако, это была очень не простая тема с точки зрения этики и ребятам нелегко давались исследования. В большинстве случаев профессора университетов старались всячески отговорить Госа с Рэнделом заниматься этой темой. В конечном итоге рвение молодых людей поутихло, но дружбу ребята сохранили и после университета. Год назад, после трагедии, на нервах, ты оборвал с Рэнделом все контакты.\r\n', 'Не женат, детей нет. \r\nЗакончил университет по специальности робототехника. \r\nПринимал участие в научных конференциях.\r\nПотерял семью в теракте АНТИМЫ.\r\n', 'https://sun9-79.userapi.com/impg/refBnq1qvJNpj6ghjeBF_dl_e_Srb-EGul8GVQ/yWTwraHA-po.jpg?size=1200x1600&quality=95&sign=ecdbb23611385a1a9fc48f2ba737685a&type=album', 'Год назад потерял семью в теракте АНТИМЫ\r\nПринимал участие в деятельности АНТИМЫ (другое крыло)\r\nНизкий уровень лояльности к системе. \r\n', 'Год назад получил серьезное ранение в теракте. \r\nВ ходе операции была заменена печень, поставлен имплант, который требует диагностики и замены фильтров.\r\n', 'Год назад потерял семью в теракте АНТИМЫ, тяжело переживает это. \r\nЗамкнулся в себе после этого случая, оборвал контакты со всеми друзьями и знакомыми.\r\nСильные стороны: сфера технических интересов и сфера умственного труда.\r\nСлабые стороны: Сефера искусств (слабое абстрактное мышление) и сфера физического труда.\r\n', 1649577981, 0),
(47744, '', 'Артур', 'Инженер', 23, 'Мужской', 315, '*** Причина полета ***\r\nПрограмма колонизации хороший шанс проявить себя и поучаствовать в Великом деле. Наудачу подал заявку. Повезло. Приняли \r\n*** Ценности, идеалы и страхи ***\r\nЦенит в людях самостоятельность, деятельность, ум, честность. \r\n*** Боится беспомощности, боли, змей. \r\nОтношение к ИИ ***\r\nТерпимо. Привык к этому, но ждёт большей самостоятельности в будущем.\r\n\r\n*** Биография ***\r\n\r\nРодился в семье инженеров HIVE. Родители честные рабочие люди искренне увлеченные своим делом, трудились на одной из фабрик хайв, которая занималась производством деталей для корпусов космических кораблей. \r\nРодители не настаивали, чтобы Артур шел по их стопам, они предоставили мальчику полную свободу выбора.  \r\nОднако, такая свобода имела свои недостатки. Во времена школы Артур связался с компанией спортсменов-экстремалов и увлекся экстремальными видами спорта. Особенно Артура привлекали прыжки с высоты, и он всерьез увлекся стратоджампингом (прыжки из стратосферы в специальном скафандре). Родители были в шоке, но видя как горят глаза их сына, поддерживали его в этом увлечении. \r\nПосле школы Артур пошел учится в университет по специальности “Проектировщик систем жизнеобеспечения”, учета давалась не просто, но своё увлечение Артур не забросил. \r\nВо время одного из прыжков что то пошло не так:  основной парашют после входа в атмосферу не раскрылся и пришлось задействовать запасной - это были критические потери времени, парашют раскрылся поздно, Артура резко подхватил поток восходящего воздуха, из-за чего его сильно тряхнуло и Артур получил повреждение шейного отдела позвоночника, и его отнесло на 10 км дальше, чем предполагаемое место приземления. Но Артур выжил, его благополучно нашли и доставили в больницу, в больницу его обследовали на сколько возможно вылечили поврежденные позвонки, но травма имела свои последствия: при длительном перенапряжении начинают мучить мигрени, к сожалению, с этим медицина так и не смогла справиться, т.к. вся диагностика говорит, что всё в порядке. \r\nНо травма не помешала Артуру закончить обучение, но с экстремальными видами спорта он решил завязать, однако, его жажда приключений никуда не делась, поэтому, когда родители рассказали про программу колонизации Артур решил подать заявку на участие в программе ведь это отличный шанс принести пользу, получить новые ощущения и проявить себя.\r\n', 'Закончил университет по специальности “Инженер систем жизнеобеспечения”.\r\nВозраст 23.\r\nУвлекается экстремальными видами спорта. \r\nОткрытый, честный, прямолинейный, активный.  \r\nНе женат, детей нет.', 'https://sun9-36.userapi.com/impg/bgFBWaVv1mXM1cIcCPm5Wn-3e0X4seHREbSgcg/U_1qneAjOvk.jpg?size=1200x1600&quality=95&sign=fefd06c3fba3f484fde8b0960015231e&type=album', 'Безработный. Окончил университет и подал заявку на участие в программе колонизации. \r\nРодители - сотрудники HIVE.\r\nНизкая лояльность к системе, но в участии в экстремистских организациях или в совершении противоправных действиях не замечен. \r\nНесколько лет назад принимал активное участие в группе экстремальных спортсменов - занимался стратоджампингом (прыжки из стратосферы) \r\n', 'На текущий момент физических травм нет.\r\nВ прошлом получил повреждение шейного отдела позвоночника при прыжке из стратосферы. Страдает мигренями при перенапряжении.\r\nРекомендован отдых раз в 4 часа. \r\n', 'Любит экстрим (возможно зависимость от адреналина).\r\nСильные стороны: склонность к умственному труду, превалирует сфера материальных интересов.\r\nСлабые стороны: сфера физического труда и сфера искусств (не развитое абстрактное мышление). \r\nЛегковозбудимый. \r\n\r\n', 1649614214, 0),
(90459, '', 'Ивори Стоун', 'Программист', 25, 'Женский', 349, '*** Причина полета ***\r\nПримерно за год до запуска программы колонизации, один из ведущих сотрудников корпорация HIVE, увлеченный своими мыслями, случайно сбивает на собственном автомобиле спортсменку-стрелка Ивори Стоун. В результате аварии получает тяжёлые травмы кистей рук, которые не удается полностью восстановить. Спасибо современным технологиям - в быту этого практически незаметно, но на спортивной карьере частично погибшие нервные окончания и мелкий тремор ставят крест. Желая искупить вину перед девушкой, сотрудник решает пригласить её в новый проект своей корпорации и проследить, чтобы прохождение отбора оказалось успешным. \r\n*** Ценности, идеалы и страхи ***\r\nСамосовершенствование, наладка собственного организма - внутренне и внешне - как сложного точного прибора, стремление всегда и во всем быть первой - всё это разбилось вдребезги вместе с той аварией. Все, что раньше представляло цель, смысл и сок жизни ушло в небытие, мир вокруг покрылся серой равнодушной дымкой. Самый главный страх стал реальностью, старые ценности и идеалы уже не имеют смысла, а новых пока не завезли. \r\n*** Отношение к ИИ ***\r\nНеоднозначно. С одной стороны, описанный в исторической литературе старый мир похож на фильм ужасов, а у нас сейчас всё прекрасно, благодаря ИИ. Кому в здравом уме придет в голову ломать этот практически совершенный мир? С другой же - ей до конца не верится, что что-то, созданное людьми, может быть разумнее самих людей. И даже самый совершенный робот - может сломаться. \"Всё могло бы быть лучше, могло бы быть проще, могло быть по-человечески...?\"\r\n*** Биография ***\r\n... По квотам на деторождения тех годов семье полагался только один ребенок. Папа очень хотел мальчика, но родилось то, что родилось - вернуть или поменять нельзя, пришлось растить, что дали. Результат вышел соответствующий - пока сверстницы играли куколками и плюшевыми зайцами, Иви закидывали машинками, роботами и пистолетами. Последние вызывали у нее особый интерес - особенно те, которые натурально пахли порохом и издавали громкий хлопок. Лет в семь её отдали на секцию спортивной стрельбы - дисциплину, которая уже утратила весь свой прикладной смысл в современном мире, но на спортивные соревнования собирала огромное количество зрителей. Почти всю свою сознательную жизнь она занималась спортом - сначала детские сборы, старты и разряды, затем юношеские - здесь года на полтора случился перерыв из-за влюбленности в мальчика, занимающегося скрипкой. Она резко вспомнила, что девочка, перелезла из любимых камуфляжных штанов в платья и юбки и упоролась в обучение игре на флейте - один в один повторять инструмент за предметом страсти ей показалось перебором. Соседи стрелялись, родительская собака проявила недюжинные таланты в художественном вое, найденный преподаватель тихонько плакал после занятий, но она не сдавалась. Мальчик при ближайшем рассмотрении оказался не таким прекрасным, как ей поначалу показалось и флейта была заброшена, к бурной радости всех под неё попавших. Помотавшись еще год по различным другим подростковым увлечениям, она в итоге снова вернулась на полигон и продолжила спортивную карьеру. \r\nКМС по спортивной стрельбе.\r\n\r\nА в 24 года вся ее жизнь оборвалась. По крайней мере, ей так казалось и кажется до сих пор. Авария лишила её той меткости и точности рук, которые раз за разом приносили ей победы и новые спортивные контракты. Предложение поучаствовать в программе колонизации сначала было воспринято как издевательство, а потом.. ей стало все равно. Убивать себя - глупо. Жить дальше - не имеет смысла. Впасть на долгое время в анабиоз в камере? Отличный план. По крайней мере, все эти тормошащие меня люди от меня наконец отстанут. Весь последний год прошел, как в тумане, включая отбор и подготовку. \"Ничего не хочу решать. Я подумаю об этом завтра, когда проснусь\"', 'Безработная, КМС по спортивной стрельбе, возраст 25 лет, не замужем, детей нет.\r\nЦелеустремлённая, спортивная, умеет играть на флейте. Год назад попала в аварию, которая помешала дальнейшей спортивной карьере.\r\n', 'https://sun9-18.userapi.com/impg/jK1RiRDlQF8aUO-cWkQRzlaSYInQ-UZqD1pt4Q/J_25voYbLHA.jpg?size=1200x1600&quality=95&sign=2e6c4d3cd94ce47c616a32a01f0f4e70&type=album', 'Отличные навыки обращения со стрелковым оружием. \r\nПримерно за год до вылета была сбита на автомобиле высокопоставленным сотрудником Hive.\r\nУровень лояльности к системе ниже среднего.\r\n', 'За год до вылета попала в аварию и получила тяжёлые травмы кистей рук, которые не удается полностью восстановить. \r\nПатологии отсутствуют. \r\nАллергий нет. \r\n', 'Находится в депрессии из-за прекращения спортивной карьеры (последствие аварии). Не видит цели и смысла в жизни. \r\nВ прошлом гиперактивная, легко увлекалась чем-то новым, но к большинству занятий быстро охладевала.\r\nСильно развита сфера физических интересов, на втором месте техническая сфера\r\nСлабые стороны: сфера искусств.\r\n', 1664866813, 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `hv1sys_conversations`
--
ALTER TABLE `hv1sys_conversations`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Индексы таблицы `hv1sys_failed_jobs`
--
ALTER TABLE `hv1sys_failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `hv1sys_failed_jobs_uuid_unique` (`uuid`);

--
-- Индексы таблицы `hv1sys_messages`
--
ALTER TABLE `hv1sys_messages`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Индексы таблицы `hv1sys_migrations`
--
ALTER TABLE `hv1sys_migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `hv1sys_model_has_permissions`
--
ALTER TABLE `hv1sys_model_has_permissions`
  ADD PRIMARY KEY (`permission_id`,`model_id`,`model_type`),
  ADD KEY `model_has_permissions_model_id_model_type_index` (`model_id`,`model_type`);

--
-- Индексы таблицы `hv1sys_model_has_roles`
--
ALTER TABLE `hv1sys_model_has_roles`
  ADD PRIMARY KEY (`role_id`,`model_id`,`model_type`),
  ADD KEY `model_has_roles_model_id_model_type_index` (`model_id`,`model_type`);

--
-- Индексы таблицы `hv1sys_password_resets`
--
ALTER TABLE `hv1sys_password_resets`
  ADD KEY `hv1sys_password_resets_email_index` (`email`);

--
-- Индексы таблицы `hv1sys_permissions`
--
ALTER TABLE `hv1sys_permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `hv1sys_permissions_name_guard_name_unique` (`name`,`guard_name`);

--
-- Индексы таблицы `hv1sys_personal_access_tokens`
--
ALTER TABLE `hv1sys_personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `hv1sys_personal_access_tokens_token_unique` (`token`),
  ADD KEY `hv1sys_personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Индексы таблицы `hv1sys_quests`
--
ALTER TABLE `hv1sys_quests`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Индексы таблицы `hv1sys_quest_minigames`
--
ALTER TABLE `hv1sys_quest_minigames`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `hv1sys_quest_minigames_name_unique` (`name`) USING BTREE;

--
-- Индексы таблицы `hv1sys_quest_statuses`
--
ALTER TABLE `hv1sys_quest_statuses`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `hv1sys_quest_statuses_name_unique` (`name`);

--
-- Индексы таблицы `hv1sys_quest_terminals`
--
ALTER TABLE `hv1sys_quest_terminals`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `hv1sys_quest_terminals_name_unique` (`name`) USING BTREE;

--
-- Индексы таблицы `hv1sys_role_has_permissions`
--
ALTER TABLE `hv1sys_role_has_permissions`
  ADD PRIMARY KEY (`permission_id`,`role_id`),
  ADD KEY `hv1sys_role_has_permissions_role_id_foreign` (`role_id`);

--
-- Индексы таблицы `hv1sys_shop_orders`
--
ALTER TABLE `hv1sys_shop_orders`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `hv1sys_shop_orders_user_id_foreign` (`user_id`) USING BTREE,
  ADD KEY `hv1sys_shop_orders_product_id_foreign` (`product_id`) USING BTREE;

--
-- Индексы таблицы `hv1sys_shop_orderstatuses`
--
ALTER TABLE `hv1sys_shop_orderstatuses`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `hv1sys_quest_minigames_name_unique` (`name`) USING BTREE;

--
-- Индексы таблицы `hv1sys_shop_products`
--
ALTER TABLE `hv1sys_shop_products`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Индексы таблицы `hv1sys_users`
--
ALTER TABLE `hv1sys_users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Индексы таблицы `hv1sys_user_quest`
--
ALTER TABLE `hv1sys_user_quest`
  ADD PRIMARY KEY (`user_id`,`quest_id`) USING BTREE,
  ADD KEY `hv1sys_user_quest_quest_id_foreign` (`quest_id`) USING BTREE;

--
-- Индексы таблицы `quests`
--
ALTER TABLE `quests`
  ADD PRIMARY KEY (`questId`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`userId`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `hv1sys_conversations`
--
ALTER TABLE `hv1sys_conversations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- AUTO_INCREMENT для таблицы `hv1sys_failed_jobs`
--
ALTER TABLE `hv1sys_failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `hv1sys_messages`
--
ALTER TABLE `hv1sys_messages`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=554;

--
-- AUTO_INCREMENT для таблицы `hv1sys_migrations`
--
ALTER TABLE `hv1sys_migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT для таблицы `hv1sys_permissions`
--
ALTER TABLE `hv1sys_permissions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `hv1sys_personal_access_tokens`
--
ALTER TABLE `hv1sys_personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `hv1sys_quests`
--
ALTER TABLE `hv1sys_quests`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'ID', AUTO_INCREMENT=904828;

--
-- AUTO_INCREMENT для таблицы `hv1sys_quest_minigames`
--
ALTER TABLE `hv1sys_quest_minigames`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT для таблицы `hv1sys_quest_statuses`
--
ALTER TABLE `hv1sys_quest_statuses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `hv1sys_quest_terminals`
--
ALTER TABLE `hv1sys_quest_terminals`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `hv1sys_shop_orders`
--
ALTER TABLE `hv1sys_shop_orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=190;

--
-- AUTO_INCREMENT для таблицы `hv1sys_shop_orderstatuses`
--
ALTER TABLE `hv1sys_shop_orderstatuses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `hv1sys_shop_products`
--
ALTER TABLE `hv1sys_shop_products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `hv1sys_users`
--
ALTER TABLE `hv1sys_users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;

--
-- AUTO_INCREMENT для таблицы `quests`
--
ALTER TABLE `quests`
  MODIFY `questId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=904668;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `hv1sys_model_has_permissions`
--
ALTER TABLE `hv1sys_model_has_permissions`
  ADD CONSTRAINT `hv1sys_model_has_permissions_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `hv1sys_permissions` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `hv1sys_model_has_roles`
--
ALTER TABLE `hv1sys_model_has_roles`
  ADD CONSTRAINT `hv1sys_model_has_roles_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `u1611639_bas`.`hv1sys_roles` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `hv1sys_role_has_permissions`
--
ALTER TABLE `hv1sys_role_has_permissions`
  ADD CONSTRAINT `hv1sys_role_has_permissions_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `hv1sys_permissions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `hv1sys_role_has_permissions_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `u1611639_bas`.`hv1sys_roles` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `hv1sys_shop_orders`
--
ALTER TABLE `hv1sys_shop_orders`
  ADD CONSTRAINT `hv1sys_shop_orders_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `hv1sys_shop_products` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Ограничения внешнего ключа таблицы `hv1sys_user_quest`
--
ALTER TABLE `hv1sys_user_quest`
  ADD CONSTRAINT `hv1sys_user_quest_quest_id_foreign` FOREIGN KEY (`quest_id`) REFERENCES `hv1sys_quests` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  ADD CONSTRAINT `hv1sys_user_quest_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `hv1sys_users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
